**FREE
// Elabora richiesta di chiamate http fatte da un programma esterno
Ctl-Opt  DftActGrp(*no)
  ActGrp(*StgMdl)
  StgMdl(*SNGLVL)
  Bnddir('AL400MNUV2': 'WEBSCKDIR' : 'TESTBND')
  Thread(*Concurrent)
  Option(*NoUnRef :*SrcStmt :*NoDebugIo)
  DatFmt(*Iso) TimFmt(*Iso)
  Debug(*Constants)
  AlwNull(*UsrCtl)
  DftName(TESTCONT1)
  Text('Test contattone');
// ___________________________________________________________________
/Include QSYSINC/QRPGLESRC,PTHREAD
/Include Roberto/qrpglesrc,copy_pr
/Include Roberto/qrpglesrc,copy_ds

/copy Al400mnuv2/QRpgleSrc,UMiFunc_h
// Prototipi
Dcl-Pr TESTCONT1 ExtPgm('TESTCONT1');
End-Pr TESTCONT1;

Dcl-Pi TESTCONT1;
End-Pi TESTCONT1;

Dcl-Pr USleep   Int(10) ExtProc('usleep');
  MilliSeconds Uns(10) Value;
End-Pr USleep;
Dcl-Pr Sleep   Int(10) ExtProc('sleep');
  Seconds Uns(10) Value;
End-Pr Sleep;

Dcl-Pr Cmd   Int(10) ExtProc('system');
  CmdString Pointer Value Options(*String);
End-Pr Cmd;

Dcl-s Command  VarChar(1000);
Dcl-S ErrMsgId Char(7) Import('_EXCP_MSGID');
//  @remark CHKLKVAL and CLRLKVAL are available since V5R3
dcl-pr CheckLockValue int(10) extproc('_CHKLKVAL');
  *n int(20); // lock
  *n int(20) value; // old_val
  *n int(20) value; // new_val
end-pr;

//  @BIF _CLRKLVAL (Clear Lock Value (CLRLKVAL))
dcl-pr ClearLockValue extproc('_CLRLKVAL');
  *n int(20); // lock
  *n int(20) value; // new_val
end-pr;

// ____________________________________________________________________________
Dcl-Ds thread LikeDs(pthread_t) Dim(1659) Static(*allthread);

Dcl-Ds a Static(*allthread);
  ThreadReadyArr       Char(1) Dim(1659) ;
  ThreadReady          Char(1659) Pos(1) ;
End-Ds;

Dcl-S Rc                 Int(10);
Dcl-S IdxMain            Int(10) ;
Dcl-S Status             Int(10) ;
Dcl-S PtrStatus          Pointer inz(%Addr(Status));
Dcl-Ds Contattoni;
  *n Char(32) inz('34372036170820211759073559071759');
  *n Char(32) inz('34362835170826281759072459071759');
  *n Char(32) inz('34362431170826241759072459071759');
  *n Char(32) inz('34362237170826231759072459071759');
  *n Char(32) inz('34362732170825201759072459071759');
  *n Char(32) inz('34362330170825261759072259071759');
  *n Char(32) inz('34362335171824221759072259071759');
  *n Char(32) inz('34362137171823261759072259071759');
  *n Char(32) inz('34362030171823281759072259071759');
  *n Char(32) inz('34362835171822211759072259071759');
  *n Char(32) inz('34362736171822251759072259071759');
  *n Char(32) inz('34362430171822221759072259071759');
  *n Char(32) inz('34362437171822211759072259071759');
  *n Char(32) inz('34362330172822221759072259071759');
  *n Char(32) inz('34362132172822251759076159071759');
  *n Char(32) inz('34362932172821251759072259071759');
  *n Char(32) inz('34362831172821211759072259071759');
  *n Char(32) inz('34362835172821201759072259071759');
  *n Char(32) inz('34362637173821251759072059071759');
  *n Char(32) inz('34362537173821231759072059071759');
  *n Char(32) inz('34362538173821221759072059071759');
  *n Char(32) inz('34362538173821201759072859071759');
  *n Char(32) inz('34362134171821261759072859071759');
  *n Char(32) inz('34362035171821201759072859071759');
  *n Char(32) inz('34362735171820211759072859071759');
  *n Char(32) inz('34362537171820241759072859071759');
  *n Char(32) inz('34362438171825291759072159071759');
  *n Char(32) inz('34362335171821291759072859071759');
  *n Char(32) inz('34362537170822241759072859071759');
  *n Char(32) inz('34362535170822241759072859071759');
  *n Char(32) inz('34362534170822241759072859071759');
  *n Char(32) inz('34362533170822241759072859071759');
  *n Char(32) inz('34362531170822241759072859071759');
  *n Char(32) inz('34362539170822231759072859071759');
  *n Char(32) inz('34362537170822231759072859071759');
  *n Char(32) inz('34362530171822231759072859071759');
  *n Char(32) inz('34362539171822221759072859071759');
  *n Char(32) inz('34362538171822221759072859071759');
  *n Char(32) inz('34362536171822221759072859071759');
  *n Char(32) inz('34362534171822221759072859071759');
  *n Char(32) inz('34362530171822221759072859071759');
  *n Char(32) inz('34362538171822211759072859071759');
  *n Char(32) inz('34362537171822211759072759071759');
  *n Char(32) inz('34362534173822211759072759071759');
  *n Char(32) inz('34362533173822211759072759071759');
  *n Char(32) inz('34362530173822211759072759071759');
  *n Char(32) inz('34362538173822201759072759071759');
  *n Char(32) inz('34362536173822201759072759071759');
  *n Char(32) inz('34362535173822201759072759071759');
  *n Char(32) inz('34362530273822201759072759071759');
  *n Char(32) inz('34362436273822291759072759071759');
  *n Char(32) inz('34362433273822291759072759071759');
  *n Char(32) inz('34362432273822291759072759071759');
  *n Char(32) inz('34362430273822291759072759071759');
  *n Char(32) inz('34362439273822281759072759071759');
  *n Char(32) inz('34362438273822281759072759071759');
  *n Char(32) inz('34362437273822281759072759071759');
  *n Char(32) inz('34362436272822281759072759071759');
  *n Char(32) inz('34362433272822281759072759071759');
  *n Char(32) inz('34362431272822281759072759071759');
  *n Char(32) inz('34362430272822281759072759071759');
  *n Char(32) inz('34362438272822271759072759071759');
  *n Char(32) inz('34362435270822271759072759071759');
  *n Char(32) inz('34362434270822271759072759071759');
  *n Char(32) inz('34362433270822271759072759071759');
  *n Char(32) inz('34362432270822271759072759071759');
  *n Char(32) inz('34362430270822271759072759071759');
  *n Char(32) inz('34362439270822261759072759071759');
  *n Char(32) inz('34362438270822261759072759071759');
  *n Char(32) inz('34362435270822261759072759071759');
  *n Char(32) inz('34362431271822261759072759071759');
  *n Char(32) inz('34362430271822261759072759071759');
  *n Char(32) inz('34362438271822251759072759071759');
  *n Char(32) inz('34362436271822251759072759071759');
  *n Char(32) inz('34362432271822251759072759071759');
  *n Char(32) inz('34362936272820251759072759071759');
  *n Char(32) inz('34362434272825241759072759071759');
  *n Char(32) inz('34362431272825211759072759071759');
  *n Char(32) inz('34362038272821221759072759071759');
  *n Char(32) inz('34362837272821281759072759071759');
  *n Char(32) inz('34362530272828201759072759071759');
  *n Char(32) inz('34362533272829241759072759071759');
  *n Char(32) inz('34362437272829211759072759071759');
  *n Char(32) inz('34362835273828201759072759071759');
  *n Char(32) inz('34362435273828211759072759071759');
  *n Char(32) inz('34362034273828231759072759071759');
  *n Char(32) inz('34362832273827291759072759071759');
  *n Char(32) inz('34362534273827291759072759071759');
  *n Char(32) inz('34362137273827281759072759071759');
  *n Char(32) inz('34362038273827231759072759071759');
  *n Char(32) inz('34362638273826211759072759071759');
  *n Char(32) inz('34362636271826211759072759071759');
  *n Char(32) inz('34362033271826261759072759071759');
  *n Char(32) inz('34362539271825221759072759071759');
  *n Char(32) inz('34362437271825291759072759071759');
  *n Char(32) inz('34362235271825271759072759071759');
  *n Char(32) inz('34362335271824201759072759071759');
  *n Char(32) inz('34362930271823261759072759071759');
  *n Char(32) inz('34362630270823261759072759071759');
  *n Char(32) inz('34362030270823251759072759071759');
  *n Char(32) inz('34362937270821251759072759071759');
  *n Char(32) inz('34362735270821221759072759071759');
  *n Char(32) inz('34362632270821271759072759071759');
  *n Char(32) inz('34362133270821271759072759071759');
  *n Char(32) inz('34362137270821201759072759071759');
  *n Char(32) inz('34362030270821241759072759071759');
  *n Char(32) inz('34362939271820231759072759071759');
  *n Char(32) inz('34362838271820251759072759071759');
  *n Char(32) inz('34362338271829291759072759071759');
  *n Char(32) inz('34362232271829261759072759071759');
  *n Char(32) inz('34362234271829241759072759071759');
  *n Char(32) inz('34362235271829211759072759071759');
  *n Char(32) inz('34362134271829271759072759071759');
  *n Char(32) inz('34362934271828271759072759071759');
  *n Char(32) inz('34362836271828281759072759071759');
  *n Char(32) inz('34362733273828281759072759071759');
  *n Char(32) inz('34362633273828281759072759071759');
  *n Char(32) inz('34362634273828261759072759071759');
  *n Char(32) inz('34362536273828281759072759071759');
  *n Char(32) inz('34362439273828261759072759071759');
  *n Char(32) inz('34362230273828271759072759071759');
  *n Char(32) inz('34362231273828251759072759071759');
  *n Char(32) inz('34362237373828231759072759071759');
  *n Char(32) inz('34362138373828231759072759071759');
  *n Char(32) inz('34362031373828291759072759071759');
  *n Char(32) inz('34362034373828281759072759071759');
  *n Char(32) inz('34362038373828261759072759071759');
  *n Char(32) inz('34362034373828221759072759071759');
  *n Char(32) inz('34362936373827291759072759071759');
  *n Char(32) inz('34362930372827271759072759071759');
  *n Char(32) inz('34362930372827241759072759071759');
  *n Char(32) inz('34362837372827251759072759071759');
  *n Char(32) inz('34362836372827231759072759071759');
  *n Char(32) inz('34362632372827261759072759071759');
  *n Char(32) inz('34362530372827221759072759071759');
  *n Char(32) inz('34362437372827291759072759071759');
  *n Char(32) inz('34362436370827261759072759071759');
  *n Char(32) inz('34362432370827261759072759071759');
  *n Char(32) inz('34362338370827241759072759071759');
  *n Char(32) inz('34362230370827271759072759071759');
  *n Char(32) inz('34362232370827251759072759071759');
  *n Char(32) inz('34362134370827261759072759071759');
  *n Char(32) inz('34362133370827261759072759071759');
  *n Char(32) inz('34362039370827281759072759071759');
  *n Char(32) inz('34362038371827281759072759071759');
  *n Char(32) inz('34362939371826221759072759071759');
  *n Char(32) inz('34362637371826251759072759071759');
  *n Char(32) inz('34362531371826261759072759071759');
  *n Char(32) inz('34362436371826281759072759071759');
  *n Char(32) inz('34362335371826281759072759071759');
  *n Char(32) inz('34362231371826271759072759071759');
  *n Char(32) inz('34362931371825201759072759071759');
  *n Char(32) inz('34362837371825281759072759071759');
  *n Char(32) inz('34362636371825251759072759071759');
  *n Char(32) inz('34362630372825201759072759071759');
  *n Char(32) inz('34362539372825291759072759071759');
  *n Char(32) inz('34362533372825251759072759071759');
  *n Char(32) inz('34362538372825241759072759071759');
  *n Char(32) inz('34362533372825231759072759071759');
  *n Char(32) inz('34362438372825251759072759071759');
  *n Char(32) inz('34362430372825241759072759071759');
  *n Char(32) inz('34362438372825201759072759071759');
  *n Char(32) inz('34362337373825281759072759071759');
  *n Char(32) inz('34362336373825241759072759071759');
  *n Char(32) inz('34362233373825291759072759071759');
  *n Char(32) inz('34362137373825201759072759071759');
  *n Char(32) inz('34362037373825221759072759071759');
  *n Char(32) inz('34362931373824221759072759071759');
  *n Char(32) inz('34362938373824211759072759071759');
  *n Char(32) inz('34362831373824291759072759071759');
  *n Char(32) inz('34362834371824231759072759071759');
  *n Char(32) inz('34362839371824201759072759071759');
  *n Char(32) inz('34362832371824201759072759071759');
  *n Char(32) inz('34362830371824201759072759071759');
  *n Char(32) inz('34362731371824231759072759071759');
  *n Char(32) inz('34362730371824221759072759071759');
  *n Char(32) inz('34362639371824291759072759071759');
  *n Char(32) inz('34362634371824261759072759071759');
  *n Char(32) inz('34362532370824291759072759071759');
  *n Char(32) inz('34362538370824251759072759071759');
  *n Char(32) inz('34362534370824251759072759071759');
  *n Char(32) inz('34362532370824221759072759071759');
  *n Char(32) inz('34362435370824281759072759071759');
  *n Char(32) inz('34362439370824251759072759071759');
  *n Char(32) inz('34362236370824251759072759071759');
  *n Char(32) inz('34362136371824281759072759071759');
  *n Char(32) inz('34362131371824221759072759071759');
  *n Char(32) inz('34362136371824201759072759071759');
  *n Char(32) inz('34362036371824261759072759071759');
  *n Char(32) inz('34362038371824251759072759071759');
  *n Char(32) inz('34362031371824231759072759071759');
  *n Char(32) inz('34362933371823201759072759071759');
  *n Char(32) inz('34362136371822261759072759071759');
  *n Char(32) inz('34362832371823211759072759071759');
  *n Char(32) inz('34362739373823251759072759071759');
  *n Char(32) inz('34362738373823221759072759071759');
  *n Char(32) inz('34362733373823221759072759071759');
  *n Char(32) inz('34362630373823291759072759071759');
  *n Char(32) inz('34362638373823231759072759071759');
  *n Char(32) inz('34362532373823261759072759071759');
  *n Char(32) inz('34362516373823231759072759071759');
  *n Char(32) inz('34362517373823221759072759071759');
  *n Char(32) inz('34362411373823261759072759071759');
  *n Char(32) inz('34362411373823251759072759071759');
  *n Char(32) inz('34362410373823231759072759071759');
  *n Char(32) inz('34362314373823271759072759071759');
  *n Char(32) inz('34362319373823211759072759071759');
  *n Char(32) inz('34362314373823211759072759071759');
  *n Char(32) inz('34362210373823261759072759071759');
  *n Char(32) inz('34362214372823251759072759071759');
  *n Char(32) inz('34362215372823221759072759071759');
  *n Char(32) inz('34362114372823251759072759071759');
  *n Char(32) inz('34362118372823241759072759071759');
  *n Char(32) inz('34362114372823241759072759071759');
  *n Char(32) inz('34362112372823231759072759071759');
  *n Char(32) inz('34362110372823221759072759071759');
  *n Char(32) inz('34362110372823211759072759071759');
  *n Char(32) inz('34362013370823231759072759071759');
  *n Char(32) inz('34362010370823231759072759071759');
  *n Char(32) inz('34362017370823211759072759071759');
  *n Char(32) inz('34362915370822271759072759071759');
  *n Char(32) inz('34362813370822291759072759071759');
  *n Char(32) inz('34362813370822251759072759071759');
  *n Char(32) inz('34362811370822231759072759071759');
  *n Char(32) inz('34362714370822211759072759071759');
  *n Char(32) inz('34362613370822291759072759071759');
  *n Char(32) inz('34362613371822251759072759071759');
  *n Char(32) inz('34362617371822201759072759071759');
  *n Char(32) inz('34362415371822231759072759071759');
  *n Char(32) inz('34362310371822271759072759071759');
  *n Char(32) inz('34362316371822211759072759071759');
  *n Char(32) inz('34362212371822281759072759071759');
  *n Char(32) inz('34362213371822251759072759071759');
  *n Char(32) inz('34362210372822241759072759071759');
  *n Char(32) inz('34362210372822221759072759071759');
  *n Char(32) inz('34362114372822241759072759071759');
  *n Char(32) inz('34362110372822211759072759071759');
  *n Char(32) inz('34362015372822261759072759071759');
  *n Char(32) inz('34362010372822251759072759071759');
  *n Char(32) inz('34362018372822211759072759071759');
  *n Char(32) inz('34362011372822211759072759071759');
  *n Char(32) inz('34362018372822201759072759071759');
  *n Char(32) inz('34362919373821291759072759071759');
  *n Char(32) inz('34362917373821231759072759071759');
  *n Char(32) inz('34362918373821221759072759071759');
  *n Char(32) inz('34362910373821211759072759071759');
  *n Char(32) inz('34362815373821281759072759071759');
  *n Char(32) inz('34362810373821231759072759071759');
  *n Char(32) inz('34362710373821291759072759071759');
  *n Char(32) inz('34362715373821201759072759071759');
  *n Char(32) inz('34362515373821271759072759071759');
  *n Char(32) inz('34362510371821271759072759071759');
  *n Char(32) inz('34362511371821241759072759071759');
  *n Char(32) inz('34362519371821211759072759071759');
  *n Char(32) inz('34362417371821201759072759071759');
  *n Char(32) inz('34362317371821271759072759071759');
  *n Char(32) inz('34362312371821221759072759071759');
  *n Char(32) inz('34362119371821281759072759071759');
  *n Char(32) inz('34362115371821281759072759071759');
  *n Char(32) inz('34362114370821281759072759071759');
  *n Char(32) inz('34362118370821271759072759071759');
  *n Char(32) inz('34362112370821241759072759071759');
  *n Char(32) inz('34362112370821211759072759071759');
  *n Char(32) inz('34362019370821261759072759071759');
  *n Char(32) inz('34362017370821251759072759071759');
  *n Char(32) inz('34362911370820281759072759071759');
  *n Char(32) inz('34362912370820221759072759071759');
  *n Char(32) inz('34362815370820231759072759071759');
  *n Char(32) inz('34362811371820221759072759071759');
  *n Char(32) inz('34362710371820271759072759071759');
  *n Char(32) inz('34362611371820211759072759071759');
  *n Char(32) inz('34362617371820201759072759071759');
  *n Char(32) inz('34362615371820201759072759071759');
  *n Char(32) inz('34362514371828211759072759071759');
  *n Char(32) inz('34362618371825261759072759071759');
  *n Char(32) inz('34362614371820271759072759071759');
  *n Char(32) inz('34372414373820211759072759071759');
  *n Char(32) inz('34362713373827281759072759071759');
  *n Char(32) inz('34362713373827271759072759071759');
  *n Char(32) inz('34362913373824271759072759071759');
  *n Char(32) inz('34362816373822231759072759071759');
  *n Char(32) inz('34362311373821241759072759071759');
  *n Char(32) inz('34362517373826251759072759071759');
  *n Char(32) inz('34362819373823271759072759071759');
  *n Char(32) inz('34362717373821231759072759071759');
  *n Char(32) inz('34362313373821231759072759071759');
  *n Char(32) inz('34362013273821201759072759071759');
  *n Char(32) inz('34362610273824211759072759071759');
  *n Char(32) inz('34362015273823221759072759071759');
  *n Char(32) inz('34362817273822261759072759071759');
  *n Char(32) inz('34362818273827291759072759071759');
  *n Char(32) inz('34362311273823201759072759071759');
  *n Char(32) inz('34362714273828281759072759071759');
  *n Char(32) inz('34362111272828261759072759071759');
  *n Char(32) inz('34362413272827211759072759071759');
  *n Char(32) inz('34362513272827261759072759071759');
  *n Char(32) inz('34362313272826201759072759071759');
  *n Char(32) inz('34362616272824251759072759071759');
  *n Char(32) inz('34362112272824231759072759071759');
  *n Char(32) inz('34362015272824201759072759071759');
  *n Char(32) inz('34362310272823231759072759071759');
  *n Char(32) inz('34362512272821211759072759071759');
  *n Char(32) inz('34362417270821291759072759071759');
  *n Char(32) inz('34362111270821271759072759071759');
  *n Char(32) inz('34362519270829231759072759071759');
  *n Char(32) inz('34362514270829221759072759071759');
  *n Char(32) inz('34362518270829201759072759071759');
  *n Char(32) inz('34362418270829291759072759071759');
  *n Char(32) inz('34362415271829281759072759071759');
  *n Char(32) inz('34362419271829271759072759071759');
  *n Char(32) inz('34362418271829271759072759071759');
  *n Char(32) inz('34362413271829261759072759071759');
  *n Char(32) inz('34362412271829261759072759071759');
  *n Char(32) inz('34362411271829241759072759071759');
  *n Char(32) inz('34362414271829211759072759071759');
  *n Char(32) inz('34362412272829211759072759071759');
  *n Char(32) inz('34362416272829201759072759071759');
  *n Char(32) inz('34362314272829281759072759071759');
  *n Char(32) inz('34362314272829271759072759071759');
  *n Char(32) inz('34362319272829261759072759071759');
  *n Char(32) inz('34362316272829261759072759071759');
  *n Char(32) inz('34362314272829261759072759071759');
  *n Char(32) inz('34362316272829251759072759071759');
  *n Char(32) inz('34362311273829241759072759071759');
  *n Char(32) inz('34362310273829241759072759071759');
  *n Char(32) inz('34362319273829221759072759071759');
  *n Char(32) inz('34362313273829221759072759071759');
  *n Char(32) inz('34362311273829221759072759071759');
  *n Char(32) inz('34362318273829211759072759071759');
  *n Char(32) inz('34362317271829211759072759071759');
  *n Char(32) inz('34362314271829211759072759071759');
  *n Char(32) inz('34362219271829281759072759071759');
  *n Char(32) inz('34362210271829281759072759071759');
  *n Char(32) inz('34362217271829271759072759071759');
  *n Char(32) inz('34362214271829261759072759071759');
  *n Char(32) inz('34362216271829251759072759071759');
  *n Char(32) inz('34362216271829241759072759071759');
  *n Char(32) inz('34362212270829231759072759071759');
  *n Char(32) inz('34362114270829291759072759071759');
  *n Char(32) inz('34362119270829281759072759071759');
  *n Char(32) inz('34362113270829271759072759071759');
  *n Char(32) inz('34362110270829261759072759071759');
  *n Char(32) inz('34362119270829251759072759071759');
  *n Char(32) inz('34362119270829241759072759071759');
  *n Char(32) inz('34362119270829231759072759071759');
  *n Char(32) inz('34362115271829231759072759071759');
  *n Char(32) inz('34362115271829221759072759071759');
  *n Char(32) inz('34362111271829221759072759071759');
  *n Char(32) inz('34362110271829221759072759071759');
  *n Char(32) inz('34362112271829211759072759071759');
  *n Char(32) inz('34362116271829201759072759071759');
  *n Char(32) inz('34362114271829201759072759071759');
  *n Char(32) inz('34362113271829201759072759071759');
  *n Char(32) inz('34362111273829201759072759071759');
  *n Char(32) inz('34362011273829291759072759071759');
  *n Char(32) inz('34362216273829201759072759071759');
  *n Char(32) inz('34362019273829271759072759071759');
  *n Char(32) inz('34362014273829271759072759071759');
  *n Char(32) inz('34362019273829251759072759071759');
  *n Char(32) inz('34362010273829241759072759071759');
  *n Char(32) inz('34362019273829231759072759071759');
  *n Char(32) inz('34362017073829231759072759071759');
  *n Char(32) inz('34362018073829221759072759071759');
  *n Char(32) inz('34362017073829221759072759071759');
  *n Char(32) inz('34362019073829211759072759071759');
  *n Char(32) inz('34362015073829201759072759071759');
  *n Char(32) inz('34362919073828291759072759071759');
  *n Char(32) inz('34362916073828291759072759071759');
  *n Char(32) inz('34362910073828271759072759071759');
  *n Char(32) inz('34362918072828261759072759071759');
  *n Char(32) inz('34362914072828261759072759071759');
  *n Char(32) inz('34362912072828251759072759071759');
  *n Char(32) inz('34362913072828231759072759071759');
  *n Char(32) inz('34362911072828231759072759071759');
  *n Char(32) inz('34362917072828221759072759071759');
  *n Char(32) inz('34362916072828221759072759071759');
  *n Char(32) inz('34362916072828211759072759071759');
  *n Char(32) inz('34362914070828211759072759071759');
  *n Char(32) inz('34362816070828291759072759071759');
  *n Char(32) inz('34362814070828291759072759071759');
  *n Char(32) inz('34362812070828291759072759071759');
  *n Char(32) inz('34362811070828291759072759071759');
  *n Char(32) inz('34362817070828281759072759071759');
  *n Char(32) inz('34362810070828281759072759071759');
  *n Char(32) inz('34362819070828271759072759071759');
  *n Char(32) inz('34362811071828271759072759071759');
  *n Char(32) inz('34362818071828261759072759071759');
  *n Char(32) inz('34362817071828261759072759071759');
  *n Char(32) inz('34362810071828261759072759071759');
  *n Char(32) inz('34362814071828251759072759071759');
  *n Char(32) inz('34362813071828231759072759071759');
  *n Char(32) inz('34362818071828221759072759071759');
  *n Char(32) inz('34362817072828221759072759071759');
  *n Char(32) inz('34362814072828221759072759071759');
  *n Char(32) inz('34362811072828221759072759071759');
  *n Char(32) inz('34362711072828271759072759071759');
  *n Char(32) inz('34362713072828261759072759071759');
  *n Char(32) inz('34362711072828261759072759071759');
  *n Char(32) inz('34362717072828251759072759071759');
  *n Char(32) inz('34362713073828251759072759071759');
  *n Char(32) inz('34362716073828231759072759071759');
  *n Char(32) inz('34362718073828221759072759071759');
  *n Char(32) inz('34362719073828211759072759071759');
  *n Char(32) inz('34362618073828291759072759071759');
  *n Char(32) inz('34362617073828281759072759071759');
  *n Char(32) inz('34362615073828271759072759071759');
  *n Char(32) inz('34362614071828251759072759071759');
  *n Char(32) inz('34362610071828251759072759071759');
  *n Char(32) inz('34362615071828231759072759071759');
  *n Char(32) inz('34362616071828221759072759071759');
  *n Char(32) inz('34362516071828291759072759071759');
  *n Char(32) inz('34362511071828281759072759071759');
  *n Char(32) inz('34362510071828281759072759071759');
  *n Char(32) inz('34362516071828271759072759071759');
  *n Char(32) inz('34362510070828241759072759071759');
  *n Char(32) inz('34362512070828231759072759071759');
  *n Char(32) inz('34362511070828221759072759071759');
  *n Char(32) inz('34362513070828211759072759071759');
  *n Char(32) inz('34362512070828211759072759071759');
  *n Char(32) inz('34362512070828201759072759071759');
  *n Char(32) inz('34362418071828271759072759071759');
  *n Char(32) inz('34362416071828271759072759071759');
  *n Char(32) inz('34362415071828271759072759071759');
  *n Char(32) inz('34362413071828271759072759071759');
  *n Char(32) inz('34362416071828251759072759071759');
  *n Char(32) inz('34362418073828241759072759071759');
  *n Char(32) inz('34362417073828211759072759071759');
  *n Char(32) inz('34362412073828211759072759071759');
  *n Char(32) inz('34362410073828201759072759071759');
  *n Char(32) inz('34362313073828271759072759071759');
  *n Char(32) inz('34362315073828261759072759071759');
  *n Char(32) inz('34362316073828251759072759071759');
  *n Char(32) inz('34362315073828251759072759071759');
  *n Char(32) inz('34362316173828221759072759071759');
  *n Char(32) inz('34362310173828221759072759071759');
  *n Char(32) inz('34362318173828211759072759071759');
  *n Char(32) inz('34362313173828211759072759071759');
  *n Char(32) inz('34362210173828281759072759071759');
  *n Char(32) inz('34362217172828261759072759071759');
  *n Char(32) inz('34362215172828261759072759071759');
  *n Char(32) inz('34362210172828251759072759071759');
  *n Char(32) inz('34362217172828241759072759071759');
  *n Char(32) inz('34362216172828241759072759071759');
  *n Char(32) inz('34362211172828241759072759071759');
  *n Char(32) inz('34362214170828231759072759071759');
  *n Char(32) inz('34362214170828221759072759071759');
  *n Char(32) inz('34362211170828221759072759071759');
  *n Char(32) inz('34362210170828221759072759071759');
  *n Char(32) inz('34362214170828211759072759071759');
  *n Char(32) inz('34362213170828211759072759071759');
  *n Char(32) inz('34362210170828211759072759071759');
  *n Char(32) inz('34362217171828201759072759071759');
  *n Char(32) inz('34362119171828291759072759071759');
  *n Char(32) inz('34362115171828281759072759071759');
  *n Char(32) inz('34362111171828271759072759071759');
  *n Char(32) inz('34362118171828261759072759071759');
  *n Char(32) inz('34362115171828261759072759071759');
  *n Char(32) inz('34362112172828261759072759071759');
  *n Char(32) inz('34362111172828251759072759071759');
  *n Char(32) inz('34362117172828241759072759071759');
  *n Char(32) inz('34362114172828241759072759071759');
  *n Char(32) inz('34362110172828241759072759071759');
  *n Char(32) inz('34362111172828231759072759071759');
  *n Char(32) inz('34362114172828201759072759071759');
  *n Char(32) inz('34362013173828271759072759071759');
  *n Char(32) inz('34362016173828241759072759071759');
  *n Char(32) inz('34362014173828241759072759071759');
  *n Char(32) inz('34362019173828231759072759071759');
  *n Char(32) inz('34362013171828221759072759071759');
  *n Char(32) inz('34362018171828211759072759071759');
  *n Char(32) inz('34362012171828211759072759071759');
  *n Char(32) inz('34362912171827291759072759071759');
  *n Char(32) inz('34362911171827291759072759071759');
  *n Char(32) inz('34362919171827281759072759071759');
  *n Char(32) inz('34362910170827281759072759071759');
  *n Char(32) inz('34362917170827251759072759071759');
  *n Char(32) inz('34362914170827251759072759071759');
  *n Char(32) inz('34362915170827241759072759071759');
  *n Char(32) inz('34362912170827241759072759071759');
  *n Char(32) inz('34362916171827231759072759071759');
  *n Char(32) inz('34362912171827221759072759071759');
  *n Char(32) inz('34362916171827211759072759071759');
  *n Char(32) inz('34362913171827211759072759071759');
  *n Char(32) inz('34362817171827291759072759071759');
  *n Char(32) inz('34362819171827261759072759071759');
  *n Char(32) inz('34362818171827261759072759071759');
  *n Char(32) inz('34362816173827261759072759071759');
  *n Char(32) inz('34362819173827251759072759071759');
  *n Char(32) inz('34362816173827251759072759071759');
  *n Char(32) inz('34362818173827241759072759071759');
  *n Char(32) inz('34362814173827241759072759071759');
  *n Char(32) inz('34362813173827241759072759071759');
  *n Char(32) inz('34362818173827231759072759071759');
  *n Char(32) inz('34362811273827231759072759071759');
  *n Char(32) inz('34362811273827221759072759071759');
  *n Char(32) inz('34362819273827211759072759071759');
  *n Char(32) inz('34362818273827211759072759071759');
  *n Char(32) inz('34362816273827211759072759071759');
  *n Char(32) inz('34362712273827281759072759071759');
  *n Char(32) inz('34362717272827241759072759071759');
  *n Char(32) inz('34362719272827221759072759071759');
  *n Char(32) inz('34362719272827211759071559071759');
  *n Char(32) inz('34362614272827291759071559071759');
  *n Char(32) inz('34362612272827291759071559071759');
  *n Char(32) inz('34362611272827291759071559071759');
  *n Char(32) inz('34362616272827281759071559071759');
  *n Char(32) inz('34362618270827271759071559071759');
  *n Char(32) inz('34362612270827271759071559071759');
  *n Char(32) inz('34362618270827261759071559071759');
  *n Char(32) inz('34362617270827261759071559071759');
  *n Char(32) inz('34362615270827261759071559071759');
  *n Char(32) inz('34362612270827241759071559071759');
  *n Char(32) inz('34362618271827221759071559071759');
  *n Char(32) inz('34362615271827211759071559071759');
  *n Char(32) inz('34362614271827211759071559071759');
  *n Char(32) inz('34362518271827281759071559071759');
  *n Char(32) inz('34362515272827271759071559071759');
  *n Char(32) inz('34362516272827251759071559071759');
  *n Char(32) inz('34362514272827251759071559071759');
  *n Char(32) inz('34362511272827251759071559071759');
  *n Char(32) inz('34362519272827241759071559071759');
  *n Char(32) inz('34362517272827241759071559071759');
  *n Char(32) inz('34362516272827221759071559071759');
  *n Char(32) inz('34362514273827221759071559071759');
  *n Char(32) inz('34362513273827221759071559071759');
  *n Char(32) inz('34362517273827211759071559071759');
  *n Char(32) inz('34362516273827201759071559071759');
  *n Char(32) inz('34362416273827291759071559071759');
  *n Char(32) inz('34362412271827291759071559071759');
  *n Char(32) inz('34362411271827291759071559071759');
  *n Char(32) inz('34362416271827281759071559071759');
  *n Char(32) inz('34362410271827281759071559071759');
  *n Char(32) inz('34362417271827271759071559071759');
  *n Char(32) inz('34362414271827271759071559071759');
  *n Char(32) inz('34362410271827251759071559071759');
  *n Char(32) inz('34362419270827241759071559071759');
  *n Char(32) inz('34362418270827241759071559071759');
  *n Char(32) inz('34362415270827241759071559071759');
  *n Char(32) inz('34362414270827241759071559071759');
  *n Char(32) inz('34362413270827241759071559071759');
  *n Char(32) inz('34362418271827231759071559071759');
  *n Char(32) inz('34362415271827221759071559071759');
  *n Char(32) inz('34362412271827221759071559071759');
  *n Char(32) inz('34362419271827201759071559071759');
  *n Char(32) inz('34362416271827201759071559071759');
  *n Char(32) inz('34362414271827201759071559071759');
  *n Char(32) inz('34362312271827291759071559071759');
  *n Char(32) inz('34362316273827271759071559071759');
  *n Char(32) inz('34362318273827261759071559071759');
  *n Char(32) inz('34362315273827261759071559071759');
  *n Char(32) inz('34362317273827241759071559071759');
  *n Char(32) inz('34362315273827241759071559071759');
  *n Char(32) inz('34362317373827221759071559071759');
  *n Char(32) inz('34362316373827221759071559071759');
  *n Char(32) inz('34362315373827221759071559071759');
  *n Char(32) inz('34362315373827211759071559071759');
  *n Char(32) inz('34362313373827211759071559071759');
  *n Char(32) inz('34362319373827201759071559071759');
  *n Char(32) inz('34362219372827281759071559071759');
  *n Char(32) inz('34362210372827291759071559071759');
  *n Char(32) inz('34362216372827281759071559071759');
  *n Char(32) inz('34362213372827281759071559071759');
  *n Char(32) inz('34362211372827271759071559071759');
  *n Char(32) inz('34362219372827261759071559071759');
  *n Char(32) inz('34362215372827261759071559071759');
  *n Char(32) inz('34362219370827251759071559071759');
  *n Char(32) inz('34362217370827231759071559071759');
  *n Char(32) inz('34362218370827221759071559071759');
  *n Char(32) inz('34362217370827221759071559071759');
  *n Char(32) inz('34362218370827211759071559071759');
  *n Char(32) inz('34362212371827211759071559071759');
  *n Char(32) inz('34362210371827201759071559071759');
  *n Char(32) inz('34362118371827291759071559071759');
  *n Char(32) inz('34362116371827291759071559071759');
  *n Char(32) inz('34362112371827281759071559071759');
  *n Char(32) inz('34362119371827271759071559071759');
  *n Char(32) inz('34362110371827241759071559071759');
  *n Char(32) inz('34362116371827231759071559071759');
  *n Char(32) inz('34362116372827211759071559071759');
  *n Char(32) inz('34362112372827201759071559071759');
  *n Char(32) inz('34362015372827291759071559071759');
  *n Char(32) inz('34362012372827281759071559071759');
  *n Char(32) inz('34362012372827271759071559071759');
  *n Char(32) inz('34362011372827251759071559071759');
  *n Char(32) inz('34362018372827241759071559071759');
  *n Char(32) inz('34362017373827241759071559071759');
  *n Char(32) inz('34362012373827241759071559071759');
  *n Char(32) inz('34362014373827231759071559071759');
  *n Char(32) inz('34362013373827231759071559071759');
  *n Char(32) inz('34362013373827221759071559071759');
  *n Char(32) inz('34362015373827201759071559071759');
  *n Char(32) inz('34362918373826281759071559071759');
  *n Char(32) inz('34362919371826271759071559071759');
  *n Char(32) inz('34362915371826261759071559071759');
  *n Char(32) inz('34362912371826261759071559071759');
  *n Char(32) inz('34362919371826251759071559071759');
  *n Char(32) inz('34362911371826251759071559071759');
  *n Char(32) inz('34362919371826231759071559071759');
  *n Char(32) inz('34362918370826231759071559071759');
  *n Char(32) inz('34362917370826211759071559071759');
  *n Char(32) inz('34362915370826201759071559071759');
  *n Char(32) inz('34362814370826291759071559071759');
  *n Char(32) inz('34362819370826281759071559071759');
  *n Char(32) inz('34362818371826281759071559071759');
  *n Char(32) inz('34362812371826281759071559071759');
  *n Char(32) inz('34362817371826271759071559071759');
  *n Char(32) inz('34362813371826261759071559071759');
  *n Char(32) inz('34362818371826241759071559071759');
  *n Char(32) inz('34362815373826241759071559071759');
  *n Char(32) inz('34362818373826221759071559071759');
  *n Char(32) inz('34362817373826221759071559071759');
  *n Char(32) inz('34362813373826221759071559071759');
  *n Char(32) inz('34362817373826211759071559071759');
  *n Char(32) inz('34362817373826201759071559071759');
  *n Char(32) inz('34362806373826201759071559071759');
  *n Char(32) inz('34362803373826201759071559071759');
  *n Char(32) inz('34362702373826291759071559071759');
  *n Char(32) inz('34362700373826291759071559071759');
  *n Char(32) inz('34362703373826261759071559071759');
  *n Char(32) inz('34362703373826231759071559071759');
  *n Char(32) inz('34362702372826221759071559071759');
  *n Char(32) inz('34362701372826221759071559071759');
  *n Char(32) inz('34362709372826211759071559071759');
  *n Char(32) inz('34362703372826211759071559071759');
  *n Char(32) inz('34362702372826211759071559071759');
  *n Char(32) inz('34362707372826201759071559071759');
  *n Char(32) inz('34362604370826291759071559071759');
  *n Char(32) inz('34362609370826281759071559071759');
  *n Char(32) inz('34362605370826281759071559071759');
  *n Char(32) inz('34362609370826271759071559071759');
  *n Char(32) inz('34362606370826251759071559071759');
  *n Char(32) inz('34362604371826221759071559071759');
  *n Char(32) inz('34362507371826281759071559071759');
  *n Char(32) inz('34362504371826281759071559071759');
  *n Char(32) inz('34362502371826281759071559071759');
  *n Char(32) inz('34362505371826271759071559071759');
  *n Char(32) inz('34362509371826261759071559071759');
  *n Char(32) inz('34362508372826251759071559071759');
  *n Char(32) inz('34362503372826251759071559071759');
  *n Char(32) inz('34362501372826251759071559071759');
  *n Char(32) inz('34362509372826241759071559071759');
  *n Char(32) inz('34362508372826241759071559071759');
  *n Char(32) inz('34362506372826241759071559071759');
  *n Char(32) inz('34362504372826241759071559071759');
  *n Char(32) inz('34362502372826241759071559071759');
  *n Char(32) inz('34362507373826231759071559071759');
  *n Char(32) inz('34362509373826221759071559071759');
  *n Char(32) inz('34362508373826221759071559071759');
  *n Char(32) inz('34362506373826221759071559071759');
  *n Char(32) inz('34362506373826201759071559071759');
  *n Char(32) inz('34362502371826201759071559071759');
  *n Char(32) inz('34362501371826201759071559071759');
  *n Char(32) inz('34362409371826281759071559071759');
  *n Char(32) inz('34362409371826271759071559071759');
  *n Char(32) inz('34362404371826271759071559071759');
  *n Char(32) inz('34362403371826271759071559071759');
  *n Char(32) inz('34362405371826231759071559071759');
  *n Char(32) inz('34362409370826211759071559071759');
  *n Char(32) inz('34362307370826291759071559071759');
  *n Char(32) inz('34362301370826291759071559071759');
  *n Char(32) inz('34362309370826281759071559071759');
  *n Char(32) inz('34362305371826291759071559071759');
  *n Char(32) inz('34362304371826271759071559071759');
  *n Char(32) inz('34362401371826251759071559071759');
  *n Char(32) inz('34362309371826221759071559071759');
  *n Char(32) inz('34362308371826221759071559071759');
  *n Char(32) inz('34362302373826221759071559071759');
  *n Char(32) inz('34362308373826201759071559071759');
  *n Char(32) inz('34362209373826291759071559071759');
  *n Char(32) inz('34362208373826291759071559071759');
  *n Char(32) inz('34362203273826291759071559071759');
  *n Char(32) inz('34362204273826261759071559071759');
  *n Char(32) inz('34362206273826251759071559071759');
  *n Char(32) inz('34362201273826251759071559071759');
  *n Char(32) inz('34362202273826241759071559071759');
  *n Char(32) inz('34362203273826231759071559071759');
  *n Char(32) inz('34362208272826221759071559071759');
  *n Char(32) inz('34362203272826221759071459071759');
  *n Char(32) inz('34362202272826221759071459071759');
  *n Char(32) inz('34362205272826211759071459071759');
  *n Char(32) inz('34362207272826201759071459071759');
  *n Char(32) inz('34362108272826291759071459071759');
  *n Char(32) inz('34362107272826291759071459071759');
  *n Char(32) inz('34362106272826291759071459071759');
  *n Char(32) inz('34362105270826291759071459071759');
  *n Char(32) inz('34362109270826281759071459071759');
  *n Char(32) inz('34362103270826281759071459071759');
  *n Char(32) inz('34362101270826281759071459071759');
  *n Char(32) inz('34362101270826251759071459071759');
  *n Char(32) inz('34362107271826241759071459071759');
  *n Char(32) inz('34362105271826231759071459071759');
  *n Char(32) inz('34362105271826221759071459071759');
  *n Char(32) inz('34362100271826221759071459071759');
  *n Char(32) inz('34362103271826211759071459071759');
  *n Char(32) inz('34362106271826201759071459071759');
  *n Char(32) inz('34362101271826201759071459071759');
  *n Char(32) inz('34362008271826291759071459071759');
  *n Char(32) inz('34362008271826281759071459071759');
  *n Char(32) inz('34362006272826251759071459071759');
  *n Char(32) inz('34362008272826241759071459071759');
  *n Char(32) inz('34362009272826231759071459071759');
  *n Char(32) inz('34362009272826211759071459071759');
  *n Char(32) inz('34362005272826211759071459071759');
  *n Char(32) inz('34362001272826201759071459071759');
  *n Char(32) inz('34362909273825251759071459071759');
  *n Char(32) inz('34362903273825251759071459071759');
  *n Char(32) inz('34362904273825231759071459071759');
  *n Char(32) inz('34362905273825221759071459071759');
  *n Char(32) inz('34362904273825221759071459071759');
  *n Char(32) inz('34362903273825221759071459071759');
  *n Char(32) inz('34362808271825271759071459071759');
  *n Char(32) inz('34362802271825231759071459071759');
  *n Char(32) inz('34362807271825221759071459071759');
  *n Char(32) inz('34362802271825221759071459071759');
  *n Char(32) inz('34362808271825201759071459071759');
  *n Char(32) inz('34362805270825201759071459071759');
  *n Char(32) inz('34362803270825201759071459071759');
  *n Char(32) inz('34362700270825291759071459071759');
  *n Char(32) inz('34362701270825281759071459071759');
  *n Char(32) inz('34362705270825271759071459071759');
  *n Char(32) inz('34362700270825271759071459071759');
  *n Char(32) inz('34362705271825261759071459071759');
  *n Char(32) inz('34362704271825261759071459071759');
  *n Char(32) inz('34362701271825261759071459071759');
  *n Char(32) inz('34362703271825231759071459071759');
  *n Char(32) inz('34362701271825231759071459071759');
  *n Char(32) inz('34362701271825221759071459071759');
  *n Char(32) inz('34362704271825211759071459071759');
  *n Char(32) inz('34362609271825291759071459071759');
  *n Char(32) inz('34362606273825281759071459071759');
  *n Char(32) inz('34362605273825281759071459071759');
  *n Char(32) inz('34362603273825281759071459071759');
  *n Char(32) inz('34362607273825261759071459071759');
  *n Char(32) inz('34362601273825261759071459071759');
  *n Char(32) inz('34362609073825251759071459071759');
  *n Char(32) inz('34362601073825251759071459071759');
  *n Char(32) inz('34362608073825241759071459071759');
  *n Char(32) inz('34362608073825231759071459071759');
  *n Char(32) inz('34362603073825231759071459071759');
  *n Char(32) inz('34362607073825221759071459071759');
  *n Char(32) inz('34362600073825221759071459071759');
  *n Char(32) inz('34362604072825211759071459071759');
  *n Char(32) inz('34362607072825201759071459071759');
  *n Char(32) inz('34362507072825291759071459071759');
  *n Char(32) inz('34362506072825291759071459071759');
  *n Char(32) inz('34362502070825271759071459071759');
  *n Char(32) inz('34362508070825251759071459071759');
  *n Char(32) inz('34362505070825251759071459071759');
  *n Char(32) inz('34362508070825221759071459071759');
  *n Char(32) inz('34362502070825221759071459071759');
  *n Char(32) inz('34362509070825211759071459071759');
  *n Char(32) inz('34362507071825211759071459071759');
  *n Char(32) inz('34362509071825201759071459071759');
  *n Char(32) inz('34362506071825201759071459071759');
  *n Char(32) inz('34362402071825291759071459071759');
  *n Char(32) inz('34362408071825271759071459071759');
  *n Char(32) inz('34362400071825271759071459071759');
  *n Char(32) inz('34362405071825261759071459071759');
  *n Char(32) inz('34362404071825261759071459071759');
  *n Char(32) inz('34362406072825251759071459071759');
  *n Char(32) inz('34362400072825251759071459071759');
  *n Char(32) inz('34362403072825231759071459071759');
  *n Char(32) inz('34362406072825221759071459071759');
  *n Char(32) inz('34362405072825221759071459071759');
  *n Char(32) inz('34362402073825221759071459071759');
  *n Char(32) inz('34362301073825281759071459071759');
  *n Char(32) inz('34362307073825271759071459071759');
  *n Char(32) inz('34362302073825271759071459071759');
  *n Char(32) inz('34362301073825271759071459071759');
  *n Char(32) inz('34362303073825251759071459071759');
  *n Char(32) inz('34362303073825231759071459071759');
  *n Char(32) inz('34362208073825231759071459071759');
  *n Char(32) inz('34362302073825221759071459071759');
  *n Char(32) inz('34362304071825211759071459071759');
  *n Char(32) inz('34362200071825291759071459071759');
  *n Char(32) inz('34362207071825261759071459071759');
  *n Char(32) inz('34362201071825261759071459071759');
  *n Char(32) inz('34362204071825251759071459071759');
  *n Char(32) inz('34362207070825241759071459071759');
  *n Char(32) inz('34362206070825241759071459071759');
  *n Char(32) inz('34362202070825231759071459071759');
  *n Char(32) inz('34362207070825201759071459071759');
  *n Char(32) inz('34362205070825201759071459071759');
  *n Char(32) inz('34362108070825291759071459071759');
  *n Char(32) inz('34362103071825281759071459071759');
  *n Char(32) inz('34362108071825271759071459071759');
  *n Char(32) inz('34362106071825271759071459071759');
  *n Char(32) inz('34362100071825271759071459071759');
  *n Char(32) inz('34362108071825261759071459071759');
  *n Char(32) inz('34362109071825241759071459071759');
  *n Char(32) inz('34362107071825241759071459071759');
  *n Char(32) inz('34362106071825241759071459071759');
  *n Char(32) inz('34362105073825241759071459071759');
  *n Char(32) inz('34362108073825231759071459071759');
  *n Char(32) inz('34362102073825211759071459071759');
  *n Char(32) inz('34362101073825211759071459071759');
  *n Char(32) inz('34362100073825201759071459071759');
  *n Char(32) inz('34362007173825251759071459071759');
  *n Char(32) inz('34362009173825241759071459071759');
  *n Char(32) inz('34362007173825241759071459071759');
  *n Char(32) inz('34362004173825231759071459071759');
  *n Char(32) inz('34362002173825221759071459071759');
  *n Char(32) inz('34362006173825211759071459071759');
  *n Char(32) inz('34362002173825201759071459071759');
  *n Char(32) inz('34362001172825201759071459071759');
  *n Char(32) inz('34362909172824291759071459071759');
  *n Char(32) inz('34362909172824271759071459071759');
  *n Char(32) inz('34362904172824271759071459071759');
  *n Char(32) inz('34362904172824251759071459071759');
  *n Char(32) inz('34362907172824241759071459071759');
  *n Char(32) inz('34362901170824231759071459071759');
  *n Char(32) inz('34362900170824231759071459071759');
  *n Char(32) inz('34362908170824221759071459071759');
  *n Char(32) inz('34362903170824221759071459071759');
  *n Char(32) inz('34362907170824211759071459071759');
  *n Char(32) inz('34362903170824211759071459071759');
  *n Char(32) inz('34362906171824201759071459071759');
  *n Char(32) inz('34362905171824201759071459071759');
  *n Char(32) inz('34362809171824281759071459071759');
  *n Char(32) inz('34362801171824281759071459071759');
  *n Char(32) inz('34362803171824271759071459071759');
  *n Char(32) inz('34362808171824261759071459071759');
  *n Char(32) inz('34362802172824261759071459071759');
  *n Char(32) inz('34362807172824251759071459071759');
  *n Char(32) inz('34362803172824241759071459071759');
  *n Char(32) inz('34362801172824231759071459071759');
  *n Char(32) inz('34362801172824201759071459071759');
  *n Char(32) inz('34362706173824291759071459071759');
  *n Char(32) inz('34362707173824261759071459071759');
  *n Char(32) inz('34362707173824241759071459071759');
  *n Char(32) inz('34362708173824231759071459071759');
  *n Char(32) inz('34362703173824231759071459071759');
  *n Char(32) inz('34362706173824221759071459071759');
  *n Char(32) inz('34362702171824201759071459071759');
  *n Char(32) inz('34362606171824291759071459071759');
  *n Char(32) inz('34362906171821241759071459071759');
  *n Char(32) inz('34362607171824231759071459071759');
  *n Char(32) inz('34362605171824231759071459071759');
  *n Char(32) inz('34362604171824231759071459071759');
  *n Char(32) inz('34362602171824231759071459071759');
  *n Char(32) inz('34362606170824211759071459071759');
  *n Char(32) inz('34362608170824201759071459071759');
  *n Char(32) inz('34362606170824201759071459071759');
  *n Char(32) inz('34362506170824281759071459071759');
  *n Char(32) inz('34362503170824281759071459071759');
  *n Char(32) inz('34362503170824251759071459071759');
  *n Char(32) inz('34362507170824241759071459071759');
  *n Char(32) inz('34362505171824241759071459071759');
  *n Char(32) inz('34362509171824231759071459071759');
  *n Char(32) inz('34362502171824231759071459071759');
  *n Char(32) inz('34362507171824221759071459071759');
  *n Char(32) inz('34362506171824201759071459071759');
  *n Char(32) inz('34362500171824201759071659071759');
  *n Char(32) inz('34362406173824291759071459071759');
  *n Char(32) inz('34362402173824291759071459071759');
  *n Char(32) inz('34362404173824281759071459071759');
  *n Char(32) inz('34362405173824261759071459071759');
  *n Char(32) inz('34362405173824251759071459071759');
  *n Char(32) inz('34362400173824241759071459071759');
  *n Char(32) inz('34362404173824211759071459071759');
  *n Char(32) inz('34362401273824211759071459071759');
  *n Char(32) inz('34362300273824291759071459071759');
  *n Char(32) inz('34362305273824281759071459071759');
  *n Char(32) inz('34362301273824281759071459071759');
  *n Char(32) inz('34362303273824261759071459071759');
  *n Char(32) inz('34362303273824241759071459071759');
  *n Char(32) inz('34362309272824231759071459071759');
  *n Char(32) inz('34362308272824231759071459071759');
  *n Char(32) inz('34362306272824231759071459071759');
  *n Char(32) inz('34362301272824221759071459071759');
  *n Char(32) inz('34362301272824201759071459071759');
  *n Char(32) inz('34362203272824291759071459071759');
  *n Char(32) inz('34362202270824291759071459071759');
  *n Char(32) inz('34362207270824271759071459071759');
  *n Char(32) inz('34362204270824271759071459071759');
  *n Char(32) inz('34362203270824261759071459071759');
  *n Char(32) inz('34362201270824261759071459071759');
  *n Char(32) inz('34362204270824251759071459071759');
  *n Char(32) inz('34362200270824251759071459071759');
  *n Char(32) inz('34362205271824231759071459071759');
  *n Char(32) inz('34362209271824201759071459071759');
  *n Char(32) inz('34362208271824201759071459071759');
  *n Char(32) inz('34362202271824201759071459071759');
  *n Char(32) inz('34362105271824291759071459071759');
  *n Char(32) inz('34362105272824281759071459071759');
  *n Char(32) inz('34362109272824241759071459071759');
  *n Char(32) inz('34362106272824221759071459071759');
  *n Char(32) inz('34362101272824211759071459071759');
  *n Char(32) inz('34362006272824291759071459071759');
  *n Char(32) inz('34362002272824291759071459071759');
  *n Char(32) inz('34362008272824261759071459071759');
  *n Char(32) inz('34362009273824251759071459071759');
  *n Char(32) inz('34362006273824241759071459071759');
  *n Char(32) inz('34362007273824221759071459071759');
  *n Char(32) inz('34362002273824211759071459071759');
  *n Char(32) inz('34362903273823271759071459071759');
  *n Char(32) inz('34362907273823251759071459071759');
  *n Char(32) inz('34362908271823221759071459071759');
  *n Char(32) inz('34362904271823221759071459071759');
  *n Char(32) inz('34362909271823211759071459071759');
  *n Char(32) inz('34362908271823211759071459071759');
  *n Char(32) inz('34362902271823211759071459071759');
  *n Char(32) inz('34362806271823271759071459071759');
  *n Char(32) inz('34362800271823271759071459071759');
  *n Char(32) inz('34362802270823261759071459071759');
  *n Char(32) inz('34362806270823251759071459071759');
  *n Char(32) inz('34362800270823251759071459071759');
  *n Char(32) inz('34362805270823241759071459071759');
  *n Char(32) inz('34362808270823221759071459071759');
  *n Char(32) inz('34362807270823221759071459071759');
  *n Char(32) inz('34362801271823221759071459071759');
  *n Char(32) inz('34362808271823211759071459071759');
  *n Char(32) inz('34362800271823201759071459071759');
  *n Char(32) inz('34362704271823291759071459071759');
  *n Char(32) inz('34362706271823281759071459071759');
  *n Char(32) inz('34362703271823281759071459071759');
  *n Char(32) inz('34362700273823271759071459071759');
  *n Char(32) inz('34362707273823261759071459071759');
  *n Char(32) inz('34362704273823261759071459071759');
  *n Char(32) inz('34362707273823251759071459071759');
  *n Char(32) inz('34362705273823251759071459071759');
  *n Char(32) inz('34362702273823251759071459071759');
  *n Char(32) inz('34362706273823241759071459071759');
  *n Char(32) inz('34362708373823231759071459071759');
  *n Char(32) inz('34362707373823221759071459071759');
  *n Char(32) inz('34362706373823211759071459071759');
  *n Char(32) inz('34362701373823211759071559071759');
  *n Char(32) inz('34362708373823201759071459071759');
  *n Char(32) inz('34362604372823291759071459071759');
  *n Char(32) inz('34362602372823291759071459071759');
  *n Char(32) inz('34362601372823281759071459071759');
  *n Char(32) inz('34362603372823271759071559071759');
  *n Char(32) inz('34362605372823261759071259071759');
  *n Char(32) inz('34362608372823251759071259071759');
  *n Char(32) inz('34362606370823251759071259071759');
  *n Char(32) inz('34362606370823241759071259071759');
  *n Char(32) inz('34362601370823231759071259071759');
  *n Char(32) inz('34362605370823221759071259071759');
  *n Char(32) inz('34362609370823201759071259071759');
  *n Char(32) inz('34362606371823201759071259071759');
  *n Char(32) inz('34362604371823201759071259071759');
  *n Char(32) inz('34362509371823291759071259071759');
  *n Char(32) inz('34362502371823291759071259071759');
  *n Char(32) inz('34362501371823281759071259071759');
  *n Char(32) inz('34362509371823271759071259071759');
  *n Char(32) inz('34362505371823271759071259071759');
  *n Char(32) inz('34362504371823271759071259071759');
  *n Char(32) inz('34362506372823261759071259071759');
  *n Char(32) inz('34362504372823261759071259071759');
  *n Char(32) inz('34362503372823261759071259071759');
  *n Char(32) inz('34362508372823251759071259071759');
  *n Char(32) inz('34362506372823251759071259071759');
  *n Char(32) inz('34362503372823251759071259071759');
  *n Char(32) inz('34362507372823241759071259071759');
  *n Char(32) inz('34362502373823241759071259071759');
  *n Char(32) inz('34362505373823221759071259071759');
  *n Char(32) inz('34362504373823211759071259071759');
  *n Char(32) inz('34362503373823211759071259071759');
  *n Char(32) inz('34362405373823291759071259071759');
  *n Char(32) inz('34362402373823291759071259071759');
  *n Char(32) inz('34362407373823281759071259071759');
  *n Char(32) inz('34362404371823281759071259071759');
  *n Char(32) inz('34362401371823271759071259071759');
  *n Char(32) inz('34362403371823261759071259071759');
  *n Char(32) inz('34362403371823251759071259071759');
  *n Char(32) inz('34362402371823251759071259071759');
  *n Char(32) inz('34362407371823241759071259071759');
  *n Char(32) inz('34362409370823221759071259071759');
  *n Char(32) inz('34362406370823221759071259071759');
  *n Char(32) inz('34362401370823221759071259071759');
  *n Char(32) inz('34362408370823211759071259071759');
  *n Char(32) inz('34362406370823201759071259071759');
  *n Char(32) inz('34362400370823201759071259071759');
  *n Char(32) inz('34362307371823291759071259071759');
  *n Char(32) inz('34362302371823291759071259071759');
  *n Char(32) inz('34362301371823291759071259071759');
  *n Char(32) inz('34362304371823281759071259071759');
  *n Char(32) inz('34362307371823271759071259071759');
  *n Char(32) inz('34362300371823261759071259071759');
  *n Char(32) inz('34362305373823251759071259071759');
  *n Char(32) inz('34362308373823241759071259071759');
  *n Char(32) inz('34362306373823241759071259071759');
  *n Char(32) inz('34362304373823241759071259071759');
  *n Char(32) inz('34362303373823231759071259071759');
  *n Char(32) inz('34362302373823221759071259071759');
  *n Char(32) inz('34362312373823211759071259071759');
  *n Char(32) inz('34362314373823201759071259071759');
  *n Char(32) inz('34362313373823201759071259071759');
  *n Char(32) inz('34362219373823291759071259071759');
  *n Char(32) inz('34362212373823271759071259071759');
  *n Char(32) inz('34362213373823261759071259071759');
  *n Char(32) inz('34362217373823251759071259071759');
  *n Char(32) inz('34362212373823241759071259071759');
  *n Char(32) inz('34362213372823231759071259071759');
  *n Char(32) inz('34362213372823221759071259071759');
  *n Char(32) inz('34362214372823201759071259071759');
  *n Char(32) inz('34362211372823201759071259071759');
  *n Char(32) inz('34362115372823271759071259071759');
  *n Char(32) inz('34362111370823271759071259071759');
  *n Char(32) inz('34362119370823251759071259071759');
  *n Char(32) inz('34362115370823251759071259071759');
  *n Char(32) inz('34362116370823241759071159071759');
  *n Char(32) inz('34362116370823231759071159071759');
  *n Char(32) inz('34362117371823231759071159071759');
  *n Char(32) inz('34362116371823221759071159071759');
  *n Char(32) inz('34362115371823221759071159071759');
  *n Char(32) inz('34362112371823221759071159071759');
  *n Char(32) inz('34362119371823201759071159071759');
  *n Char(32) inz('34362114371823201759071159071759');
  *n Char(32) inz('34362113371823201759071159071759');
  *n Char(32) inz('34362110372823201759071159071759');
  *n Char(32) inz('34362019372823281759071159071759');
  *n Char(32) inz('34362015372823271759071159071759');
  *n Char(32) inz('34362012372823271759071159071759');
  *n Char(32) inz('34362011372823271759071159071759');
  *n Char(32) inz('34362018373823251759071159071759');
  *n Char(32) inz('34362014373823251759071159071759');
  *n Char(32) inz('34362019373823241759071159071759');
  *n Char(32) inz('34362018373823241759071159071759');
  *n Char(32) inz('34362012373823231759071359071759');
  *n Char(32) inz('34362018373823221759071159071759');
  *n Char(32) inz('34362017373823221759071159071759');
  *n Char(32) inz('34362013373823221759071159071759');
  *n Char(32) inz('34362011373823221759071159071759');
  *n Char(32) inz('34362011371823201759071159071759');
  *n Char(32) inz('34362914371822291759071159071759');
  *n Char(32) inz('34362918371822281759071159071759');
  *n Char(32) inz('34362913371822281759071159071759');
  *n Char(32) inz('34362916371822271759071159071759');
  *n Char(32) inz('34362911370822261759071159071759');
  *n Char(32) inz('34362918370822251759071159071759');
  *n Char(32) inz('34362911370822251759071159071759');
  *n Char(32) inz('34362912370822231759071159071759');
  *n Char(32) inz('34362919370822221759071159071759');
  *n Char(32) inz('34362919370822211759071159071759');
  *n Char(32) inz('34362918370822211759071159071759');
  *n Char(32) inz('34362915370822211759071159071759');
  *n Char(32) inz('34362910371822211759071159071759');
  *n Char(32) inz('34362919371822201759071159071759');
  *n Char(32) inz('34362910371822201759071159071759');
  *n Char(32) inz('34362819371822281759071159071759');
  *n Char(32) inz('34362811371822281759071159071759');
  *n Char(32) inz('34362810371822281759071159071759');
  *n Char(32) inz('34362810373822261759071159071759');
  *n Char(32) inz('34362810373822251759071159071759');
  *n Char(32) inz('34362811373822241759071159071759');
  *n Char(32) inz('34362819373822231759071159071759');
  *n Char(32) inz('34362819373822221759071159071759');
  *n Char(32) inz('34362815273822221759071159071759');
  *n Char(32) inz('34362819273822211759071159071759');
  *n Char(32) inz('34362717273822291759071159071759');
  *n Char(32) inz('34362713273822281759071159071759');
  *n Char(32) inz('34362712273822251759071159071759');
  *n Char(32) inz('34362711273822241759071159071759');
  *n Char(32) inz('34362719273822231759071159071759');
  *n Char(32) inz('34362715273822231759071159071759');
  *n Char(32) inz('34362712272822201759071159071759');
  *n Char(32) inz('34362614272822291759071159071759');
  *n Char(32) inz('34362610272822281759071159071759');
  *n Char(32) inz('34362615272822271759071159071759');
  *n Char(32) inz('34362618272822261759071159071759');
  *n Char(32) inz('34362615272822261759071159071759');
  *n Char(32) inz('34362610270822261759071159071759');
  *n Char(32) inz('34362615270822211759071159071759');
  *n Char(32) inz('34362614270822201759071159071759');
  *n Char(32) inz('34362513270822291759071159071759');
  *n Char(32) inz('34362619270822251759071159071759');
  *n Char(32) inz('34362519270822261759071159071759');
  *n Char(32) inz('34362410270822251759071159071759');
  *n Char(32) inz('34362419270822241759071159071759');
  *n Char(32) inz('34362416270822241759071159071759');
  *n Char(32) inz('34362413271822241759071159071759');
  *n Char(32) inz('34362412271822231759071159071759');
  *n Char(32) inz('34362314271822291759071159071759');
  *n Char(32) inz('34362312271822291759071159071759');
  *n Char(32) inz('34362317271822281759071159071759');
  *n Char(32) inz('34362311272822261759071159071759');
  *n Char(32) inz('34362316272822251759071159071759');
  *n Char(32) inz('34362313272822251759071159071759');
  *n Char(32) inz('34362316272822241759071159071759');
  *n Char(32) inz('34362318272822221759071159071759');
  *n Char(32) inz('34362317272822211759071159071759');
  *n Char(32) inz('34362316272822201759071159071759');
  *n Char(32) inz('34362313272822201759071159071759');
  *n Char(32) inz('34362215273822291759071159071759');
  *n Char(32) inz('34362218273822271759071159071759');
  *n Char(32) inz('34362219273822261759071159071759');
  *n Char(32) inz('34362216273822261759071159071759');
  *n Char(32) inz('34362216273822241759071159071759');
  *n Char(32) inz('34362215273822231759071159071759');
  *n Char(32) inz('34362213273822211759071159071759');
  *n Char(32) inz('34362212271822211759071159071759');
  *n Char(32) inz('34362214271822201759071159071759');
  *n Char(32) inz('34362213271822201759071159071759');
  *n Char(32) inz('34362211271822201759071159071759');
  *n Char(32) inz('34362119271822291759071159071759');
  *n Char(32) inz('34362114270822291759071159071759');
  *n Char(32) inz('34362114270822281759071159071759');
  *n Char(32) inz('34362114270822271759071159071759');
  *n Char(32) inz('34362115270822261759071159071759');
  *n Char(32) inz('34362114270822261759071159071759');
  *n Char(32) inz('34362118270822251759071159071759');
  *n Char(32) inz('34362116270822251759071159071759');
  *n Char(32) inz('34362116270822241759071159071759');
  *n Char(32) inz('34362114270822231759071159071759');
  *n Char(32) inz('34362111270822231759071159071759');
  *n Char(32) inz('34362115271822221759071159071759');
  *n Char(32) inz('34362116271822211759071159071759');
  *n Char(32) inz('34362013271822291759071159071759');
  *n Char(32) inz('34362018271822281759071159071759');
  *n Char(32) inz('34362017271822281759071159071759');
  *n Char(32) inz('34362014271822281759071159071759');
  *n Char(32) inz('34362012273822271759071159071759');
  *n Char(32) inz('34362019273822231759071159071759');
  *n Char(32) inz('34362017273822231759071159071759');
  *n Char(32) inz('34362016273822231759071159071759');
  *n Char(32) inz('34362910273821291759071159071759');
  *n Char(32) inz('34362913273821261759071159071759');
  *n Char(32) inz('34362918273821251759071159071759');
  *n Char(32) inz('34362914273821251759071159071759');
  *n Char(32) inz('34362916273821231759071159071759');
  *n Char(32) inz('34362912073821231759071159071759');
  *n Char(32) inz('34362916073821221759071159071759');
  *n Char(32) inz('34362912073821221759071159071759');
  *n Char(32) inz('34362815073821291759071159071759');
  *n Char(32) inz('34362812073821271759071159071759');
  *n Char(32) inz('34362819072821251759071159071759');
  *n Char(32) inz('34362814072821241759071159071759');
  *n Char(32) inz('34362814072821231759071159071759');
  *n Char(32) inz('34362816072821201759071159071759');
  *n Char(32) inz('34362813072821201759071159071759');
  *n Char(32) inz('34362810072821201759071159071759');
  *n Char(32) inz('34362715072821291759071159071759');
  *n Char(32) inz('34362718070821281759071159071759');
  *n Char(32) inz('34362715070821261759071159071759');
  *n Char(32) inz('34362715070821251759071159071759');
  *n Char(32) inz('34362716070821241759071159071759');
  *n Char(32) inz('34362713070821241759071159071759');
  *n Char(32) inz('34362719070821221759071159071759');
  *n Char(32) inz('34362712070821201759071159071759');
  *n Char(32) inz('34362613071821281759071159071759');
  *n Char(32) inz('34362615071821271759071159071759');
  *n Char(32) inz('34362610071821271759071159071759');
  *n Char(32) inz('34362619071821251759071159071759');
  *n Char(32) inz('34362618072821231759071159071759');
  *n Char(32) inz('34362611072821231759071159071759');
  *n Char(32) inz('34362619072821211759071159071759');
  *n Char(32) inz('34362611072821211759071159071759');
  *n Char(32) inz('34362610072821211759071159071759');
  *n Char(32) inz('34362619072821201759071159071759');
  *n Char(32) inz('34362518072821271759071159071759');
  *n Char(32) inz('34362515072821261759071159071759');
  *n Char(32) inz('34362512073821241759071159071759');
  *n Char(32) inz('34362510073821231759071159071759');
  *n Char(32) inz('34362515073821211759071159071759');
  *n Char(32) inz('34362514073821201759071159071759');
  *n Char(32) inz('34362415073821291759071159071759');
  *n Char(32) inz('34362419071821281759071159071759');
  *n Char(32) inz('34362413071821271759071159071759');
  *n Char(32) inz('34362415071821261759071159071759');
  *n Char(32) inz('34362410071821261759071159071759');
  *n Char(32) inz('34362414071821251759071159071759');
  *n Char(32) inz('34362416071821231759071159071759');
  *n Char(32) inz('34362414070821231759071159071759');
  *n Char(32) inz('34362415070821221759071159071759');
  *n Char(32) inz('34362418070821201759071159071759');
  *n Char(32) inz('34362415070821201759071159071759');
  *n Char(32) inz('34362318070821291759071159071759');
  *n Char(32) inz('34362317070821291759071159071759');
  *n Char(32) inz('34362314071821291759071159071759');
  *n Char(32) inz('34362316071821261759071159071759');
  *n Char(32) inz('34362312071821261759071159071759');
  *n Char(32) inz('34362319071821241759071159071759');
  *n Char(32) inz('34362318071821241759071159071759');
  *n Char(32) inz('34362310071821241759071159071759');
  *n Char(32) inz('34362316073821221759071159071759');
  *n Char(32) inz('34362314073821221759071159071759');
  *n Char(32) inz('34362318073821211759071159071759');
  *n Char(32) inz('34362312073821211759071159071759');
  *n Char(32) inz('34362211073821291759071159071759');
  *n Char(32) inz('34362217173821281759071159071759');
  *n Char(32) inz('34362215173821281759071159071759');
  *n Char(32) inz('34362219173821271759071159071759');
  *n Char(32) inz('34362216173821261759071159071759');
  *n Char(32) inz('34362212173821261759071159071759');
  *n Char(32) inz('34362210172821251759071159071759');
  *n Char(32) inz('34362219172821241759071159071759');
  *n Char(32) inz('34362210172821241759071159071759');
  *n Char(32) inz('34362213172821231759071159071759');
  *n Char(32) inz('34362210172821231759071159071759');
  *n Char(32) inz('34362219172821221759071159071759');
  *n Char(32) inz('34362217172821221759071159071759');
  *n Char(32) inz('34362219172821211759071159071759');
  *n Char(32) inz('34362211170821211759071159071759');
  *n Char(32) inz('34362216170821201759071159071759');
  *n Char(32) inz('34362215170821201759071159071759');
  *n Char(32) inz('34362112170821281759071159071759');
  *n Char(32) inz('34362116170821271759071159071759');
  *n Char(32) inz('34362115171821271759071159071759');
  *n Char(32) inz('34362110171821271759071159071759');
  *n Char(32) inz('34362117171821251759071159071759');
  *n Char(32) inz('34362116171821251759071159071759');
  *n Char(32) inz('34362110171821251759071159071759');
  *n Char(32) inz('34362115171821211759071159071759');
  *n Char(32) inz('34362110172821211759071159071759');
  *n Char(32) inz('34362114172821201759071159071759');
  *n Char(32) inz('34362013172821281759071159071759');
  *n Char(32) inz('34362018172821271759071159071759');
  *n Char(32) inz('34362014172821271759071159071759');
  *n Char(32) inz('34362015172821261759071159071759');
  *n Char(32) inz('34362018172821231759071159071759');
  *n Char(32) inz('34362016172821231759071159071759');
  *n Char(32) inz('34362010173821231759071159071759');
  *n Char(32) inz('34362015173821221759071159071759');
  *n Char(32) inz('34362018173821211759071159071759');
  *n Char(32) inz('34362015173821211759071159071759');
  *n Char(32) inz('34362010173821211759071159071759');
  *n Char(32) inz('34362018173821201759071159071759');
  *n Char(32) inz('34362017171821201759071159071759');
  *n Char(32) inz('34362012171821201759071159071759');
  *n Char(32) inz('34362917171820291759071159071759');
  *n Char(32) inz('34362915171820291759071159071759');
  *n Char(32) inz('34362912171820291759071159071759');
  *n Char(32) inz('34362917171820211759071159071759');
  *n Char(32) inz('34362917171820201759071159071759');
  *n Char(32) inz('34362914171820201759071159071759');
  *n Char(32) inz('34362816170820291759071159071759');
  *n Char(32) inz('34362814170820291759071159071759');
  *n Char(32) inz('34362816170820281759071159071759');
  *n Char(32) inz('34362813170820281759071159071759');
  *n Char(32) inz('34362816170820271759071159071759');
  *n Char(32) inz('34362814170820271759071159071759');
  *n Char(32) inz('34362813170820271759071159071759');
  *n Char(32) inz('34362810171820251759071159071759');
  *n Char(32) inz('34362813171820221759071159071759');
  *n Char(32) inz('34362812171820221759071159071759');
  *n Char(32) inz('34362816171820201759071159071759');
  *n Char(32) inz('34362714171820281759071159071759');
  *n Char(32) inz('34362712171820271759071159071759');
  *n Char(32) inz('34362715171820251759071159071759');
  *n Char(32) inz('34362717173820241759071159071759');
  *n Char(32) inz('34362716173820241759071159071759');
  *n Char(32) inz('34362715173820231759071159071759');
  *n Char(32) inz('34362715173820221759071159071759');
  *n Char(32) inz('34362613173820291759071159071759');
  *n Char(32) inz('34362614173820281759071159071759');
  *n Char(32) inz('34362617173820271759071159071759');
  *n Char(32) inz('34362615173820251759071159071759');
  *n Char(32) inz('34362610273820251759071159071759');
  *n Char(32) inz('34362619273820241759071159071759');
  *n Char(32) inz('34362619273820231759071159071759');
  *n Char(32) inz('34362614273820231759071159071759');
  *n Char(32) inz('34362611273820231759071159071759');
  *n Char(32) inz('34362618273820211759071159071759');
  *n Char(32) inz('34362513273820291759071159071759');
  *n Char(32) inz('34362511273820271759071159071759');
  *n Char(32) inz('34362515272820251759071159071759');
  *n Char(32) inz('34362514272820251759071159071759');
  *n Char(32) inz('34362519272820241759071159071759');
  *n Char(32) inz('34362518272820221759071159071759');
  *n Char(32) inz('34362514272820221759071159071759');
  *n Char(32) inz('34362510272820211759071159071759');
  *n Char(32) inz('34362514270820201759071159071759');
  *n Char(32) inz('34362513270820201759071159071759');
  *n Char(32) inz('34362415270820291759071159071759');
  *n Char(32) inz('34362413270820281759071159071759');
  *n Char(32) inz('34362411270820271759071159071759');
  *n Char(32) inz('34362415270820261759071159071759');
  *n Char(32) inz('34362414271820251759071159071759');
  *n Char(32) inz('34362018271823261759071159071759');
  *n Char(32) inz('34362418271823231759071159071759');
  *n Char(32) inz('34362219271822291759071159071759');
  *n Char(32) inz('34372011271820211759071159071759');
  *n Char(32) inz('34362613271823201759071159071759');
  *n Char(32) inz('34362016271828231759071159071759');
  *n Char(32) inz('34362915271824261759071159071759');
  *n Char(32) inz('34362612272824271759071159071759');
  *n Char(32) inz('34362114272829211759071159071759');
  *n Char(32) inz('34362617272827251759071159071759');
  *n Char(32) inz('34362412272827271759071159071759');
  *n Char(32) inz('34362211272827211759071159071759');
  *n Char(32) inz('34362614272821291759071159071759');
  *n Char(32) inz('34362811273820211759071159071759');
  *n Char(32) inz('34362118273822241759071159071759');
  *n Char(32) inz('34362810271824241759071159071759');
  *n Char(32) inz('34372211271820281759071159071759');
  *n Char(32) inz('34362916273826211759071159071759');
  *n Char(32) inz('34362710273826241759071159071759');
  *n Char(32) inz('34362212273827221759071159071759');
  *n Char(32) inz('34362810273826291759071159071759');
  *n Char(32) inz('34362310273829281759071159071759');
  *n Char(32) inz('34362116273829231759071159071759');
  *n Char(32) inz('34362211373826201759071559071759');
  *n Char(32) inz('34362514373823231759071159071759');
  *n Char(32) inz('34362215373829221759071159071759');
  *n Char(32) inz('34362413373829201759071159071759');
  *n Char(32) inz('34362319373829201759071159071759');
  *n Char(32) inz('34362214373829251759071159071759');
  *n Char(32) inz('34362219373829211759071159071759');
  *n Char(32) inz('34362212372829201759071159071759');
  *n Char(32) inz('34362516372828261759071159071759');
  *n Char(32) inz('34362419372828211759071159071759');
  *n Char(32) inz('34362014372828211759071159071759');
  *n Char(32) inz('34362914372827291759071159071759');
  *n Char(32) inz('34362713370827201759071159071759');
  *n Char(32) inz('34362615370827231759071159071759');
  *n Char(32) inz('34362319370827211759071159071759');
  *n Char(32) inz('34362413370826201759071159071759');
  *n Char(32) inz('34362510370824261759071159071759');
  *n Char(32) inz('34362417370824281759071159071759');
  *n Char(32) inz('34362817370823211759071159071759');
  *n Char(32) inz('34362018371823281759071159071759');
  *n Char(32) inz('34362915371822281759071159071759');
  *n Char(32) inz('34362511371821211759071159071759');
  *n Char(32) inz('34362416371821201759071159071759');
  *n Char(32) inz('34362916371827271759071159071759');
  *n Char(32) inz('34362517371824251759071159071759');
  *n Char(32) inz('34362712372828201759071159071759');
  *n Char(32) inz('34362713372827211759071159071759');
  *n Char(32) inz('34362511372827291759071159071759');
  *n Char(32) inz('34362015372827211759071159071759');
  *n Char(32) inz('34362914372826251759071159071759');
  *n Char(32) inz('34362817372824231759071159071759');
  *n Char(32) inz('34362215372823211759071159071759');
  *n Char(32) inz('34372411373820251759071159071759');
  *n Char(32) inz('34372313373820281759071159071759');
  *n Char(32) inz('34372310373820241759071159071759');
  *n Char(32) inz('34372315373820231759071159071759');
  *n Char(32) inz('34372314373820231759071159071759');
  *n Char(32) inz('34372314373820221759071159071759');
  *n Char(32) inz('34372315371820211759071159071759');
  *n Char(32) inz('34372213371820291759071159071759');
  *n Char(32) inz('34372219371820271759071159071759');
  *n Char(32) inz('34372114371820281759071159071759');
  *n Char(32) inz('34372013371820281759071159071759');
  *n Char(32) inz('34372019371820251759071159071759');
  *n Char(32) inz('34372016370820231759071159071759');
  *n Char(32) inz('34372015370820201759071159071759');
  *n Char(32) inz('34372010370820201759071159071759');
  *n Char(32) inz('34362916370829271759071159071759');
  *n Char(32) inz('34362912370829261759071159071759');
  *n Char(32) inz('34362918370829201759071159071759');
  *n Char(32) inz('34362811370829291759071159071759');
  *n Char(32) inz('34362812371829261759071159071759');
  *n Char(32) inz('34362818371829251759071159071759');
  *n Char(32) inz('34362716371829261759071159071759');
  *n Char(32) inz('34362710371829231759071159071759');
  *n Char(32) inz('34362713371829201759071159071759');
  *n Char(32) inz('34362612371829271759071159071759');
  *n Char(32) inz('34362619373829261759071159071759');
  *n Char(32) inz('34362515373829261759071159071759');
  *n Char(32) inz('34362513373829261759071159071759');
  *n Char(32) inz('34362511373829261759071159071759');
  *n Char(32) inz('34362516373829211759071159071759');
  *n Char(32) inz('34362418373829261759071159071759');
  *n Char(32) inz('34362435373829231759071159071759');
  *n Char(32) inz('34362332373829291759071159071759');
  *n Char(32) inz('34362330373829291759071159071759');
  *n Char(32) inz('34362333373829251759071159071759');
  *n Char(32) inz('34362331373829231759071159071759');
  *n Char(32) inz('34362336373829211759071159071759');
  *n Char(32) inz('34362237373829231759071159071759');
  *n Char(32) inz('34362230372829201759071159071759');
  *n Char(32) inz('34362139372829291759071159071759');
  *n Char(32) inz('34362137372829281759071159071759');
  *n Char(32) inz('34362130372829211759071159071759');
  *n Char(32) inz('34362139372829201759071159071759');
  *n Char(32) inz('34362033370829261759071159071759');
  *n Char(32) inz('34362932370828291759071159071759');
  *n Char(32) inz('34362737370828281759071159071759');
  *n Char(32) inz('34362737370828201759071159071759');
  *n Char(32) inz('34362639370828261759071159071759');
  *n Char(32) inz('34362637370828221759071159071759');
  *n Char(32) inz('34362631371828221759071159071759');
  *n Char(32) inz('34362630371828221759071159071759');
  *n Char(32) inz('34362537371828261759071159071759');
  *n Char(32) inz('34362535371828221759071159071759');
  *n Char(32) inz('34362436371828281759071159071759');
  *n Char(32) inz('34362431371828251759071159071759');
  *n Char(32) inz('34362439371828221759071159071759');
  *n Char(32) inz('34362430372828211759071159071759');
  *n Char(32) inz('34362333372828281759071159071759');
  *n Char(32) inz('34362238372828221759071159071759');
  *n Char(32) inz('34362134372828261759071159071759');
  *n Char(32) inz('34362139372828251759071159071759');
  *n Char(32) inz('34362136372828241759071159071759');
  *n Char(32) inz('34362133373828221759071159071759');
  *n Char(32) inz('34362136373828201759071159071759');
  *n Char(32) inz('34362033373828261759071159071759');
  *n Char(32) inz('34362031373828221759071159071759');
  *n Char(32) inz('34362035373828211759071159071759');
  *n Char(32) inz('34362037373828201759071159071759');
  *n Char(32) inz('34362937371827221759071159071759');
  *n Char(32) inz('34362833371827291759071159071759');
  *n Char(32) inz('34362837371827241759071159071759');
  *n Char(32) inz('34362733371827251759071159071759');
  *n Char(32) inz('34362736371827231759071159071759');
  *n Char(32) inz('34362737371827221759071159071759');
  *n Char(32) inz('34362736370827211759071159071759');
  *n Char(32) inz('34362634370827281759071159071759');
  *n Char(32) inz('34362635370827221759071159071759');
  *n Char(32) inz('34362637370827211759071159071759');
  *n Char(32) inz('34362631370827211759071159071759');
  *n Char(32) inz('34362631371827201759071159071759');
  *n Char(32) inz('34362537371827281759071159071759');
  *n Char(32) inz('34362534371827271759071159071759');
  *n Char(32) inz('34362539371827211759071159071759');
  *n Char(32) inz('34362435371827291759071159071759');
  *n Char(32) inz('34362437371827251759071159071759');
  *n Char(32) inz('34362436373827251759071159071759');
  *n Char(32) inz('34362430373827241759071159071759');
  *n Char(32) inz('34362430373827221759071159071759');
  *n Char(32) inz('34362333373827231759071159071759');
  *n Char(32) inz('34362332373827211759071159071759');
  *n Char(32) inz('34362333373827201759071159071759');
  *n Char(32) inz('34362230273827261759071159071759');
  *n Char(32) inz('34362239273827231759071159071759');
  *n Char(32) inz('34362239273827221759071159071759');
  *n Char(32) inz('34362230273827221759071159071759');
  *n Char(32) inz('34362234273827201759071159071759');
  *n Char(32) inz('34362132273827291759071159071759');
  *n Char(32) inz('34362130273827251759071159071759');
  *n Char(32) inz('34362135272827201759071159071759');
  *n Char(32) inz('34362031272827291759071159071759');
  *n Char(32) inz('34362036272827211759071159071759');
  *n Char(32) inz('34362034272827211759071159071759');
  *n Char(32) inz('34362937272826251759071159071759');
  *n Char(32) inz('34362836272826291759071159071759');
  *n Char(32) inz('34362834270826241759071159071759');
  *n Char(32) inz('34362836270826211759071159071759');
  *n Char(32) inz('34362731270826271759071159071759');
  *n Char(32) inz('34362739270826201759071159071759');
  *n Char(32) inz('34362730270826201759071159071759');
  *n Char(32) inz('34362631270826231759071159071759');
  *n Char(32) inz('34362533271826281759071159071759');
  *n Char(32) inz('34362538271826271759071159071759');
  *n Char(32) inz('34362534271826261759071159071759');
  *n Char(32) inz('34362534271826251759071159071759');
  *n Char(32) inz('34362537271826241759071159071759');
  *n Char(32) inz('34362430271826281759071159071759');
  *n Char(32) inz('34362436272826211759071159071759');
  *n Char(32) inz('34362333272826231759071159071759');
  *n Char(32) inz('34362235272826261759071159071759');
  *n Char(32) inz('34362230272826211759071159071759');
  *n Char(32) inz('34362137272826271759071159071759');
  *n Char(32) inz('34362136272826231759071159071759');
  *n Char(32) inz('34362136273826221759071159071759');
  *n Char(32) inz('34362034273826231759071159071759');
  *n Char(32) inz('34362934273825291759071159071759');
  *n Char(32) inz('34362932273825251759071159071759');
  *n Char(32) inz('34362935273825231759071159071759');
  *n Char(32) inz('34362839273825281759071159071759');
  *n Char(32) inz('34362836273825271759071159071759');
  *n Char(32) inz('34362837271825211759071159071759');
  *n Char(32) inz('34362738271825241759071159071759');
  *n Char(32) inz('34362636271825291759071159071759');
  *n Char(32) inz('34362634271825251759071159071759');
  *n Char(32) inz('34362636271825211759071159071759');
  *n Char(32) inz('34362539271825231759071159071759');
  *n Char(32) inz('34362535271825211759071159071759');
  *n Char(32) inz('34362439270825241759071159071759');
  *n Char(32) inz('34362433270825241759071159071759');
  *n Char(32) inz('34362435270825231759071159071759');
  *n Char(32) inz('34362339270825261759071159071759');
  *n Char(32) inz('34362330270825251759071159071759');
  *n Char(32) inz('34362238270825291759071159071759');
  *n Char(32) inz('34362230271825231759071159071759');
  *n Char(32) inz('34362131271825261759071159071759');
  *n Char(32) inz('34362133271825241759071159071759');
  *n Char(32) inz('34362036271825291759071159071759');
  *n Char(32) inz('34362032271825291759071159071759');
  *n Char(32) inz('34362035271825251759071159071759');
  *n Char(32) inz('34362039271825231759071159071759');
  *n Char(32) inz('34362931273824291759071159071759');
  *n Char(32) inz('34362939273824221759071159071759');
  *n Char(32) inz('34362932273824211759071159071759');
  *n Char(32) inz('34362930273824201759071159071759');
  *n Char(32) inz('34362837273824281759071159071759');
  *n Char(32) inz('34362832273824281759071159071759');
  *n Char(32) inz('34362738073824251759071159071759');
  *n Char(32) inz('34362736073824241759071159071759');
  *n Char(32) inz('34362735073824241759071159071759');
  *n Char(32) inz('34362730073824211759071159071759');
  *n Char(32) inz('34362631073824241759071159071759');
  *n Char(32) inz('34362630073824231759071159071759');
  *n Char(32) inz('34362431073824231759071159071759');
  *n Char(32) inz('34362433072824221759071159071759');
  *n Char(32) inz('34362433072824211759071159071759');
  *n Char(32) inz('34362333072824251759071159071759');
  *n Char(32) inz('34362337072824241759071159071759');
  *n Char(32) inz('34362330072824231759071159071759');
  *n Char(32) inz('34362338072824211759071159071759');
  *n Char(32) inz('34362234072824291759071159071759');
  *n Char(32) inz('34362230070824281759071159071759');
  *n Char(32) inz('34362230070824221759071159071759');
  *n Char(32) inz('34362131070824281759071159071759');
  *n Char(32) inz('34362131070824271759071159071759');
  *n Char(32) inz('34362139070824231759071159071759');
  *n Char(32) inz('34362133070824231759071159071759');
  *n Char(32) inz('34362132071824221759071159071759');
  *n Char(32) inz('34362033071824231759071159071759');
  *n Char(32) inz('34362938071823231759071159071759');
  *n Char(32) inz('34362938071823201759071159071759');
  *n Char(32) inz('34362937071823201759071159071759');
  *n Char(32) inz('34362830071823281759071159071759');
  *n Char(32) inz('34362837072823251759071159071759');
  *n Char(32) inz('34362735072823261759071159071759');
  *n Char(32) inz('34362730072823251759071159071759');
  *n Char(32) inz('34362735072823221759071159071759');
  *n Char(32) inz('34362630072823211759071159071759');
  *n Char(32) inz('34362536073823291759071159071759');
  *n Char(32) inz('34362531073823201759071159071759');
  *n Char(32) inz('34362438073823271759071159071759');
  *n Char(32) inz('34362433073823271759071159071759');
  *n Char(32) inz('34362436073823241759071159071759');
  *n Char(32) inz('34362439073823231759071159071759');
  *n Char(32) inz('34362433071823211759071159071759');
  *n Char(32) inz('34362335071823281759071159071759');
  *n Char(32) inz('34362330071823281759071159071759');
  *n Char(32) inz('34362337071823251759071159071759');
  *n Char(32) inz('34362333071823251759071159071759');
  *n Char(32) inz('34362338071823231759071159071759');
  *n Char(32) inz('34362335070823221759071159071759');
  *n Char(32) inz('34362233070823271759071159071759');
  *n Char(32) inz('34362235070823251759071159071759');
  *n Char(32) inz('34362231070823221759071159071759');
  *n Char(32) inz('34362230070823221759071159071759');
  *n Char(32) inz('34362130070823261759071159071759');
  *n Char(32) inz('34362038070823291759071159071759');
  *n Char(32) inz('34362032071823261759071159071759');
  *n Char(32) inz('34362031071823251759071159071759');
  *n Char(32) inz('34362034071823241759071159071759');
  *n Char(32) inz('34362039071823221759071159071759');
  *n Char(32) inz('34362032071823211759071159071759');
  *n Char(32) inz('34362038071823201759071159071759');
  *n Char(32) inz('34362936071822291759071159071759');
  *n Char(32) inz('34362939073822261759071159071759');
  *n Char(32) inz('34362931073822231759071159071759');
  *n Char(32) inz('34362936073822221759071159071759');
  *n Char(32) inz('34362831073822291759071159071759');
  *n Char(32) inz('34362837073822241759071159071759');
  *n Char(32) inz('34362838073822231759071159071759');
  *n Char(32) inz('34362738173822291759071159071759');
  *n Char(32) inz('34362731173822291759071159071759');
  *n Char(32) inz('34362736173822261759071159071759');
  *n Char(32) inz('34362637173822261759071159071759');
  *n Char(32) inz('34362631173822221759071159071759');
  *n Char(32) inz('34362637173822211759071159071759');
  *n Char(32) inz('34362537173822281759071159071759');
  *n Char(32) inz('34362534172822251759071159071759');
  *n Char(32) inz('34362534172822231759071159071759');
  *n Char(32) inz('34362431172822231759071159071759');
  *n Char(32) inz('34362430172822231759071159071759');
  *n Char(32) inz('34362439172822221759071159071759');
  *n Char(32) inz('34362338172822291759071159071759');
  *n Char(32) inz('34362239170822221759071159071759');
  *n Char(32) inz('34362237170822211759071159071759');
  *n Char(32) inz('34362234170822211759071159071759');
  *n Char(32) inz('34362135170822271759071159071759');
  *n Char(32) inz('34362131170822261759071159071759');
  *n Char(32) inz('34362132170822211759071159071759');
  *n Char(32) inz('34362036170822281759071159071759');
  *n Char(32) inz('34362032171822281759071159071759');
  *n Char(32) inz('34362034171822251759071159071759');
  *n Char(32) inz('34362032171822231759071159071759');
  *n Char(32) inz('34362039171822211759071159071759');
  *n Char(32) inz('34362031171822201759071159071759');
  *n Char(32) inz('34362836171821291759071159071759');
  *n Char(32) inz('34362830171821291759071159071759');
  *n Char(32) inz('34362839172821221759071159071759');
  *n Char(32) inz('34362835172821221759071159071759');
  *n Char(32) inz('34362837172821201759071159071759');
  *n Char(32) inz('34362734172821291759071159071759');
  *n Char(32) inz('34362637172821241759071159071759');
  *n Char(32) inz('34362633172821231759071159071759');
  *n Char(32) inz('34362632173821231759071159071759');
  *n Char(32) inz('34362632173821211759071159071759');
  *n Char(32) inz('34362536173821291759071159071759');
  *n Char(32) inz('34362534173821281759071159071759');
  *n Char(32) inz('34362539173821261759071159071759');
  *n Char(32) inz('34362533173821221759071159071759');
  *n Char(32) inz('34362537173821211759071159071759');
  *n Char(32) inz('34362533171821211759071159071759');
  *n Char(32) inz('34362432171821281759071159071759');
  *n Char(32) inz('34362434171821271759071159071759');
  *n Char(32) inz('34362431171821271759071159071759');
  *n Char(32) inz('34362432171821261759071159071759');
  *n Char(32) inz('34362438171821231759071159071759');
  *n Char(32) inz('34362434170821201759071159071759');
  *n Char(32) inz('34362330170821291759071159071759');
  *n Char(32) inz('34362333170821261759071159071759');
  *n Char(32) inz('34362336170821231759071159071759');
  *n Char(32) inz('34362337170821211759071159071759');
  *n Char(32) inz('34362334170821211759071159071759');
  *n Char(32) inz('34362237170821271759071159071759');
  *n Char(32) inz('34362231171821261759071159071759');
  *n Char(32) inz('34362234171821241759071159071759');
  *n Char(32) inz('34362237171821231759071159071759');
  *n Char(32) inz('34362234171821211759071159071759');
  *n Char(32) inz('34362230171821201759071159071759');
  *n Char(32) inz('34362137173821261759071159071759');
  *n Char(32) inz('34362135173821261759071159071759');
  *n Char(32) inz('34362135173821251759071159071759');
  *n Char(32) inz('34362134173821251759071159071759');
  *n Char(32) inz('34362134173821221759071159071759');
  *n Char(32) inz('34362038173821291759071159071759');
  *n Char(32) inz('34362031173821291759071159071759');
  *n Char(32) inz('34362036273821271759071159071759');
  *n Char(32) inz('34362031273821261759071159071759');
  *n Char(32) inz('34362939273820241759071159071759');
  *n Char(32) inz('34362930273820231759071159071759');
  *n Char(32) inz('34362837273820211759071159071759');
  *n Char(32) inz('34362834272820201759071159071759');
  *n Char(32) inz('34362734272820231759071159071759');
  *n Char(32) inz('34362733272820231759071159071759');
  *n Char(32) inz('34362736272820211759071159071759');
  *n Char(32) inz('34362637272820291759071159071759');
  *n Char(32) inz('34362639272820271759071159071759');
  *n Char(32) inz('34362639270820251759071159071759');
  *n Char(32) inz('34362634270820241759071159071759');
  *n Char(32) inz('34362539270820261759071159071759');
  *n Char(32) inz('34362536270820251759071159071759');
  *n Char(32) inz('34362537270820221759071159071759');
  *n Char(32) inz('34362436270820271759071159071759');
  *n Char(32) inz('34362032270828201759071159071759');
  *n Char(32) inz('34362631270823291759071159071759');
  *n Char(32) inz('34362037271822201759071159071759');
  *n Char(32) inz('34362433271829281759071159071759');
  *n Char(32) inz('34362235271829201759071159071759');
  *n Char(32) inz('34362937271828251759071159071759');
  *n Char(32) inz('34362236271828261759071159071759');
  *n Char(32) inz('34362835271827211759071159071759');
  *n Char(32) inz('34362236272827201759071159071759');
  *n Char(32) inz('34362131272827281759071159071759');
  *n Char(32) inz('34362030272824251759071159071759');
  *n Char(32) inz('34362936272823211759071159071759');
  *n Char(32) inz('34362537272823251759071159071759');
  *n Char(32) inz('34362535272823231759071159071759');
  *n Char(32) inz('34362136273822221759071159071759');
  *n Char(32) inz('34362739273820241759071159071759');
  *n Char(32) inz('34362339273827261759377459071759');
  *n Char(32) inz('34362632273820261759071159071759');
  *n Char(32) inz('34362435273824291759071159071759');
  *n Char(32) inz('34362135273823291759212959071759');
  *n Char(32) inz('34362536273828211759072459071759');
  *n Char(32) inz('34362038271822251759071159071759');
  *n Char(32) inz('34362536271821221759071159071759');
  *n Char(32) inz('34362938271827261759071159071759');
  *n Char(32) inz('34362730271827281759071159071759');
  *n Char(32) inz('34362133271828241759071259071759');
  *n Char(32) inz('34362932271825261759071159071759');
  *n Char(32) inz('34362738271827201759071159071759');
  *n Char(32) inz('34362439270823271759071159071759');
  *n Char(32) inz('34362230270823211759071159071759');
  *n Char(32) inz('34362931270827241759071159071759');
  *n Char(32) inz('34362030270825231759071159071759');
  *n Char(32) inz('34362031270822251759071159071759');
  *n Char(32) inz('34362231270821241759071159071759');
  *n Char(32) inz('34362835271822281759071159071759');
  Contattone Char(32) dim(1659) Pos(1);
End-Ds Contattoni;

Dcl-S TextMsg       VarChar(100);
Dcl-C MAX           1500;
Dcl-C AP             '''';
dcl-s Old_Value int(20);
dcl-s New_Value int(20);
dcl-s Lock      int(20) Static(*allThread);

// ____________________________________________________________________________

Exec Sql
  Set Option Datfmt = *Iso, Timfmt = *Iso, Closqlcsr = *EndMod, Commit = *none;

Command = 'ADDENVVAR ENVVAR(REMOTE_ADDR) VALUE('+AP+'192.168.0.232'+AP+')';
Rc = Cmd(Command);

Exec Sql
  Create or Replace table Paolos/CheckCont (
    Dataora timestamp default current timestamp,
    idx   Int,
    logtext varchar(100) ccsid 1144);

Exec Sql
  delete from Paolos/CheckCont;
IdxMain = 1;
ContTestDS = ContTest(Contattone(IdxMain) :'TESTCONT1');
CheckResult(IdxMain : ContTestDS);

ThreadReadyArr(*) = 'A';
%Subst(ThreadReady :1 :MAX) = ' ';

For IdxMain = 1 to MAX;
  Rc = pthread_create(thread(IdxMain) : *Omit : %PAddr(CheckContattone) : %Addr(IdxMain));
  // Rc = pthread_detach(thread(IdxMain));
  Rc = pthread_setname_np(thread(IdxMain) :'TEST-' + %Char(IdxMain));
  Rc = pthread_setname_np(thread(IdxMain) :'TEST-' + %Char(IdxMain));

  USleep(20000);
EndFor;


For IdxMain = 1 to MAX;
  Rc = pthread_join (thread(IdxMain) : PtrStatus);
//  Rc = pthread_attr_destroy(thread(IdxMain);
  TextMsg ='Fine Thread: ' + %Char(IdxMain) + 'Status: ' + %Char(Status);
  Exec Sql
    Insert into CheckCont (Idx, logtext)
    Values(:IdxMain, :TextMsg);
EndFor;

Return;
// ____________________________________________________________________________
Dcl-Proc CheckContattone;
  Dcl-Pi CheckContattone;
    PtrIdx Pointer value;
    // IdxTemp1       Int(10);
  End-Pi CheckContattone;
  Dcl-S IdxTemp1      Int(10) Based(PtrIdx);
  Dcl-S IdxTemp       Int(10);
  // ____________________________________________________________________________

  IdxTemp = IdxTemp1;

  ThreadReadyArr(IdxTemp) = '1';

  TextMsg ='Inizio Thread: ' + %Char(IdxTemp);
  Exec Sql
    Insert into CheckCont (Idx, logtext)
    Values(:IdxTemp, :TextMsg);

  DoW (Not (%scan(' ' :%Subst(ThreadReady :1 :MAX)) = 0));
    USleep(10);
    Iter;
  EndDo;

  TextMsg ='Inizio check contattone: ' + %Char(IdxTemp) + ' ' + Contattone(IdxTemp);
  Exec Sql
    Insert into CheckCont (Idx, logtext)
    Values(:IdxTemp, :TextMsg);

  ContTestDS = ContTest(Contattone(IdxTemp) :'TESTCONT1' :'');

  TextMsg ='Fine check contattone: ' + %Char(IdxTemp) + ' ' + Contattone(IdxTemp);
  Exec Sql
    Insert into CheckCont (Idx, logtext)
    Values(:IdxTemp, :TextMsg);

  CheckResult(IdxTemp : ContTestDS);

  Return;

End-Proc CheckContattone;

// ____________________________________________________________________________
Dcl-Proc CheckResult;
  Dcl-Pi CheckResult;
    IdxCheck      Int(10) value;
    ContTestDS1   Likeds(ContTestDS);
  End-Pi CheckResult;

  // ____________________________________________________________________________

  Dsply %Char(IdxCheck);
  // accetto OKAY e ER10 (ip)
  //  e palmarone cliente 99999
  If (RetCode4 <> 'OKAY' and RetCode4<>'ER10' and
     %SubSt(TokenOutput:1:5) <> '99999');
    TextMsg ='Invalid Login Token ' + RetCode4 + '-' + Contattone(IdxCheck);
    Exec Sql
      Insert into CheckCont (Idx, logtext)
      Values(:IdxCheck, :TextMsg);

  Else;
    TextMsg ='Thread: ' + %Char(IdxCheck) + ' Token ' + RetCode4 + '-' + UserOut;
    Exec Sql
      Insert into CheckCont (Idx, logtext)
      Values(:IdxCheck, :TextMsg);
  EndIf;

  Return;

End-Proc CheckResult;