**FREE
// Elabora richiesta di chiamate http fatte da un programma esterno
Ctl-Opt  DftActGrp(*no)
  ActGrp(*StgMdl)
  StgMdl(*SNGLVL)
  Bnddir('AL400MNUV2': 'WEBSCKDIR' : 'TESTBND')
  Thread(*Concurrent)
  Option(*NoUnRef :*SrcStmt :*NoDebugIo)
  DatFmt(*Iso) TimFmt(*Iso)
  Debug(*Constants)
  AlwNull(*UsrCtl)
  DftName(TESTCONT2)
  Text('Test contattone');
// ___________________________________________________________________
/Include QSYSINC/QRPGLESRC,PTHREAD
/Include Roberto/qrpglesrc,copy_pr
/Include Roberto/qrpglesrc,copy_ds

/copy Al400mnuv2/QRpgleSrc,UMiFunc_h
// Prototipi
Dcl-Pr TESTCONT2 ExtPgm('TESTCONT2');
End-Pr TESTCONT2;

Dcl-Pi TESTCONT2;
End-Pi TESTCONT2;

Dcl-Pr UChkCont1r Char(100) extproc('UCHKCONT1R');
  Contattone      Char(32) Const;
  CallerPgm       Char(10) Const;
  Debug           Char(1) Options(*NoPass) Const;
End-Pr UChkCont1r;


Dcl-Pr USleep   Int(10) ExtProc('usleep');
  MilliSeconds Uns(10) Value;
End-Pr USleep;

Dcl-Pr Cmd   Int(10) ExtProc('system');
  CmdString Pointer Value Options(*String);
End-Pr Cmd;

Dcl-s Command  VarChar(1000);
Dcl-S ErrMsgId Char(7) Import('_EXCP_MSGID');
//  @remark CHKLKVAL and CLRLKVAL are available since V5R3
dcl-pr CheckLockValue int(10) extproc('_CHKLKVAL');
  *n int(20); // lock
  *n int(20) value; // old_val
  *n int(20) value; // new_val
end-pr;

//  @BIF _CLRKLVAL (Clear Lock Value (CLRLKVAL))
dcl-pr ClearLockValue extproc('_CLRLKVAL');
  *n int(20); // lock
  *n int(20) value; // new_val
end-pr;

// ____________________________________________________________________________
Dcl-Ds thread LikeDs(pthread_t) Dim(1659) Static(*allthread);

Dcl-Ds a Static(*allthread);
  ThreadReadyArr       Char(1) Dim(1659) ;
  ThreadReady          Char(1659) Pos(1) ;
End-Ds;

Dcl-S Rc                 Int(10);
Dcl-S IdxMain            Int(10) ;
Dcl-S Status             Int(10) ;
Dcl-S PtrStatus          Pointer inz(%Addr(Status));
Dcl-Ds Contattoni;
  *n Char(32) inz('34972016171800111759074759071759');
  *n Char(32) inz('34962815171806181759072659071759');
  *n Char(32) inz('34962411171806141759072659071759');
  *n Char(32) inz('34962217171806131759072659071759');
  *n Char(32) inz('34962712171805101759072659071759');
  *n Char(32) inz('34962310171805161759072459071759');
  *n Char(32) inz('34962315173804121759072459071759');
  *n Char(32) inz('34962117173803161759072459071759');
  *n Char(32) inz('34962010173803181759072459071759');
  *n Char(32) inz('34962815173802111759072459071759');
  *n Char(32) inz('34962716173802151759072459071759');
  *n Char(32) inz('34962410173802121759072459071759');
  *n Char(32) inz('34962417173802111759072459071759');
  *n Char(32) inz('34962310173802121759072459071759');
  *n Char(32) inz('34962112173802151759076359071759');
  *n Char(32) inz('34962912173801151759072459071759');
  *n Char(32) inz('34962811173801111759072459071759');
  *n Char(32) inz('34962815273801101759072459071759');
  *n Char(32) inz('34962617273801151759072259071759');
  *n Char(32) inz('34962517273801131759072259071759');
  *n Char(32) inz('34962518273801121759072259071759');
  *n Char(32) inz('34962518273801101759072059071759');
  *n Char(32) inz('34962114273801161759072059071759');
  *n Char(32) inz('34962015273801101759072059071759');
  *n Char(32) inz('34962715272800111759072059071759');
  *n Char(32) inz('34962517272800141759072059071759');
  *n Char(32) inz('34962418272805191759072359071759');
  *n Char(32) inz('34962315272801191759072059071759');
  *n Char(32) inz('34962517272802141759072059071759');
  *n Char(32) inz('34962515272802141759072059071759');
  *n Char(32) inz('34962514272802141759072059071759');
  *n Char(32) inz('34962513272802141759072059071759');
  *n Char(32) inz('34962511272802141759072059071759');
  *n Char(32) inz('34962519272802131759072059071759');
  *n Char(32) inz('34962517272802131759072059071759');
  *n Char(32) inz('34962510270802131759072059071759');
  *n Char(32) inz('34962519270802121759072059071759');
  *n Char(32) inz('34962518270802121759072059071759');
  *n Char(32) inz('34962516270802121759072059071759');
  *n Char(32) inz('34962514270802121759072059071759');
  *n Char(32) inz('34962510270802121759072059071759');
  *n Char(32) inz('34962518270802111759072059071759');
  *n Char(32) inz('34962517270802111759072959071759');
  *n Char(32) inz('34962514270802111759072959071759');
  *n Char(32) inz('34962513271802111759072959071759');
  *n Char(32) inz('34962510271802111759072959071759');
  *n Char(32) inz('34962518271802101759072959071759');
  *n Char(32) inz('34962516271802101759072959071759');
  *n Char(32) inz('34962515271802101759072959071759');
  *n Char(32) inz('34962510271802101759072959071759');
  *n Char(32) inz('34962416271802191759072959071759');
  *n Char(32) inz('34962413271802191759072959071759');
  *n Char(32) inz('34962412271802191759072959071759');
  *n Char(32) inz('34962410271802191759072959071759');
  *n Char(32) inz('34962419272802181759072959071759');
  *n Char(32) inz('34962418272802181759072959071759');
  *n Char(32) inz('34962417272802181759072959071759');
  *n Char(32) inz('34962416272802181759072959071759');
  *n Char(32) inz('34962413272802181759072959071759');
  *n Char(32) inz('34962411272802181759072959071759');
  *n Char(32) inz('34962410272802181759072959071759');
  *n Char(32) inz('34962418272802171759072959071759');
  *n Char(32) inz('34962415272802171759072959071759');
  *n Char(32) inz('34962414272802171759072959071759');
  *n Char(32) inz('34962413272802171759072959071759');
  *n Char(32) inz('34962412273802171759072959071759');
  *n Char(32) inz('34962410273802171759072959071759');
  *n Char(32) inz('34962419273802161759072959071759');
  *n Char(32) inz('34962418273802161759072959071759');
  *n Char(32) inz('34962415273802161759072959071759');
  *n Char(32) inz('34962411273802161759072959071759');
  *n Char(32) inz('34962410273802161759072959071759');
  *n Char(32) inz('34962418273802151759072959071759');
  *n Char(32) inz('34962416273802151759072959071759');
  *n Char(32) inz('34962412271802151759072959071759');
  *n Char(32) inz('34962916271800151759072959071759');
  *n Char(32) inz('34962414271805141759072959071759');
  *n Char(32) inz('34962411271805111759072959071759');
  *n Char(32) inz('34962018271801121759072959071759');
  *n Char(32) inz('34962817271801181759072959071759');
  *n Char(32) inz('34962510271808101759072959071759');
  *n Char(32) inz('34962513271809141759072959071759');
  *n Char(32) inz('34962417271809111759072959071759');
  *n Char(32) inz('34962815271808101759072959071759');
  *n Char(32) inz('34962415271808111759072959071759');
  *n Char(32) inz('34962014271808131759072959071759');
  *n Char(32) inz('34962812270807191759072959071759');
  *n Char(32) inz('34962514270807191759072959071759');
  *n Char(32) inz('34962117270807181759072959071759');
  *n Char(32) inz('34962018270807131759072959071759');
  *n Char(32) inz('34962618270806111759072959071759');
  *n Char(32) inz('34962616270806111759072959071759');
  *n Char(32) inz('34962013270806161759072959071759');
  *n Char(32) inz('34962519270805121759072959071759');
  *n Char(32) inz('34962417270805191759072959071759');
  *n Char(32) inz('34962215270805171759072959071759');
  *n Char(32) inz('34962315270804101759072959071759');
  *n Char(32) inz('34962910271803161759072959071759');
  *n Char(32) inz('34962610271803161759072959071759');
  *n Char(32) inz('34962010271803151759072959071759');
  *n Char(32) inz('34962917271801151759072959071759');
  *n Char(32) inz('34962715271801121759072959071759');
  *n Char(32) inz('34962612271801171759072959071759');
  *n Char(32) inz('34962113271801171759072959071759');
  *n Char(32) inz('34962117271801101759072959071759');
  *n Char(32) inz('34962010271801141759072959071759');
  *n Char(32) inz('34962919271800131759072959071759');
  *n Char(32) inz('34962818271800151759072959071759');
  *n Char(32) inz('34962318271809191759072959071759');
  *n Char(32) inz('34962212271809161759072959071759');
  *n Char(32) inz('34962214273809141759072959071759');
  *n Char(32) inz('34962215273809111759072959071759');
  *n Char(32) inz('34962114273809171759072959071759');
  *n Char(32) inz('34962914273808171759072959071759');
  *n Char(32) inz('34962816273808181759072959071759');
  *n Char(32) inz('34962713273808181759072959071759');
  *n Char(32) inz('34962613273808181759072959071759');
  *n Char(32) inz('34962614273808161759072959071759');
  *n Char(32) inz('34962516273808181759072959071759');
  *n Char(32) inz('34962419273808161759072959071759');
  *n Char(32) inz('34962210273808171759072959071759');
  *n Char(32) inz('34962211273808151759072959071759');
  *n Char(32) inz('34962217273808131759072959071759');
  *n Char(32) inz('34962118373808131759072959071759');
  *n Char(32) inz('34962011373808191759072959071759');
  *n Char(32) inz('34962014373808181759072959071759');
  *n Char(32) inz('34962018373808161759072959071759');
  *n Char(32) inz('34962014373808121759072959071759');
  *n Char(32) inz('34962916373807191759072959071759');
  *n Char(32) inz('34962910373807171759072959071759');
  *n Char(32) inz('34962910373807141759072959071759');
  *n Char(32) inz('34962817373807151759072959071759');
  *n Char(32) inz('34962816373807131759072959071759');
  *n Char(32) inz('34962612373807161759072959071759');
  *n Char(32) inz('34962510372807121759072959071759');
  *n Char(32) inz('34962417372807191759072959071759');
  *n Char(32) inz('34962416372807161759072959071759');
  *n Char(32) inz('34962412372807161759072959071759');
  *n Char(32) inz('34962318372807141759072959071759');
  *n Char(32) inz('34962210372807171759072959071759');
  *n Char(32) inz('34962212372807151759072959071759');
  *n Char(32) inz('34962114372807161759072959071759');
  *n Char(32) inz('34962113372807161759072959071759');
  *n Char(32) inz('34962019372807181759072959071759');
  *n Char(32) inz('34962018372807181759072959071759');
  *n Char(32) inz('34962919370806121759072959071759');
  *n Char(32) inz('34962617370806151759072959071759');
  *n Char(32) inz('34962511370806161759072959071759');
  *n Char(32) inz('34962416370806181759072959071759');
  *n Char(32) inz('34962315370806181759072959071759');
  *n Char(32) inz('34962211370806171759072959071759');
  *n Char(32) inz('34962911370805101759072959071759');
  *n Char(32) inz('34962817370805181759072959071759');
  *n Char(32) inz('34962616370805151759072959071759');
  *n Char(32) inz('34962610370805101759072959071759');
  *n Char(32) inz('34962519370805191759072959071759');
  *n Char(32) inz('34962513370805151759072959071759');
  *n Char(32) inz('34962518370805141759072959071759');
  *n Char(32) inz('34962513371805131759072959071759');
  *n Char(32) inz('34962418371805151759072959071759');
  *n Char(32) inz('34962410371805141759072959071759');
  *n Char(32) inz('34962418371805101759072959071759');
  *n Char(32) inz('34962317371805181759072959071759');
  *n Char(32) inz('34962316371805141759072959071759');
  *n Char(32) inz('34962213371805191759072959071759');
  *n Char(32) inz('34962117371805101759072959071759');
  *n Char(32) inz('34962017371805121759072959071759');
  *n Char(32) inz('34962911371804121759072959071759');
  *n Char(32) inz('34962918371804111759072959071759');
  *n Char(32) inz('34962811371804191759072959071759');
  *n Char(32) inz('34962814372804131759072959071759');
  *n Char(32) inz('34962819372804101759072959071759');
  *n Char(32) inz('34962812372804101759072959071759');
  *n Char(32) inz('34962810372804101759072959071759');
  *n Char(32) inz('34962711372804131759072959071759');
  *n Char(32) inz('34962710372804121759072959071759');
  *n Char(32) inz('34962619372804191759072959071759');
  *n Char(32) inz('34962614372804161759072959071759');
  *n Char(32) inz('34962512372804191759072959071759');
  *n Char(32) inz('34962518372804151759072959071759');
  *n Char(32) inz('34962514372804151759072959071759');
  *n Char(32) inz('34962512372804121759072959071759');
  *n Char(32) inz('34962415372804181759072959071759');
  *n Char(32) inz('34962419373804151759072959071759');
  *n Char(32) inz('34962216373804151759072959071759');
  *n Char(32) inz('34962116373804181759072959071759');
  *n Char(32) inz('34962111373804121759072959071759');
  *n Char(32) inz('34962116373804101759072959071759');
  *n Char(32) inz('34962016373804161759072959071759');
  *n Char(32) inz('34962018373804151759072959071759');
  *n Char(32) inz('34962011373804131759072959071759');
  *n Char(32) inz('34962913373803101759072959071759');
  *n Char(32) inz('34962116373802161759072959071759');
  *n Char(32) inz('34962812373803111759072959071759');
  *n Char(32) inz('34962719373803151759072959071759');
  *n Char(32) inz('34962718373803121759072959071759');
  *n Char(32) inz('34962713371803121759072959071759');
  *n Char(32) inz('34962610371803191759072959071759');
  *n Char(32) inz('34962618371803131759072959071759');
  *n Char(32) inz('34962512371803161759072959071759');
  *n Char(32) inz('34962516371803131759072959071759');
  *n Char(32) inz('34962517371803121759072959071759');
  *n Char(32) inz('34962411371803161759072959071759');
  *n Char(32) inz('34962411371803151759072959071759');
  *n Char(32) inz('34962410371803131759072959071759');
  *n Char(32) inz('34962314371803171759072959071759');
  *n Char(32) inz('34962319371803111759072959071759');
  *n Char(32) inz('34962314371803111759072959071759');
  *n Char(32) inz('34962210371803161759072959071759');
  *n Char(32) inz('34962214370803151759072959071759');
  *n Char(32) inz('34962215370803121759072959071759');
  *n Char(32) inz('34962114370803151759072959071759');
  *n Char(32) inz('34962118370803141759072959071759');
  *n Char(32) inz('34962114370803141759072959071759');
  *n Char(32) inz('34962112370803131759072959071759');
  *n Char(32) inz('34962110370803121759072959071759');
  *n Char(32) inz('34962110370803111759072959071759');
  *n Char(32) inz('34962013370803131759072959071759');
  *n Char(32) inz('34962010370803131759072959071759');
  *n Char(32) inz('34962017370803111759072959071759');
  *n Char(32) inz('34962915370802171759072959071759');
  *n Char(32) inz('34962813371802191759072959071759');
  *n Char(32) inz('34962813371802151759072959071759');
  *n Char(32) inz('34962811371802131759072959071759');
  *n Char(32) inz('34962714371802111759072959071759');
  *n Char(32) inz('34962613371802191759072959071759');
  *n Char(32) inz('34962613371802151759072959071759');
  *n Char(32) inz('34962617371802101759072959071759');
  *n Char(32) inz('34962415371802131759072959071759');
  *n Char(32) inz('34962310371802171759072959071759');
  *n Char(32) inz('34962316371802111759072959071759');
  *n Char(32) inz('34962212371802181759072959071759');
  *n Char(32) inz('34962213373802151759072959071759');
  *n Char(32) inz('34962210373802141759072959071759');
  *n Char(32) inz('34962210373802121759072959071759');
  *n Char(32) inz('34962114373802141759072959071759');
  *n Char(32) inz('34962110373802111759072959071759');
  *n Char(32) inz('34962015373802161759072959071759');
  *n Char(32) inz('34962010373802151759072959071759');
  *n Char(32) inz('34962018373802111759072959071759');
  *n Char(32) inz('34962011373802111759072959071759');
  *n Char(32) inz('34962018373802101759072959071759');
  *n Char(32) inz('34962919373801191759072959071759');
  *n Char(32) inz('34962917373801131759072959071759');
  *n Char(32) inz('34962928373801121759072959071759');
  *n Char(32) inz('34962920373801111759072959071759');
  *n Char(32) inz('34962825373801181759072959071759');
  *n Char(32) inz('34962820373801131759072959071759');
  *n Char(32) inz('34962720373801191759072959071759');
  *n Char(32) inz('34962725373801101759072959071759');
  *n Char(32) inz('34962525373801171759072959071759');
  *n Char(32) inz('34962520373801171759072959071759');
  *n Char(32) inz('34962521373801141759072959071759');
  *n Char(32) inz('34962529373801111759072959071759');
  *n Char(32) inz('34962427373801101759072959071759');
  *n Char(32) inz('34962327373801171759072959071759');
  *n Char(32) inz('34962322372801121759072959071759');
  *n Char(32) inz('34962129372801181759072959071759');
  *n Char(32) inz('34962125372801181759072959071759');
  *n Char(32) inz('34962124372801181759072959071759');
  *n Char(32) inz('34962128372801171759072959071759');
  *n Char(32) inz('34962122372801141759072959071759');
  *n Char(32) inz('34962122372801111759072959071759');
  *n Char(32) inz('34962029372801161759072959071759');
  *n Char(32) inz('34962027372801151759072959071759');
  *n Char(32) inz('34962921372800181759072959071759');
  *n Char(32) inz('34962922372800121759072959071759');
  *n Char(32) inz('34962825370800131759072959071759');
  *n Char(32) inz('34962821370800121759072959071759');
  *n Char(32) inz('34962720370800171759072959071759');
  *n Char(32) inz('34962621370800111759072959071759');
  *n Char(32) inz('34962627370800101759072959071759');
  *n Char(32) inz('34962625370800101759072959071759');
  *n Char(32) inz('34962524370808111759072959071759');
  *n Char(32) inz('34962628370805161759072959071759');
  *n Char(32) inz('34962624370800171759072959071759');
  *n Char(32) inz('34972424370800111759072959071759');
  *n Char(32) inz('34962723370807181759072959071759');
  *n Char(32) inz('34962723370807171759072959071759');
  *n Char(32) inz('34962923371804171759072959071759');
  *n Char(32) inz('34962826371802131759072959071759');
  *n Char(32) inz('34962321371801141759072959071759');
  *n Char(32) inz('34962527371806151759072959071759');
  *n Char(32) inz('34962829371803171759072959071759');
  *n Char(32) inz('34962727371801131759072959071759');
  *n Char(32) inz('34962323371801131759072959071759');
  *n Char(32) inz('34962023371801101759072959071759');
  *n Char(32) inz('34962620371804111759072959071759');
  *n Char(32) inz('34962025371803121759072959071759');
  *n Char(32) inz('34962827371802161759072959071759');
  *n Char(32) inz('34962828372807191759072959071759');
  *n Char(32) inz('34962321372803101759072959071759');
  *n Char(32) inz('34962724372808181759072959071759');
  *n Char(32) inz('34962121372808161759072959071759');
  *n Char(32) inz('34962423372807111759072959071759');
  *n Char(32) inz('34962523372807161759072959071759');
  *n Char(32) inz('34962323372806101759072959071759');
  *n Char(32) inz('34962626372804151759072959071759');
  *n Char(32) inz('34962122372804131759072959071759');
  *n Char(32) inz('34962025372804101759072959071759');
  *n Char(32) inz('34962320372803131759072959071759');
  *n Char(32) inz('34962522373801111759072959071759');
  *n Char(32) inz('34962427373801191759072959071759');
  *n Char(32) inz('34962121373801171759072959071759');
  *n Char(32) inz('34962529373809131759072959071759');
  *n Char(32) inz('34962524373809121759072959071759');
  *n Char(32) inz('34962528373809101759072959071759');
  *n Char(32) inz('34962428373809191759072959071759');
  *n Char(32) inz('34962425373809181759072959071759');
  *n Char(32) inz('34962429373809171759072959071759');
  *n Char(32) inz('34962428373809171759072959071759');
  *n Char(32) inz('34962423371809161759072959071759');
  *n Char(32) inz('34962422371809161759072959071759');
  *n Char(32) inz('34962421371809141759072959071759');
  *n Char(32) inz('34962424371809111759072959071759');
  *n Char(32) inz('34962422371809111759072959071759');
  *n Char(32) inz('34962426371809101759072959071759');
  *n Char(32) inz('34962324371809181759072959071759');
  *n Char(32) inz('34962324371809171759072959071759');
  *n Char(32) inz('34962329371809161759072959071759');
  *n Char(32) inz('34962326371809161759072959071759');
  *n Char(32) inz('34962324371809161759072959071759');
  *n Char(32) inz('34962326371809151759072959071759');
  *n Char(32) inz('34962321370809141759072959071759');
  *n Char(32) inz('34962320370809141759072959071759');
  *n Char(32) inz('34962329370809121759072959071759');
  *n Char(32) inz('34962323370809121759072959071759');
  *n Char(32) inz('34962321370809121759072959071759');
  *n Char(32) inz('34962328370809111759072959071759');
  *n Char(32) inz('34962327370809111759072959071759');
  *n Char(32) inz('34962324370809111759072959071759');
  *n Char(32) inz('34962229370809181759072959071759');
  *n Char(32) inz('34962220370809181759072959071759');
  *n Char(32) inz('34962227370809171759072959071759');
  *n Char(32) inz('34962224370809161759072959071759');
  *n Char(32) inz('34962226371809151759072959071759');
  *n Char(32) inz('34962226371809141759072959071759');
  *n Char(32) inz('34962222371809131759072959071759');
  *n Char(32) inz('34962124371809191759072959071759');
  *n Char(32) inz('34962129371809181759072959071759');
  *n Char(32) inz('34962123371809171759072959071759');
  *n Char(32) inz('34962120371809161759072959071759');
  *n Char(32) inz('34962129371809151759072959071759');
  *n Char(32) inz('34962129371809141759072959071759');
  *n Char(32) inz('34962129371809131759072959071759');
  *n Char(32) inz('34962125371809131759072959071759');
  *n Char(32) inz('34962125371809121759072959071759');
  *n Char(32) inz('34962121371809121759072959071759');
  *n Char(32) inz('34962120373809121759072959071759');
  *n Char(32) inz('34962122373809111759072959071759');
  *n Char(32) inz('34962126373809101759072959071759');
  *n Char(32) inz('34962124373809101759072959071759');
  *n Char(32) inz('34962123373809101759072959071759');
  *n Char(32) inz('34962121373809101759072959071759');
  *n Char(32) inz('34962021373809191759072959071759');
  *n Char(32) inz('34962226373809101759072959071759');
  *n Char(32) inz('34962029373809171759072959071759');
  *n Char(32) inz('34962024373809171759072959071759');
  *n Char(32) inz('34962029373809151759072959071759');
  *n Char(32) inz('34962020373809141759072959071759');
  *n Char(32) inz('34962029373809131759072959071759');
  *n Char(32) inz('34962027273809131759072959071759');
  *n Char(32) inz('34962028273809121759072959071759');
  *n Char(32) inz('34962027273809121759072959071759');
  *n Char(32) inz('34962029273809111759072959071759');
  *n Char(32) inz('34962025273809101759072959071759');
  *n Char(32) inz('34962929273808191759072959071759');
  *n Char(32) inz('34962926273808191759072959071759');
  *n Char(32) inz('34962920273808171759072959071759');
  *n Char(32) inz('34962928273808161759072959071759');
  *n Char(32) inz('34962924273808161759072959071759');
  *n Char(32) inz('34962922273808151759072959071759');
  *n Char(32) inz('34962923273808131759072959071759');
  *n Char(32) inz('34962921272808131759072959071759');
  *n Char(32) inz('34962927272808121759072959071759');
  *n Char(32) inz('34962926272808121759072959071759');
  *n Char(32) inz('34962926272808111759072959071759');
  *n Char(32) inz('34962924272808111759072959071759');
  *n Char(32) inz('34962826272808191759072959071759');
  *n Char(32) inz('34962824272808191759072959071759');
  *n Char(32) inz('34962822272808191759072959071759');
  *n Char(32) inz('34962821272808191759072959071759');
  *n Char(32) inz('34962827272808181759072959071759');
  *n Char(32) inz('34962820272808181759072959071759');
  *n Char(32) inz('34962829272808171759072959071759');
  *n Char(32) inz('34962821270808171759072959071759');
  *n Char(32) inz('34962828270808161759072959071759');
  *n Char(32) inz('34962827270808161759072959071759');
  *n Char(32) inz('34962820270808161759072959071759');
  *n Char(32) inz('34962824270808151759072959071759');
  *n Char(32) inz('34962823270808131759072959071759');
  *n Char(32) inz('34962828270808121759072959071759');
  *n Char(32) inz('34962827270808121759072959071759');
  *n Char(32) inz('34962824270808121759072959071759');
  *n Char(32) inz('34962821270808121759072959071759');
  *n Char(32) inz('34962721270808171759072959071759');
  *n Char(32) inz('34962723270808161759072959071759');
  *n Char(32) inz('34962721271808161759072959071759');
  *n Char(32) inz('34962727271808151759072959071759');
  *n Char(32) inz('34962723271808151759072959071759');
  *n Char(32) inz('34962726271808131759072959071759');
  *n Char(32) inz('34962728271808121759072959071759');
  *n Char(32) inz('34962729271808111759072959071759');
  *n Char(32) inz('34962628271808191759072959071759');
  *n Char(32) inz('34962627271808181759072959071759');
  *n Char(32) inz('34962625271808171759072959071759');
  *n Char(32) inz('34962624271808151759072959071759');
  *n Char(32) inz('34962620271808151759072959071759');
  *n Char(32) inz('34962625271808131759072959071759');
  *n Char(32) inz('34962626272808121759072959071759');
  *n Char(32) inz('34962526272808191759072959071759');
  *n Char(32) inz('34962521272808181759072959071759');
  *n Char(32) inz('34962520272808181759072959071759');
  *n Char(32) inz('34962526272808171759072959071759');
  *n Char(32) inz('34962520272808141759072959071759');
  *n Char(32) inz('34962522272808131759072959071759');
  *n Char(32) inz('34962521272808121759072959071759');
  *n Char(32) inz('34962523272808111759072959071759');
  *n Char(32) inz('34962522272808111759072959071759');
  *n Char(32) inz('34962522272808101759072959071759');
  *n Char(32) inz('34962428273808171759072959071759');
  *n Char(32) inz('34962426273808171759072959071759');
  *n Char(32) inz('34962425273808171759072959071759');
  *n Char(32) inz('34962423273808171759072959071759');
  *n Char(32) inz('34962426273808151759072959071759');
  *n Char(32) inz('34962428273808141759072959071759');
  *n Char(32) inz('34962427273808111759072959071759');
  *n Char(32) inz('34962422273808111759072959071759');
  *n Char(32) inz('34962420273808101759072959071759');
  *n Char(32) inz('34962323271808171759072959071759');
  *n Char(32) inz('34962325271808161759072959071759');
  *n Char(32) inz('34962326271808151759072959071759');
  *n Char(32) inz('34962325271808151759072959071759');
  *n Char(32) inz('34962326271808121759072959071759');
  *n Char(32) inz('34962320271808121759072959071759');
  *n Char(32) inz('34962328271808111759072959071759');
  *n Char(32) inz('34962323271808111759072959071759');
  *n Char(32) inz('34962220271808181759072959071759');
  *n Char(32) inz('34962227270808161759072959071759');
  *n Char(32) inz('34962225270808161759072959071759');
  *n Char(32) inz('34962220270808151759072959071759');
  *n Char(32) inz('34962227270808141759072959071759');
  *n Char(32) inz('34962226270808141759072959071759');
  *n Char(32) inz('34962221270808141759072959071759');
  *n Char(32) inz('34962224270808131759072959071759');
  *n Char(32) inz('34962224270808121759072959071759');
  *n Char(32) inz('34962221270808121759072959071759');
  *n Char(32) inz('34962220270808121759072959071759');
  *n Char(32) inz('34962224271808111759072959071759');
  *n Char(32) inz('34962223271808111759072959071759');
  *n Char(32) inz('34962220271808111759072959071759');
  *n Char(32) inz('34962227271808101759072959071759');
  *n Char(32) inz('34962129271808191759072959071759');
  *n Char(32) inz('34962125271808181759072959071759');
  *n Char(32) inz('34962121271808171759072959071759');
  *n Char(32) inz('34962128271808161759072959071759');
  *n Char(32) inz('34962125271808161759072959071759');
  *n Char(32) inz('34962122271808161759072959071759');
  *n Char(32) inz('34962121271808151759072959071759');
  *n Char(32) inz('34962127271808141759072959071759');
  *n Char(32) inz('34962124273808141759072959071759');
  *n Char(32) inz('34962120273808141759072959071759');
  *n Char(32) inz('34962121273808131759072959071759');
  *n Char(32) inz('34962124273808101759072959071759');
  *n Char(32) inz('34962023273808171759072959071759');
  *n Char(32) inz('34962026273808141759072959071759');
  *n Char(32) inz('34962024273808141759072959071759');
  *n Char(32) inz('34962029273808131759072959071759');
  *n Char(32) inz('34962023273808121759072959071759');
  *n Char(32) inz('34962028273808111759072959071759');
  *n Char(32) inz('34962022073808111759072959071759');
  *n Char(32) inz('34962922073807191759072959071759');
  *n Char(32) inz('34962921073807191759072959071759');
  *n Char(32) inz('34962929073807181759072959071759');
  *n Char(32) inz('34962920073807181759072959071759');
  *n Char(32) inz('34962927073807151759072959071759');
  *n Char(32) inz('34962924073807151759072959071759');
  *n Char(32) inz('34962925073807141759072959071759');
  *n Char(32) inz('34962922073807141759072959071759');
  *n Char(32) inz('34962926073807131759072959071759');
  *n Char(32) inz('34962922072807121759072059071759');
  *n Char(32) inz('34962926072807111759072959071759');
  *n Char(32) inz('34962923072807111759072959071759');
  *n Char(32) inz('34962827072807191759072959071759');
  *n Char(32) inz('34962829072807161759072959071759');
  *n Char(32) inz('34962828072807161759072959071759');
  *n Char(32) inz('34962826072807161759072959071759');
  *n Char(32) inz('34962829072807151759072959071759');
  *n Char(32) inz('34962826072807151759072959071759');
  *n Char(32) inz('34962828072807141759072959071759');
  *n Char(32) inz('34962824072807141759072959071759');
  *n Char(32) inz('34962823072807141759072959071759');
  *n Char(32) inz('34962828072807131759072959071759');
  *n Char(32) inz('34962821070807131759072959071759');
  *n Char(32) inz('34962821070807121759072959071759');
  *n Char(32) inz('34962829070807111759072959071759');
  *n Char(32) inz('34962828070807111759072959071759');
  *n Char(32) inz('34962826070807111759072959071759');
  *n Char(32) inz('34962722070807181759072959071759');
  *n Char(32) inz('34962727070807141759072959071759');
  *n Char(32) inz('34962729070807121759072959071759');
  *n Char(32) inz('34962729070807111759072759071759');
  *n Char(32) inz('34962624070807191759072759071759');
  *n Char(32) inz('34962622070807191759072759071759');
  *n Char(32) inz('34962621070807191759072759071759');
  *n Char(32) inz('34962626071807181759072759071759');
  *n Char(32) inz('34962628071807171759072759071759');
  *n Char(32) inz('34962622071807171759072759071759');
  *n Char(32) inz('34962628071807161759072759071759');
  *n Char(32) inz('34962627071807161759072759071759');
  *n Char(32) inz('34962625071807161759072759071759');
  *n Char(32) inz('34962622071807141759072759071759');
  *n Char(32) inz('34962628071807121759072759071759');
  *n Char(32) inz('34962625071807111759072759071759');
  *n Char(32) inz('34962624071807111759072759071759');
  *n Char(32) inz('34962528071807181759072759071759');
  *n Char(32) inz('34962525072807171759072759071759');
  *n Char(32) inz('34962526072807151759072759071759');
  *n Char(32) inz('34962524072807151759072759071759');
  *n Char(32) inz('34962521072807151759072759071759');
  *n Char(32) inz('34962529072807141759072759071759');
  *n Char(32) inz('34962527072807141759072759071759');
  *n Char(32) inz('34962526072807121759072759071759');
  *n Char(32) inz('34962524072807121759072759071759');
  *n Char(32) inz('34962523072807121759072759071759');
  *n Char(32) inz('34962527072807111759072759071759');
  *n Char(32) inz('34962526072807101759072759071759');
  *n Char(32) inz('34962426072807191759072759071759');
  *n Char(32) inz('34962422073807191759072759071759');
  *n Char(32) inz('34962421073807191759072759071759');
  *n Char(32) inz('34962426073807181759072759071759');
  *n Char(32) inz('34962420073807181759072759071759');
  *n Char(32) inz('34962427073807171759072759071759');
  *n Char(32) inz('34962424073807171759072759071759');
  *n Char(32) inz('34962420073807151759072759071759');
  *n Char(32) inz('34962429073807141759072759071759');
  *n Char(32) inz('34962428073807141759072759071759');
  *n Char(32) inz('34962425073807141759072759071759');
  *n Char(32) inz('34962424073807141759072759071759');
  *n Char(32) inz('34962423073807141759072759071759');
  *n Char(32) inz('34962428071807131759072759071759');
  *n Char(32) inz('34962425071807121759072759071759');
  *n Char(32) inz('34962422071807121759072759071759');
  *n Char(32) inz('34962429071807101759072759071759');
  *n Char(32) inz('34962426071807101759072759071759');
  *n Char(32) inz('34962424071807101759072759071759');
  *n Char(32) inz('34962322071807191759072759071759');
  *n Char(32) inz('34962326071807171759072759071759');
  *n Char(32) inz('34962328071807161759072759071759');
  *n Char(32) inz('34962325071807161759072759071759');
  *n Char(32) inz('34962327071807141759072759071759');
  *n Char(32) inz('34962325070807141759072759071759');
  *n Char(32) inz('34962327070807121759072759071759');
  *n Char(32) inz('34962326070807121759072759071759');
  *n Char(32) inz('34962325070807121759072759071759');
  *n Char(32) inz('34962325070807111759072759071759');
  *n Char(32) inz('34962323070807111759072759071759');
  *n Char(32) inz('34962329070807101759072759071759');
  *n Char(32) inz('34962229070807181759072759071759');
  *n Char(32) inz('34962220070807191759072759071759');
  *n Char(32) inz('34962226070807181759072759071759');
  *n Char(32) inz('34962223070807181759072759071759');
  *n Char(32) inz('34962221070807171759072759071759');
  *n Char(32) inz('34962229071807161759072759071759');
  *n Char(32) inz('34962225071807161759072759071759');
  *n Char(32) inz('34962229071807151759072759071759');
  *n Char(32) inz('34962227071807131759072759071759');
  *n Char(32) inz('34962228071807121759072759071759');
  *n Char(32) inz('34962227071807121759072759071759');
  *n Char(32) inz('34962228071807111759072759071759');
  *n Char(32) inz('34962222071807111759072759071759');
  *n Char(32) inz('34962220071807101759072759071759');
  *n Char(32) inz('34962128071807191759072759071759');
  *n Char(32) inz('34962126071807191759072759071759');
  *n Char(32) inz('34962122071807181759072759071759');
  *n Char(32) inz('34962129071807171759072759071759');
  *n Char(32) inz('34962120073807141759072759071759');
  *n Char(32) inz('34962126073807131759072759071759');
  *n Char(32) inz('34962126073807111759072759071759');
  *n Char(32) inz('34962122073807101759072759071759');
  *n Char(32) inz('34962025073807191759072759071759');
  *n Char(32) inz('34962022073807181759072759071759');
  *n Char(32) inz('34962022073807171759072759071759');
  *n Char(32) inz('34962021073807151759072759071759');
  *n Char(32) inz('34962028073807141759072759071759');
  *n Char(32) inz('34962027073807141759072759071759');
  *n Char(32) inz('34962022073807141759072759071759');
  *n Char(32) inz('34962024073807131759072759071759');
  *n Char(32) inz('34962023073807131759072759071759');
  *n Char(32) inz('34962023173807121759072759071759');
  *n Char(32) inz('34962025173807101759072759071759');
  *n Char(32) inz('34962928173806181759072759071759');
  *n Char(32) inz('34962929173806171759072759071759');
  *n Char(32) inz('34962925173806161759072759071759');
  *n Char(32) inz('34962922173806161759072759071759');
  *n Char(32) inz('34962929173806151759072759071759');
  *n Char(32) inz('34962921173806151759072759071759');
  *n Char(32) inz('34962929173806131759072759071759');
  *n Char(32) inz('34962928173806131759072759071759');
  *n Char(32) inz('34962927173806111759072759071759');
  *n Char(32) inz('34962925172806101759072759071759');
  *n Char(32) inz('34962824172806191759072759071759');
  *n Char(32) inz('34962829172806181759072759071759');
  *n Char(32) inz('34962828172806181759072759071759');
  *n Char(32) inz('34962822172806181759072759071759');
  *n Char(32) inz('34962827172806171759072759071759');
  *n Char(32) inz('34962823172806161759072759071759');
  *n Char(32) inz('34962828172806141759072759071759');
  *n Char(32) inz('34962825172806141759072759071759');
  *n Char(32) inz('34962828172806121759072759071759');
  *n Char(32) inz('34962827170806121759072759071759');
  *n Char(32) inz('34962823170806121759072759071759');
  *n Char(32) inz('34962827170806111759072759071759');
  *n Char(32) inz('34962827170806101759072759071759');
  *n Char(32) inz('34962826170806101759072759071759');
  *n Char(32) inz('34962823170806101759072759071759');
  *n Char(32) inz('34962722170806191759072759071759');
  *n Char(32) inz('34962720170806191759072759071759');
  *n Char(32) inz('34962723170806161759072759071759');
  *n Char(32) inz('34962723170806131759072759071759');
  *n Char(32) inz('34962722170806121759072759071759');
  *n Char(32) inz('34962721170806121759072759071759');
  *n Char(32) inz('34962729170806111759072759071759');
  *n Char(32) inz('34962723171806111759072759071759');
  *n Char(32) inz('34962722171806111759072759071759');
  *n Char(32) inz('34962727171806101759072759071759');
  *n Char(32) inz('34962624171806191759072759071759');
  *n Char(32) inz('34962629171806181759072759071759');
  *n Char(32) inz('34962625171806181759072759071759');
  *n Char(32) inz('34962629171806171759072759071759');
  *n Char(32) inz('34962626171806151759072759071759');
  *n Char(32) inz('34962624171806121759072759071759');
  *n Char(32) inz('34962527171806181759072759071759');
  *n Char(32) inz('34962524172806181759072759071759');
  *n Char(32) inz('34962522172806181759072759071759');
  *n Char(32) inz('34962525172806171759072759071759');
  *n Char(32) inz('34962529172806161759072759071759');
  *n Char(32) inz('34962528172806151759072759071759');
  *n Char(32) inz('34962523172806151759072759071759');
  *n Char(32) inz('34962521172806151759072759071759');
  *n Char(32) inz('34962529172806141759072759071759');
  *n Char(32) inz('34962528172806141759072759071759');
  *n Char(32) inz('34962526172806141759072759071759');
  *n Char(32) inz('34962524172806141759072759071759');
  *n Char(32) inz('34962522172806141759072759071759');
  *n Char(32) inz('34962527173806131759072759071759');
  *n Char(32) inz('34962529173806121759072759071759');
  *n Char(32) inz('34962528173806121759072759071759');
  *n Char(32) inz('34962526173806121759072759071759');
  *n Char(32) inz('34962526173806101759072759071759');
  *n Char(32) inz('34962522173806101759072759071759');
  *n Char(32) inz('34962521173806101759072759071759');
  *n Char(32) inz('34962429173806181759072759071759');
  *n Char(32) inz('34962429173806171759072759071759');
  *n Char(32) inz('34962424173806171759072759071759');
  *n Char(32) inz('34962423173806171759072759071759');
  *n Char(32) inz('34962425173806131759072759071759');
  *n Char(32) inz('34962429171806111759072759071759');
  *n Char(32) inz('34962327171806191759072759071759');
  *n Char(32) inz('34962321171806191759072759071759');
  *n Char(32) inz('34962329171806181759072759071759');
  *n Char(32) inz('34962325171806191759072759071759');
  *n Char(32) inz('34962324171806171759072759071759');
  *n Char(32) inz('34962421171806151759072759071759');
  *n Char(32) inz('34962329171806121759072759071759');
  *n Char(32) inz('34962328170806121759072759071759');
  *n Char(32) inz('34962322170806121759072759071759');
  *n Char(32) inz('34962328170806101759072759071759');
  *n Char(32) inz('34962229170806191759072759071759');
  *n Char(32) inz('34962228170806191759072759071759');
  *n Char(32) inz('34962223170806191759072759071759');
  *n Char(32) inz('34962224170806161759072759071759');
  *n Char(32) inz('34962226170806151759072759071759');
  *n Char(32) inz('34962221170806151759072759071759');
  *n Char(32) inz('34962222170806141759072759071759');
  *n Char(32) inz('34962223170806131759072759071759');
  *n Char(32) inz('34962228171806121759072759071759');
  *n Char(32) inz('34962223171806121759071659071759');
  *n Char(32) inz('34962222171806121759071659071759');
  *n Char(32) inz('34962225171806111759071659071759');
  *n Char(32) inz('34962227171806101759071659071759');
  *n Char(32) inz('34962128171806191759071659071759');
  *n Char(32) inz('34962127171806191759071659071759');
  *n Char(32) inz('34962126171806191759071659071759');
  *n Char(32) inz('34962125171806191759071659071759');
  *n Char(32) inz('34962129171806181759071659071759');
  *n Char(32) inz('34962123171806181759071659071759');
  *n Char(32) inz('34962121171806181759071659071759');
  *n Char(32) inz('34962121171806151759071659071759');
  *n Char(32) inz('34962127173806141759071659071759');
  *n Char(32) inz('34962125173806131759071659071759');
  *n Char(32) inz('34962125173806121759071659071759');
  *n Char(32) inz('34962120173806121759071659071759');
  *n Char(32) inz('34962123173806111759071659071759');
  *n Char(32) inz('34962126173806101759071659071759');
  *n Char(32) inz('34962121173806101759071659071759');
  *n Char(32) inz('34962028173806191759071659071759');
  *n Char(32) inz('34962028173806181759071659071759');
  *n Char(32) inz('34962026173806151759071659071759');
  *n Char(32) inz('34962028173806141759071659071759');
  *n Char(32) inz('34962029173806131759071659071759');
  *n Char(32) inz('34962029273806111759071659071759');
  *n Char(32) inz('34962025273806111759071659071759');
  *n Char(32) inz('34962021273806101759071659071759');
  *n Char(32) inz('34962929273805151759071659071759');
  *n Char(32) inz('34962923273805151759071659071759');
  *n Char(32) inz('34962924273805131759071659071759');
  *n Char(32) inz('34962925273805121759071659071759');
  *n Char(32) inz('34962924273805121759071659071759');
  *n Char(32) inz('34962923273805121759071659071759');
  *n Char(32) inz('34962828273805171759071659071759');
  *n Char(32) inz('34962822273805131759071659071759');
  *n Char(32) inz('34962827273805121759071659071759');
  *n Char(32) inz('34962822272805121759071659071759');
  *n Char(32) inz('34962828272805101759071659071759');
  *n Char(32) inz('34962825272805101759071659071759');
  *n Char(32) inz('34962823272805101759071659071759');
  *n Char(32) inz('34962720272805191759071659071759');
  *n Char(32) inz('34962721272805181759071659071759');
  *n Char(32) inz('34962725272805171759071659071759');
  *n Char(32) inz('34962720272805171759071659071759');
  *n Char(32) inz('34962725272805161759071659071759');
  *n Char(32) inz('34962724272805161759071659071759');
  *n Char(32) inz('34962721272805161759071659071759');
  *n Char(32) inz('34962723272805131759071659071759');
  *n Char(32) inz('34962721270805131759071659071759');
  *n Char(32) inz('34962721270805121759071659071759');
  *n Char(32) inz('34962724270805111759071659071759');
  *n Char(32) inz('34962629270805191759071659071759');
  *n Char(32) inz('34962626270805181759071659071759');
  *n Char(32) inz('34962625270805181759071659071759');
  *n Char(32) inz('34962623270805181759071659071759');
  *n Char(32) inz('34962627270805161759071659071759');
  *n Char(32) inz('34962621270805161759071659071759');
  *n Char(32) inz('34962629270805151759071659071759');
  *n Char(32) inz('34962621270805151759071659071759');
  *n Char(32) inz('34962628270805141759071659071759');
  *n Char(32) inz('34962628271805131759071659071759');
  *n Char(32) inz('34962623271805131759071659071759');
  *n Char(32) inz('34962627271805121759071659071759');
  *n Char(32) inz('34962620271805121759071659071759');
  *n Char(32) inz('34962624271805111759071659071759');
  *n Char(32) inz('34962627271805101759071659071759');
  *n Char(32) inz('34962527271805191759071659071759');
  *n Char(32) inz('34962526271805191759071659071759');
  *n Char(32) inz('34962522271805171759071659071759');
  *n Char(32) inz('34962528271805151759071659071759');
  *n Char(32) inz('34962525271805151759071659071759');
  *n Char(32) inz('34962528271805121759071659071759');
  *n Char(32) inz('34962522272805121759071659071759');
  *n Char(32) inz('34962529272805111759071659071759');
  *n Char(32) inz('34962527272805111759071659071759');
  *n Char(32) inz('34962529272805101759071659071759');
  *n Char(32) inz('34962526272805101759071659071759');
  *n Char(32) inz('34962422272805191759071659071759');
  *n Char(32) inz('34962428272805171759071659071759');
  *n Char(32) inz('34962420272805171759071659071759');
  *n Char(32) inz('34962425272805161759071659071759');
  *n Char(32) inz('34962424272805161759071659071759');
  *n Char(32) inz('34962426272805151759071659071759');
  *n Char(32) inz('34962420272805151759071659071759');
  *n Char(32) inz('34962423272805131759071659071759');
  *n Char(32) inz('34962426273805121759071659071759');
  *n Char(32) inz('34962425273805121759071659071759');
  *n Char(32) inz('34962422273805121759071659071759');
  *n Char(32) inz('34962321273805181759071659071759');
  *n Char(32) inz('34962327273805171759071659071759');
  *n Char(32) inz('34962322273805171759071659071759');
  *n Char(32) inz('34962321273805171759071659071759');
  *n Char(32) inz('34962323273805151759071659071759');
  *n Char(32) inz('34962323273805131759071659071759');
  *n Char(32) inz('34962228273805131759071659071759');
  *n Char(32) inz('34962322273805121759071659071759');
  *n Char(32) inz('34962324273805111759071659071759');
  *n Char(32) inz('34962220271805191759071659071759');
  *n Char(32) inz('34962227271805161759071659071759');
  *n Char(32) inz('34962221271805161759071659071759');
  *n Char(32) inz('34962224271805151759071659071759');
  *n Char(32) inz('34962227271805141759071659071759');
  *n Char(32) inz('34962226271805141759071659071759');
  *n Char(32) inz('34962222271805131759071659071759');
  *n Char(32) inz('34962227271805101759071659071759');
  *n Char(32) inz('34962225271805101759071659071759');
  *n Char(32) inz('34962128271805191759071659071759');
  *n Char(32) inz('34962123271805181759071659071759');
  *n Char(32) inz('34962128271805171759071659071759');
  *n Char(32) inz('34962126270805171759071659071759');
  *n Char(32) inz('34962120270805171759071659071759');
  *n Char(32) inz('34962128270805161759071659071759');
  *n Char(32) inz('34962129270805141759071659071759');
  *n Char(32) inz('34962127270805141759071659071759');
  *n Char(32) inz('34962126270805141759071659071759');
  *n Char(32) inz('34962125270805141759071659071759');
  *n Char(32) inz('34962128270805131759071659071759');
  *n Char(32) inz('34962122270805111759071659071759');
  *n Char(32) inz('34962121270805111759071659071759');
  *n Char(32) inz('34962120270805101759071659071759');
  *n Char(32) inz('34962027270805151759071659071759');
  *n Char(32) inz('34962029271805141759071659071759');
  *n Char(32) inz('34962027271805141759071659071759');
  *n Char(32) inz('34962024271805131759071659071759');
  *n Char(32) inz('34962022271805121759071659071759');
  *n Char(32) inz('34962026271805111759071659071759');
  *n Char(32) inz('34962022271805101759071659071759');
  *n Char(32) inz('34962021271805101759071659071759');
  *n Char(32) inz('34962929271804191759071659071759');
  *n Char(32) inz('34962929271804171759071659071759');
  *n Char(32) inz('34962924271804171759071659071759');
  *n Char(32) inz('34962924271804151759071659071759');
  *n Char(32) inz('34962927271804141759071659071759');
  *n Char(32) inz('34962921271804131759071659071759');
  *n Char(32) inz('34962920273804131759071659071759');
  *n Char(32) inz('34962928273804121759071659071759');
  *n Char(32) inz('34962923273804121759071659071759');
  *n Char(32) inz('34962927273804111759071659071759');
  *n Char(32) inz('34962923273804111759071659071759');
  *n Char(32) inz('34962926273804101759071659071759');
  *n Char(32) inz('34962925273804101759071659071759');
  *n Char(32) inz('34962829273804181759071659071759');
  *n Char(32) inz('34962821273804181759071659071759');
  *n Char(32) inz('34962823273804171759071659071759');
  *n Char(32) inz('34962828273804161759071659071759');
  *n Char(32) inz('34962822273804161759071659071759');
  *n Char(32) inz('34962827273804151759071659071759');
  *n Char(32) inz('34962823373804141759071659071759');
  *n Char(32) inz('34962821373804131759071659071759');
  *n Char(32) inz('34962821373804101759071659071759');
  *n Char(32) inz('34962726373804191759071659071759');
  *n Char(32) inz('34962727373804161759071659071759');
  *n Char(32) inz('34962727373804141759071659071759');
  *n Char(32) inz('34962728373804131759071659071759');
  *n Char(32) inz('34962723373804131759071659071759');
  *n Char(32) inz('34962726373804121759071659071759');
  *n Char(32) inz('34962722373804101759071659071759');
  *n Char(32) inz('34962626372804191759071659071759');
  *n Char(32) inz('34962926372801141759071659071759');
  *n Char(32) inz('34962627372804131759071659071759');
  *n Char(32) inz('34962625372804131759071659071759');
  *n Char(32) inz('34962624372804131759071659071759');
  *n Char(32) inz('34962622372804131759071659071759');
  *n Char(32) inz('34962626372804111759071659071759');
  *n Char(32) inz('34962628372804101759071659071759');
  *n Char(32) inz('34962626372804101759071659071759');
  *n Char(32) inz('34962526372804181759071659071759');
  *n Char(32) inz('34962523372804181759071659071759');
  *n Char(32) inz('34962523372804151759071659071759');
  *n Char(32) inz('34962527370804141759071659071759');
  *n Char(32) inz('34962525370804141759071659071759');
  *n Char(32) inz('34962529370804131759071659071759');
  *n Char(32) inz('34962522370804131759071659071759');
  *n Char(32) inz('34962527370804121759071659071759');
  *n Char(32) inz('34962526370804101759071659071759');
  *n Char(32) inz('34962520370804101759072859071759');
  *n Char(32) inz('34962426370804191759071659071759');
  *n Char(32) inz('34962422370804191759071659071759');
  *n Char(32) inz('34962424370804181759071659071759');
  *n Char(32) inz('34962425370804161759071659071759');
  *n Char(32) inz('34962425370804151759071659071759');
  *n Char(32) inz('34962420371804141759071659071759');
  *n Char(32) inz('34962424371804111759071659071759');
  *n Char(32) inz('34962421371804111759071659071759');
  *n Char(32) inz('34962320371804191759071659071759');
  *n Char(32) inz('34962325371804181759071659071759');
  *n Char(32) inz('34962321371804181759071659071759');
  *n Char(32) inz('34962323371804161759071659071759');
  *n Char(32) inz('34962323371804141759071659071759');
  *n Char(32) inz('34962329371804131759071659071759');
  *n Char(32) inz('34962328371804131759071659071759');
  *n Char(32) inz('34962326371804131759071659071759');
  *n Char(32) inz('34962321372804121759071659071759');
  *n Char(32) inz('34962321372804101759071659071759');
  *n Char(32) inz('34962223372804191759071659071759');
  *n Char(32) inz('34962222372804191759071659071759');
  *n Char(32) inz('34962227372804171759071659071759');
  *n Char(32) inz('34962224372804171759071659071759');
  *n Char(32) inz('34962223372804161759071659071759');
  *n Char(32) inz('34962221372804161759071659071759');
  *n Char(32) inz('34962224372804151759071659071759');
  *n Char(32) inz('34962220372804151759071659071759');
  *n Char(32) inz('34962225372804131759071659071759');
  *n Char(32) inz('34962229373804101759071659071759');
  *n Char(32) inz('34962228373804101759071659071759');
  *n Char(32) inz('34962222373804101759071659071759');
  *n Char(32) inz('34962125373804191759071659071759');
  *n Char(32) inz('34962125373804181759071659071759');
  *n Char(32) inz('34962129373804141759071659071759');
  *n Char(32) inz('34962126373804121759071659071759');
  *n Char(32) inz('34962121373804111759071659071759');
  *n Char(32) inz('34962026373804191759071659071759');
  *n Char(32) inz('34962022373804191759071659071759');
  *n Char(32) inz('34962028371804161759071659071759');
  *n Char(32) inz('34962029371804151759071659071759');
  *n Char(32) inz('34962026371804141759071659071759');
  *n Char(32) inz('34962027371804121759071659071759');
  *n Char(32) inz('34962022371804111759071659071759');
  *n Char(32) inz('34962923371803171759071659071759');
  *n Char(32) inz('34962927371803151759071659071759');
  *n Char(32) inz('34962928371803121759071659071759');
  *n Char(32) inz('34962924371803121759071659071759');
  *n Char(32) inz('34962929371803111759071659071759');
  *n Char(32) inz('34962928371803111759071659071759');
  *n Char(32) inz('34962922371803111759071659071759');
  *n Char(32) inz('34962826370803171759071659071759');
  *n Char(32) inz('34962820370803171759071659071759');
  *n Char(32) inz('34962822370803161759071659071759');
  *n Char(32) inz('34962826370803151759071659071759');
  *n Char(32) inz('34962820370803151759071659071759');
  *n Char(32) inz('34962825370803141759071659071759');
  *n Char(32) inz('34962828370803121759071659071759');
  *n Char(32) inz('34962827370803121759071659071759');
  *n Char(32) inz('34962821370803121759071659071759');
  *n Char(32) inz('34962828370803111759071659071759');
  *n Char(32) inz('34962820370803101759071659071759');
  *n Char(32) inz('34962724371803191759071659071759');
  *n Char(32) inz('34962726371803181759071659071759');
  *n Char(32) inz('34962723371803181759071659071759');
  *n Char(32) inz('34962720371803171759071659071759');
  *n Char(32) inz('34962727371803161759071659071759');
  *n Char(32) inz('34962724371803161759071659071759');
  *n Char(32) inz('34962727371803151759071659071759');
  *n Char(32) inz('34962725371803151759071659071759');
  *n Char(32) inz('34962722371803151759071659071759');
  *n Char(32) inz('34962726371803141759071659071759');
  *n Char(32) inz('34962728371803131759071659071759');
  *n Char(32) inz('34962727373803121759071659071759');
  *n Char(32) inz('34962726373803111759071659071759');
  *n Char(32) inz('34962721373803111759072759071759');
  *n Char(32) inz('34962728373803101759071659071759');
  *n Char(32) inz('34962624373803191759071659071759');
  *n Char(32) inz('34962622373803191759071659071759');
  *n Char(32) inz('34962621373803181759071659071759');
  *n Char(32) inz('34962623373803171759072759071759');
  *n Char(32) inz('34962625373803161759071459071759');
  *n Char(32) inz('34962628373803151759071459071759');
  *n Char(32) inz('34962626373803151759071459071759');
  *n Char(32) inz('34962626373803141759071459071759');
  *n Char(32) inz('34962631373803131759071459071759');
  *n Char(32) inz('34962635373803121759071459071759');
  *n Char(32) inz('34962639373803101759071459071759');
  *n Char(32) inz('34962636373803101759071459071759');
  *n Char(32) inz('34962634373803101759071459071759');
  *n Char(32) inz('34962539373803191759071459071759');
  *n Char(32) inz('34962532373803191759071459071759');
  *n Char(32) inz('34962531373803181759071459071759');
  *n Char(32) inz('34962539373803171759071459071759');
  *n Char(32) inz('34962535373803171759071459071759');
  *n Char(32) inz('34962534372803171759071459071759');
  *n Char(32) inz('34962536372803161759071459071759');
  *n Char(32) inz('34962534372803161759071459071759');
  *n Char(32) inz('34962533372803161759071459071759');
  *n Char(32) inz('34962538372803151759071459071759');
  *n Char(32) inz('34962536372803151759071459071759');
  *n Char(32) inz('34962533372803151759071459071759');
  *n Char(32) inz('34962537372803141759071459071759');
  *n Char(32) inz('34962532370803141759071459071759');
  *n Char(32) inz('34962535370803121759071459071759');
  *n Char(32) inz('34962534370803111759071459071759');
  *n Char(32) inz('34962533370803111759071459071759');
  *n Char(32) inz('34962435370803191759071459071759');
  *n Char(32) inz('34962432370803191759071459071759');
  *n Char(32) inz('34962437370803181759071459071759');
  *n Char(32) inz('34962434370803181759071459071759');
  *n Char(32) inz('34962431371803171759071459071759');
  *n Char(32) inz('34962433371803161759071459071759');
  *n Char(32) inz('34962433371803151759071459071759');
  *n Char(32) inz('34962432371803151759071459071759');
  *n Char(32) inz('34962437371803141759071459071759');
  *n Char(32) inz('34962439371803121759071459071759');
  *n Char(32) inz('34962436371803121759071459071759');
  *n Char(32) inz('34962431371803121759071459071759');
  *n Char(32) inz('34962438371803111759071459071759');
  *n Char(32) inz('34962436372803101759071459071759');
  *n Char(32) inz('34962430372803101759071459071759');
  *n Char(32) inz('34962337372803191759071459071759');
  *n Char(32) inz('34962332372803191759071459071759');
  *n Char(32) inz('34962331372803191759071459071759');
  *n Char(32) inz('34962334372803181759071459071759');
  *n Char(32) inz('34962337372803171759071459071759');
  *n Char(32) inz('34962330372803161759071459071759');
  *n Char(32) inz('34962335373803151759071459071759');
  *n Char(32) inz('34962338373803141759071459071759');
  *n Char(32) inz('34962336373803141759071459071759');
  *n Char(32) inz('34962334373803141759071459071759');
  *n Char(32) inz('34962333373803131759071459071759');
  *n Char(32) inz('34962332373803121759071459071759');
  *n Char(32) inz('34962332373803111759071459071759');
  *n Char(32) inz('34962334373803101759071459071759');
  *n Char(32) inz('34962333371803101759071459071759');
  *n Char(32) inz('34962239371803191759071459071759');
  *n Char(32) inz('34962232371803171759071459071759');
  *n Char(32) inz('34962233371803161759071459071759');
  *n Char(32) inz('34962237371803151759071459071759');
  *n Char(32) inz('34962232371803141759071459071759');
  *n Char(32) inz('34962233371803131759071459071759');
  *n Char(32) inz('34962233371803121759071459071759');
  *n Char(32) inz('34962234371803101759071459071759');
  *n Char(32) inz('34962231371803101759071459071759');
  *n Char(32) inz('34962135370803171759071459071759');
  *n Char(32) inz('34962131370803171759071459071759');
  *n Char(32) inz('34962139370803151759071459071759');
  *n Char(32) inz('34962135370803151759071459071759');
  *n Char(32) inz('34962136370803141759071359071759');
  *n Char(32) inz('34962136370803131759071359071759');
  *n Char(32) inz('34962137370803131759071359071759');
  *n Char(32) inz('34962136370803121759071359071759');
  *n Char(32) inz('34962135371803121759071359071759');
  *n Char(32) inz('34962132371803121759071359071759');
  *n Char(32) inz('34962139371803101759071359071759');
  *n Char(32) inz('34962134371803101759071359071759');
  *n Char(32) inz('34962133371803101759071359071759');
  *n Char(32) inz('34962130371803101759071359071759');
  *n Char(32) inz('34962039371803181759071359071759');
  *n Char(32) inz('34962035371803171759071359071759');
  *n Char(32) inz('34962032371803171759071359071759');
  *n Char(32) inz('34962031373803171759071359071759');
  *n Char(32) inz('34962038373803151759071359071759');
  *n Char(32) inz('34962034373803151759071359071759');
  *n Char(32) inz('34962039373803141759071359071759');
  *n Char(32) inz('34962038373803141759071359071759');
  *n Char(32) inz('34962032373803131759071559071759');
  *n Char(32) inz('34962038373803121759071359071759');
  *n Char(32) inz('34962037373803121759071359071759');
  *n Char(32) inz('34962033373803121759071359071759');
  *n Char(32) inz('34962031373803121759071359071759');
  *n Char(32) inz('34962031373803101759071359071759');
  *n Char(32) inz('34962934273802191759071359071759');
  *n Char(32) inz('34962938273802181759071359071759');
  *n Char(32) inz('34962933273802181759071359071759');
  *n Char(32) inz('34962936273802171759071359071759');
  *n Char(32) inz('34962931273802161759071359071759');
  *n Char(32) inz('34962938273802151759071359071759');
  *n Char(32) inz('34962931273802151759071359071759');
  *n Char(32) inz('34962932273802131759071359071759');
  *n Char(32) inz('34962939273802121759071359071759');
  *n Char(32) inz('34962939273802111759071359071759');
  *n Char(32) inz('34962938273802111759071359071759');
  *n Char(32) inz('34962935272802111759071359071759');
  *n Char(32) inz('34962930272802111759071359071759');
  *n Char(32) inz('34962939272802101759071359071759');
  *n Char(32) inz('34962930272802101759071359071759');
  *n Char(32) inz('34962839272802181759071359071759');
  *n Char(32) inz('34962831272802181759071359071759');
  *n Char(32) inz('34962830272802181759071359071759');
  *n Char(32) inz('34962830272802161759071359071759');
  *n Char(32) inz('34962830272802151759071359071759');
  *n Char(32) inz('34962831272802141759071359071759');
  *n Char(32) inz('34962839272802131759071359071759');
  *n Char(32) inz('34962839272802121759071359071759');
  *n Char(32) inz('34962835270802121759071359071759');
  *n Char(32) inz('34962839270802111759071359071759');
  *n Char(32) inz('34962737270802191759071359071759');
  *n Char(32) inz('34962733270802181759071359071759');
  *n Char(32) inz('34962732270802151759071359071759');
  *n Char(32) inz('34962731270802141759071359071759');
  *n Char(32) inz('34962739270802131759071359071759');
  *n Char(32) inz('34962735270802131759071359071759');
  *n Char(32) inz('34962732270802101759071359071759');
  *n Char(32) inz('34962634270802191759071359071759');
  *n Char(32) inz('34962630270802181759071359071759');
  *n Char(32) inz('34962635271802171759071359071759');
  *n Char(32) inz('34962638271802161759071359071759');
  *n Char(32) inz('34962635271802161759071359071759');
  *n Char(32) inz('34962630271802161759071359071759');
  *n Char(32) inz('34962635271802111759071359071759');
  *n Char(32) inz('34962634271802101759071359071759');
  *n Char(32) inz('34962533271802191759071359071759');
  *n Char(32) inz('34962639271802151759071359071759');
  *n Char(32) inz('34962539271802161759071359071759');
  *n Char(32) inz('34962430271802151759071359071759');
  *n Char(32) inz('34962439271802141759071359071759');
  *n Char(32) inz('34962436271802141759071359071759');
  *n Char(32) inz('34962433272802141759071359071759');
  *n Char(32) inz('34962432272802131759071359071759');
  *n Char(32) inz('34962334272802191759071359071759');
  *n Char(32) inz('34962332272802191759071359071759');
  *n Char(32) inz('34962337272802181759071359071759');
  *n Char(32) inz('34962331272802161759071359071759');
  *n Char(32) inz('34962336272802151759071359071759');
  *n Char(32) inz('34962333272802151759071359071759');
  *n Char(32) inz('34962336272802141759071359071759');
  *n Char(32) inz('34962338272802121759071359071759');
  *n Char(32) inz('34962337273802111759071359071759');
  *n Char(32) inz('34962336273802101759071359071759');
  *n Char(32) inz('34962333273802101759071359071759');
  *n Char(32) inz('34962235273802191759071359071759');
  *n Char(32) inz('34962238273802171759071359071759');
  *n Char(32) inz('34962239273802161759071359071759');
  *n Char(32) inz('34962236273802161759071359071759');
  *n Char(32) inz('34962236273802141759071359071759');
  *n Char(32) inz('34962235273802131759071359071759');
  *n Char(32) inz('34962233273802111759071359071759');
  *n Char(32) inz('34962232273802111759071359071759');
  *n Char(32) inz('34962234271802101759071359071759');
  *n Char(32) inz('34962233271802101759071359071759');
  *n Char(32) inz('34962231271802101759071359071759');
  *n Char(32) inz('34962139271802191759071359071759');
  *n Char(32) inz('34962134271802191759071359071759');
  *n Char(32) inz('34962134271802181759071359071759');
  *n Char(32) inz('34962134271802171759071359071759');
  *n Char(32) inz('34962135271802161759071359071759');
  *n Char(32) inz('34962134271802161759071359071759');
  *n Char(32) inz('34962138271802151759071359071759');
  *n Char(32) inz('34962136271802151759071359071759');
  *n Char(32) inz('34962136271802141759071359071759');
  *n Char(32) inz('34962134270802131759071359071759');
  *n Char(32) inz('34962131270802131759071359071759');
  *n Char(32) inz('34962135270802121759071359071759');
  *n Char(32) inz('34962136270802111759071359071759');
  *n Char(32) inz('34962033270802191759071359071759');
  *n Char(32) inz('34962038270802181759071359071759');
  *n Char(32) inz('34962037270802181759071359071759');
  *n Char(32) inz('34962034270802181759071359071759');
  *n Char(32) inz('34962032270802171759071359071759');
  *n Char(32) inz('34962039270802131759071359071759');
  *n Char(32) inz('34962037270802131759071359071759');
  *n Char(32) inz('34962036271802131759071359071759');
  *n Char(32) inz('34962930271801191759071359071759');
  *n Char(32) inz('34962933271801161759071359071759');
  *n Char(32) inz('34962938271801151759071359071759');
  *n Char(32) inz('34962934271801151759071359071759');
  *n Char(32) inz('34962936271801131759071359071759');
  *n Char(32) inz('34962932271801131759071359071759');
  *n Char(32) inz('34962936271801121759071359071759');
  *n Char(32) inz('34962932271801121759071359071759');
  *n Char(32) inz('34962835271801191759071359071759');
  *n Char(32) inz('34962832271801171759071359071759');
  *n Char(32) inz('34962839273801151759071359071759');
  *n Char(32) inz('34962834273801141759071359071759');
  *n Char(32) inz('34962834273801131759071359071759');
  *n Char(32) inz('34962836273801101759071359071759');
  *n Char(32) inz('34962833273801101759071359071759');
  *n Char(32) inz('34962830273801101759071359071759');
  *n Char(32) inz('34962735273801191759071359071759');
  *n Char(32) inz('34962738273801181759071359071759');
  *n Char(32) inz('34962735273801161759071359071759');
  *n Char(32) inz('34962735273801151759071359071759');
  *n Char(32) inz('34962736273801141759071359071759');
  *n Char(32) inz('34962733273801141759071359071759');
  *n Char(32) inz('34962739073801121759071359071759');
  *n Char(32) inz('34962732073801101759071359071759');
  *n Char(32) inz('34962633073801181759071359071759');
  *n Char(32) inz('34962635073801171759071359071759');
  *n Char(32) inz('34962630073801171759071359071759');
  *n Char(32) inz('34962639073801151759071359071759');
  *n Char(32) inz('34962638073801131759071359071759');
  *n Char(32) inz('34962631073801131759071359071759');
  *n Char(32) inz('34962639073801111759071359071759');
  *n Char(32) inz('34962631073801111759071359071759');
  *n Char(32) inz('34962630073801111759071359071759');
  *n Char(32) inz('34962639072801101759071359071759');
  *n Char(32) inz('34962538072801171759071359071759');
  *n Char(32) inz('34962535072801161759071359071759');
  *n Char(32) inz('34962532072801141759071359071759');
  *n Char(32) inz('34962530072801131759071359071759');
  *n Char(32) inz('34962535072801111759071359071759');
  *n Char(32) inz('34962534072801101759071359071759');
  *n Char(32) inz('34962435072801191759071359071759');
  *n Char(32) inz('34962439072801181759071359071759');
  *n Char(32) inz('34962433072801171759071359071759');
  *n Char(32) inz('34962435072801161759071359071759');
  *n Char(32) inz('34962430070801161759071359071759');
  *n Char(32) inz('34962434070801151759071359071759');
  *n Char(32) inz('34962436070801131759071359071759');
  *n Char(32) inz('34962434070801131759071359071759');
  *n Char(32) inz('34962435070801121759071359071759');
  *n Char(32) inz('34962438070801101759071359071759');
  *n Char(32) inz('34962435070801101759071359071759');
  *n Char(32) inz('34962338070801191759071359071759');
  *n Char(32) inz('34962337070801191759071359071759');
  *n Char(32) inz('34962334070801191759071359071759');
  *n Char(32) inz('34962336071801161759071359071759');
  *n Char(32) inz('34962332071801161759071359071759');
  *n Char(32) inz('34962339071801141759071359071759');
  *n Char(32) inz('34962338071801141759071359071759');
  *n Char(32) inz('34962330071801141759071359071759');
  *n Char(32) inz('34962336071801121759071359071759');
  *n Char(32) inz('34962334071801121759071359071759');
  *n Char(32) inz('34962338071801111759071359071759');
  *n Char(32) inz('34962332071801111759071359071759');
  *n Char(32) inz('34962231071801191759071359071759');
  *n Char(32) inz('34962237071801181759071359071759');
  *n Char(32) inz('34962235071801181759071359071759');
  *n Char(32) inz('34962239072801171759071359071759');
  *n Char(32) inz('34962236072801161759071359071759');
  *n Char(32) inz('34962232072801161759071359071759');
  *n Char(32) inz('34962230072801151759071359071759');
  *n Char(32) inz('34962239072801141759071359071759');
  *n Char(32) inz('34962230072801141759071359071759');
  *n Char(32) inz('34962233072801131759071359071759');
  *n Char(32) inz('34962230072801131759071359071759');
  *n Char(32) inz('34962239072801121759071359071759');
  *n Char(32) inz('34962237072801121759071359071759');
  *n Char(32) inz('34962239072801111759071359071759');
  *n Char(32) inz('34962231073801111759071359071759');
  *n Char(32) inz('34962236073801101759071359071759');
  *n Char(32) inz('34962235073801101759071359071759');
  *n Char(32) inz('34962132073801181759071359071759');
  *n Char(32) inz('34962136073801171759071359071759');
  *n Char(32) inz('34962135073801171759071359071759');
  *n Char(32) inz('34962130073801171759071359071759');
  *n Char(32) inz('34962137073801151759071359071759');
  *n Char(32) inz('34962136073801151759071359071759');
  *n Char(32) inz('34962130073801151759071359071759');
  *n Char(32) inz('34962135073801111759071359071759');
  *n Char(32) inz('34962130071801111759071359071759');
  *n Char(32) inz('34962134071801101759071359071759');
  *n Char(32) inz('34962033071801181759071359071759');
  *n Char(32) inz('34962038071801171759071359071759');
  *n Char(32) inz('34962034071801171759071359071759');
  *n Char(32) inz('34962035071801161759071359071759');
  *n Char(32) inz('34962038071801131759071359071759');
  *n Char(32) inz('34962036071801131759071359071759');
  *n Char(32) inz('34962030071801131759071359071759');
  *n Char(32) inz('34962035071801121759071359071759');
  *n Char(32) inz('34962038071801111759071359071759');
  *n Char(32) inz('34962035070801111759071359071759');
  *n Char(32) inz('34962030070801111759071359071759');
  *n Char(32) inz('34962038070801101759071359071759');
  *n Char(32) inz('34962037070801101759071359071759');
  *n Char(32) inz('34962032070801101759071359071759');
  *n Char(32) inz('34962937070800191759071359071759');
  *n Char(32) inz('34962935070800191759071359071759');
  *n Char(32) inz('34962932070800191759071359071759');
  *n Char(32) inz('34962937070800111759071359071759');
  *n Char(32) inz('34962937070800101759071359071759');
  *n Char(32) inz('34962934070800101759071359071759');
  *n Char(32) inz('34962836070800191759071359071759');
  *n Char(32) inz('34962834071800191759071359071759');
  *n Char(32) inz('34962836071800181759071359071759');
  *n Char(32) inz('34962833071800181759071359071759');
  *n Char(32) inz('34962836071800171759071359071759');
  *n Char(32) inz('34962834071800171759071359071759');
  *n Char(32) inz('34962833071800171759071359071759');
  *n Char(32) inz('34962830071800151759071359071759');
  *n Char(32) inz('34962833071800121759071359071759');
  *n Char(32) inz('34962832071800121759071359071759');
  *n Char(32) inz('34962836071800101759071359071759');
  *n Char(32) inz('34962734073800181759071359071759');
  *n Char(32) inz('34962732073800171759071359071759');
  *n Char(32) inz('34962735073800151759071359071759');
  *n Char(32) inz('34962737073800141759071359071759');
  *n Char(32) inz('34962736073800141759071359071759');
  *n Char(32) inz('34962735073800131759071359071759');
  *n Char(32) inz('34962735073800121759071359071759');
  *n Char(32) inz('34962633073800191759071359071759');
  *n Char(32) inz('34962634073800181759071359071759');
  *n Char(32) inz('34962637073800171759071359071759');
  *n Char(32) inz('34962635073800151759071359071759');
  *n Char(32) inz('34962630073800151759071359071759');
  *n Char(32) inz('34962639173800141759071359071759');
  *n Char(32) inz('34962639173800131759071359071759');
  *n Char(32) inz('34962634173800131759071359071759');
  *n Char(32) inz('34962631173800131759071359071759');
  *n Char(32) inz('34962638173800111759071359071759');
  *n Char(32) inz('34962533173800191759071359071759');
  *n Char(32) inz('34962531173800171759071359071759');
  *n Char(32) inz('34962535173800151759071359071759');
  *n Char(32) inz('34962534173800151759071359071759');
  *n Char(32) inz('34962539173800141759071359071759');
  *n Char(32) inz('34962538173800121759071359071759');
  *n Char(32) inz('34962534173800121759071359071759');
  *n Char(32) inz('34962530172800111759071359071759');
  *n Char(32) inz('34962534172800101759071359071759');
  *n Char(32) inz('34962533172800101759071359071759');
  *n Char(32) inz('34962435172800191759071359071759');
  *n Char(32) inz('34962433172800181759071359071759');
  *n Char(32) inz('34962431172800171759071359071759');
  *n Char(32) inz('34962435172800161759071359071759');
  *n Char(32) inz('34962434172800151759071359071759');
  *n Char(32) inz('34962038172803161759071359071759');
  *n Char(32) inz('34962438172803131759071359071759');
  *n Char(32) inz('34962239172802191759071359071759');
  *n Char(32) inz('34972031172800111759071359071759');
  *n Char(32) inz('34962633170803101759071359071759');
  *n Char(32) inz('34962036170808131759071359071759');
  *n Char(32) inz('34962935170804161759071359071759');
  *n Char(32) inz('34962632170804171759071359071759');
  *n Char(32) inz('34962134170809111759071359071759');
  *n Char(32) inz('34962637170807151759071359071759');
  *n Char(32) inz('34962432170807171759071359071759');
  *n Char(32) inz('34962231170807111759071359071759');
  *n Char(32) inz('34962634170801191759071359071759');
  *n Char(32) inz('34962831170800111759071359071759');
  *n Char(32) inz('34962138170802141759071359071759');
  *n Char(32) inz('34962830171804141759071359071759');
  *n Char(32) inz('34972231171800181759071359071759');
  *n Char(32) inz('34962936171806111759071359071759');
  *n Char(32) inz('34962730171806141759071359071759');
  *n Char(32) inz('34962232171807121759071359071759');
  *n Char(32) inz('34962830171806191759071359071759');
  *n Char(32) inz('34962330171809181759071359071759');
  *n Char(32) inz('34962136171809131759071359071759');
  *n Char(32) inz('34962231171806101759072759071759');
  *n Char(32) inz('34962534171803131759071359071759');
  *n Char(32) inz('34962235170809121759071359071759');
  *n Char(32) inz('34962433170809101759071359071759');
  *n Char(32) inz('34962339170809101759071359071759');
  *n Char(32) inz('34962234170809151759071359071759');
  *n Char(32) inz('34962239170809111759071359071759');
  *n Char(32) inz('34962232170809101759071359071759');
  *n Char(32) inz('34962536170808161759071359071759');
  *n Char(32) inz('34962439170808111759071359071759');
  *n Char(32) inz('34962034170808111759071359071759');
  *n Char(32) inz('34962934170807191759071359071759');
  *n Char(32) inz('34962733170807101759071359071759');
  *n Char(32) inz('34962635170807131759071359071759');
  *n Char(32) inz('34962339171807111759071359071759');
  *n Char(32) inz('34962433171806101759071359071759');
  *n Char(32) inz('34962530171804161759071359071759');
  *n Char(32) inz('34962437171804181759071359071759');
  *n Char(32) inz('34962837171803111759071359071759');
  *n Char(32) inz('34962038171803181759071359071759');
  *n Char(32) inz('34962935171802181759071359071759');
  *n Char(32) inz('34962531171801111759071359071759');
  *n Char(32) inz('34962436171801101759071359071759');
  *n Char(32) inz('34962936171807171759071359071759');
  *n Char(32) inz('34962537171804151759071359071759');
  *n Char(32) inz('34962732171808101759071359071759');
  *n Char(32) inz('34962733173807111759071359071759');
  *n Char(32) inz('34962531173807191759071359071759');
  *n Char(32) inz('34962035173807111759071359071759');
  *n Char(32) inz('34962934173806151759071359071759');
  *n Char(32) inz('34962837173804131759071359071759');
  *n Char(32) inz('34962235173803111759071359071759');
  *n Char(32) inz('34972431173800151759071359071759');
  *n Char(32) inz('34972333173800181759071359071759');
  *n Char(32) inz('34972330173800141759071359071759');
  *n Char(32) inz('34972335173800131759071359071759');
  *n Char(32) inz('34972334173800131759071359071759');
  *n Char(32) inz('34972334273800121759071359071759');
  *n Char(32) inz('34972335273800111759071359071759');
  *n Char(32) inz('34972233273800191759071359071759');
  *n Char(32) inz('34972239273800171759071359071759');
  *n Char(32) inz('34972134273800181759071359071759');
  *n Char(32) inz('34972033273800181759071359071759');
  *n Char(32) inz('34972039273800151759071359071759');
  *n Char(32) inz('34972036273800131759071359071759');
  *n Char(32) inz('34972035273800101759071359071759');
  *n Char(32) inz('34972030273800101759071359071759');
  *n Char(32) inz('34962936273809171759071359071759');
  *n Char(32) inz('34962932273809161759071359071759');
  *n Char(32) inz('34962938272809101759071359071759');
  *n Char(32) inz('34962831272809191759071359071759');
  *n Char(32) inz('34962832272809161759071359071759');
  *n Char(32) inz('34962838272809151759071359071759');
  *n Char(32) inz('34962736272809161759071359071759');
  *n Char(32) inz('34962730272809131759071359071759');
  *n Char(32) inz('34962733272809101759071359071759');
  *n Char(32) inz('34962632272809171759071359071759');
  *n Char(32) inz('34962639272809161759071359071759');
  *n Char(32) inz('34962535272809161759071359071759');
  *n Char(32) inz('34962533272809161759071359071759');
  *n Char(32) inz('34962531272809161759071359071759');
  *n Char(32) inz('34962536270809111759071359071759');
  *n Char(32) inz('34962438270809161759071359071759');
  *n Char(32) inz('34962435270809131759071359071759');
  *n Char(32) inz('34962332270809191759071359071759');
  *n Char(32) inz('34962330270809191759071359071759');
  *n Char(32) inz('34962333270809151759071359071759');
  *n Char(32) inz('34962331270809131759071359071759');
  *n Char(32) inz('34962336270809111759071359071759');
  *n Char(32) inz('34962237270809131759071359071759');
  *n Char(32) inz('34962230270809101759071359071759');
  *n Char(32) inz('34962139270809191759071359071759');
  *n Char(32) inz('34962137271809181759071359071759');
  *n Char(32) inz('34962130271809111759071359071759');
  *n Char(32) inz('34962139271809101759071359071759');
  *n Char(32) inz('34962033271809161759071359071759');
  *n Char(32) inz('34962932271808191759071359071759');
  *n Char(32) inz('34962737271808181759071359071759');
  *n Char(32) inz('34962737271808101759071359071759');
  *n Char(32) inz('34962639271808161759071359071759');
  *n Char(32) inz('34962637271808121759071359071759');
  *n Char(32) inz('34962631271808121759071359071759');
  *n Char(32) inz('34962630271808121759071359071759');
  *n Char(32) inz('34962537271808161759071359071759');
  *n Char(32) inz('34962535272808121759071359071759');
  *n Char(32) inz('34962436272808181759071359071759');
  *n Char(32) inz('34962431272808151759071359071759');
  *n Char(32) inz('34962439272808121759071359071759');
  *n Char(32) inz('34962430272808111759071359071759');
  *n Char(32) inz('34962333272808181759071359071759');
  *n Char(32) inz('34962238272808121759071359071759');
  *n Char(32) inz('34962134272808161759071359071759');
  *n Char(32) inz('34962139272808151759071359071759');
  *n Char(32) inz('34962136272808141759071359071759');
  *n Char(32) inz('34962133272808121759071359071759');
  *n Char(32) inz('34962136273808101759071359071759');
  *n Char(32) inz('34962033273808161759071359071759');
  *n Char(32) inz('34962031273808121759071359071759');
  *n Char(32) inz('34962035273808111759071359071759');
  *n Char(32) inz('34962037273808101759071359071759');
  *n Char(32) inz('34962937273807121759071359071759');
  *n Char(32) inz('34962833273807191759071359071759');
  *n Char(32) inz('34962837273807141759071359071759');
  *n Char(32) inz('34962733273807151759071359071759');
  *n Char(32) inz('34962736273807131759071359071759');
  *n Char(32) inz('34962737273807121759071359071759');
  *n Char(32) inz('34962736271807111759071359071759');
  *n Char(32) inz('34962634271807181759071359071759');
  *n Char(32) inz('34962635271807121759071359071759');
  *n Char(32) inz('34962637271807111759071359071759');
  *n Char(32) inz('34962631271807111759071359071759');
  *n Char(32) inz('34962631271807101759071359071759');
  *n Char(32) inz('34962537271807181759071359071759');
  *n Char(32) inz('34962534271807171759071359071759');
  *n Char(32) inz('34962539271807111759071359071759');
  *n Char(32) inz('34962435271807191759071359071759');
  *n Char(32) inz('34962437271807151759071359071759');
  *n Char(32) inz('34962436271807151759071359071759');
  *n Char(32) inz('34962430270807141759071359071759');
  *n Char(32) inz('34962430270807121759071359071759');
  *n Char(32) inz('34962333270807131759071359071759');
  *n Char(32) inz('34962332270807111759071359071759');
  *n Char(32) inz('34962333270807101759071359071759');
  *n Char(32) inz('34962230270807161759071359071759');
  *n Char(32) inz('34962239270807131759071359071759');
  *n Char(32) inz('34962239270807121759071359071759');
  *n Char(32) inz('34962230270807121759071359071759');
  *n Char(32) inz('34962234270807101759071359071759');
  *n Char(32) inz('34962132270807191759071359071759');
  *n Char(32) inz('34962130271807151759071359071759');
  *n Char(32) inz('34962135271807101759071359071759');
  *n Char(32) inz('34962031271807191759071359071759');
  *n Char(32) inz('34962036271807111759071359071759');
  *n Char(32) inz('34962034271807111759071359071759');
  *n Char(32) inz('34962937271806151759071359071759');
  *n Char(32) inz('34962836271806191759071359071759');
  *n Char(32) inz('34962834271806141759071359071759');
  *n Char(32) inz('34962836271806111759071359071759');
  *n Char(32) inz('34962731271806171759071359071759');
  *n Char(32) inz('34962739271806101759071359071759');
  *n Char(32) inz('34962730271806101759071359071759');
  *n Char(32) inz('34962631273806131759071359071759');
  *n Char(32) inz('34962533273806181759071359071759');
  *n Char(32) inz('34962538273806171759071359071759');
  *n Char(32) inz('34962534273806161759071359071759');
  *n Char(32) inz('34962534273806151759071359071759');
  *n Char(32) inz('34962537273806141759071359071759');
  *n Char(32) inz('34962430273806181759071359071759');
  *n Char(32) inz('34962436273806111759071359071759');
  *n Char(32) inz('34962333273806131759071359071759');
  *n Char(32) inz('34962235273806161759071359071759');
  *n Char(32) inz('34962230273806111759071359071759');
  *n Char(32) inz('34962137373806171759071359071759');
  *n Char(32) inz('34962136373806131759071359071759');
  *n Char(32) inz('34962136373806121759071359071759');
  *n Char(32) inz('34962034373806131759071359071759');
  *n Char(32) inz('34962934373805191759071359071759');
  *n Char(32) inz('34962932373805151759071359071759');
  *n Char(32) inz('34962935373805131759071359071759');
  *n Char(32) inz('34962839373805181759071359071759');
  *n Char(32) inz('34962836373805171759071359071759');
  *n Char(32) inz('34962837373805111759071359071759');
  *n Char(32) inz('34962738373805141759071359071759');
  *n Char(32) inz('34962636373805191759071359071759');
  *n Char(32) inz('34962634372805151759071359071759');
  *n Char(32) inz('34962636372805111759071359071759');
  *n Char(32) inz('34962539372805131759071359071759');
  *n Char(32) inz('34962535372805111759071359071759');
  *n Char(32) inz('34962439372805141759071359071759');
  *n Char(32) inz('34962433372805141759071359071759');
  *n Char(32) inz('34962435372805131759071359071759');
  *n Char(32) inz('34962339372805161759071359071759');
  *n Char(32) inz('34962330372805151759071359071759');
  *n Char(32) inz('34962238372805191759071359071759');
  *n Char(32) inz('34962230372805131759071359071759');
  *n Char(32) inz('34962131372805161759071359071759');
  *n Char(32) inz('34962133370805141759071359071759');
  *n Char(32) inz('34962036370805191759071359071759');
  *n Char(32) inz('34962032370805191759071359071759');
  *n Char(32) inz('34962035370805151759071359071759');
  *n Char(32) inz('34962039370805131759071359071759');
  *n Char(32) inz('34962931370804191759071359071759');
  *n Char(32) inz('34962939370804121759071359071759');
  *n Char(32) inz('34962932370804111759071359071759');
  *n Char(32) inz('34962930370804101759071359071759');
  *n Char(32) inz('34962837370804181759071359071759');
  *n Char(32) inz('34962832370804181759071359071759');
  *n Char(32) inz('34962738370804151759071359071759');
  *n Char(32) inz('34962736371804141759071359071759');
  *n Char(32) inz('34962735371804141759071359071759');
  *n Char(32) inz('34962730371804111759071359071759');
  *n Char(32) inz('34962631371804141759071359071759');
  *n Char(32) inz('34962630371804131759071359071759');
  *n Char(32) inz('34962431371804131759071359071759');
  *n Char(32) inz('34962433371804121759071359071759');
  *n Char(32) inz('34962433371804111759071359071759');
  *n Char(32) inz('34962333371804151759071359071759');
  *n Char(32) inz('34962337371804141759071359071759');
  *n Char(32) inz('34962330371804131759071359071759');
  *n Char(32) inz('34962338371804111759071359071759');
  *n Char(32) inz('34962234372804191759071359071759');
  *n Char(32) inz('34962230372804181759071359071759');
  *n Char(32) inz('34962230372804121759071359071759');
  *n Char(32) inz('34962131372804181759071359071759');
  *n Char(32) inz('34962131372804171759071359071759');
  *n Char(32) inz('34962139372804131759071359071759');
  *n Char(32) inz('34962133372804131759071359071759');
  *n Char(32) inz('34962132372804121759071359071759');
  *n Char(32) inz('34962033372804131759071359071759');
  *n Char(32) inz('34962938372803131759071359071759');
  *n Char(32) inz('34962938372803101759071359071759');
  *n Char(32) inz('34962937372803101759071359071759');
  *n Char(32) inz('34962830373803181759071359071759');
  *n Char(32) inz('34962837373803151759071359071759');
  *n Char(32) inz('34962735373803161759071359071759');
  *n Char(32) inz('34962730373803151759071359071759');
  *n Char(32) inz('34962735373803121759071359071759');
  *n Char(32) inz('34962630373803111759071359071759');
  *n Char(32) inz('34962536373803191759071359071759');
  *n Char(32) inz('34962531373803101759071359071759');
  *n Char(32) inz('34962438373803171759071359071759');
  *n Char(32) inz('34962433373803171759071359071759');
  *n Char(32) inz('34962436373803141759071359071759');
  *n Char(32) inz('34962439371803131759071359071759');
  *n Char(32) inz('34962433371803111759071359071759');
  *n Char(32) inz('34962335371803181759071359071759');
  *n Char(32) inz('34962330371803181759071359071759');
  *n Char(32) inz('34962337371803151759071359071759');
  *n Char(32) inz('34962333371803151759071359071759');
  *n Char(32) inz('34962338371803131759071359071759');
  *n Char(32) inz('34962335371803121759071359071759');
  *n Char(32) inz('34962233371803171759071359071759');
  *n Char(32) inz('34962235371803151759071359071759');
  *n Char(32) inz('34962231371803121759071359071759');
  *n Char(32) inz('34962230371803121759071359071759');
  *n Char(32) inz('34962130370803161759071359071759');
  *n Char(32) inz('34962038370803191759071359071759');
  *n Char(32) inz('34962032370803161759071359071759');
  *n Char(32) inz('34962031370803151759071359071759');
  *n Char(32) inz('34962034370803141759071359071759');
  *n Char(32) inz('34962039370803121759071359071759');
  *n Char(32) inz('34962032370803111759071359071759');
  *n Char(32) inz('34962038370803101759071359071759');
  *n Char(32) inz('34962936370802191759071359071759');
  *n Char(32) inz('34962939370802161759071359071759');
  *n Char(32) inz('34962931370802131759071359071759');
  *n Char(32) inz('34962936371802121759071359071759');
  *n Char(32) inz('34962831371802191759071359071759');
  *n Char(32) inz('34962837371802141759071359071759');
  *n Char(32) inz('34962838371802131759071359071759');
  *n Char(32) inz('34962738371802191759071359071759');
  *n Char(32) inz('34962731371802191759071359071759');
  *n Char(32) inz('34962736371802161759071359071759');
  *n Char(32) inz('34962637371802161759071359071759');
  *n Char(32) inz('34962631371802121759071359071759');
  *n Char(32) inz('34962637371802111759071359071759');
  *n Char(32) inz('34962537371802181759071359071759');
  *n Char(32) inz('34962534371802151759071359071759');
  *n Char(32) inz('34962534373802131759071359071759');
  *n Char(32) inz('34962431373802131759071359071759');
  *n Char(32) inz('34962430373802131759071359071759');
  *n Char(32) inz('34962439373802121759071359071759');
  *n Char(32) inz('34962338373802191759071359071759');
  *n Char(32) inz('34962239373802121759071359071759');
  *n Char(32) inz('34962237373802111759071359071759');
  *n Char(32) inz('34962234373802111759071359071759');
  *n Char(32) inz('34962135373802171759071359071759');
  *n Char(32) inz('34962131373802161759071359071759');
  *n Char(32) inz('34962132373802111759071359071759');
  *n Char(32) inz('34962016373802181759071359071759');
  *n Char(32) inz('34962012373802181759071359071759');
  *n Char(32) inz('34962014373802151759071359071759');
  *n Char(32) inz('34962012373802131759071359071759');
  *n Char(32) inz('34962019373802111759071359071759');
  *n Char(32) inz('34962011373802101759071359071759');
  *n Char(32) inz('34962816373801191759071359071759');
  *n Char(32) inz('34962810373801191759071359071759');
  *n Char(32) inz('34962819373801121759071359071759');
  *n Char(32) inz('34962815373801121759071359071759');
  *n Char(32) inz('34962817373801101759071359071759');
  *n Char(32) inz('34962714373801191759071359071759');
  *n Char(32) inz('34962617372801141759071359071759');
  *n Char(32) inz('34962613372801131759071359071759');
  *n Char(32) inz('34962612372801131759071359071759');
  *n Char(32) inz('34962612372801111759071359071759');
  *n Char(32) inz('34962516372801191759071359071759');
  *n Char(32) inz('34962514372801181759071359071759');
  *n Char(32) inz('34962519372801161759071359071759');
  *n Char(32) inz('34962513372801121759071359071759');
  *n Char(32) inz('34962517372801111759071359071759');
  *n Char(32) inz('34962513372801111759071359071759');
  *n Char(32) inz('34962412372801181759071359071759');
  *n Char(32) inz('34962414372801171759071359071759');
  *n Char(32) inz('34962411370801171759071359071759');
  *n Char(32) inz('34962412370801161759071359071759');
  *n Char(32) inz('34962418370801131759071359071759');
  *n Char(32) inz('34962414370801101759071359071759');
  *n Char(32) inz('34962310370801191759071359071759');
  *n Char(32) inz('34962313370801161759071359071759');
  *n Char(32) inz('34962316370801131759071359071759');
  *n Char(32) inz('34962317370801111759071359071759');
  *n Char(32) inz('34962314370801111759071359071759');
  *n Char(32) inz('34962217370801171759071359071759');
  *n Char(32) inz('34962211370801161759071359071759');
  *n Char(32) inz('34962214370801141759071359071759');
  *n Char(32) inz('34962217371801131759071359071759');
  *n Char(32) inz('34962214371801111759071359071759');
  *n Char(32) inz('34962210371801101759071359071759');
  *n Char(32) inz('34962117371801161759071359071759');
  *n Char(32) inz('34962115371801161759071359071759');
  *n Char(32) inz('34962115371801151759071359071759');
  *n Char(32) inz('34962114371801151759071359071759');
  *n Char(32) inz('34962114371801121759071359071759');
  *n Char(32) inz('34962018371801191759071359071759');
  *n Char(32) inz('34962011371801191759071359071759');
  *n Char(32) inz('34962016371801171759071359071759');
  *n Char(32) inz('34962011371801161759071359071759');
  *n Char(32) inz('34962919371800141759071359071759');
  *n Char(32) inz('34962910372800131759071359071759');
  *n Char(32) inz('34962817372800111759071359071759');
  *n Char(32) inz('34962814372800101759071359071759');
  *n Char(32) inz('34962714372800131759071359071759');
  *n Char(32) inz('34962713372800131759071359071759');
  *n Char(32) inz('34962716372800111759071359071759');
  *n Char(32) inz('34962617372800191759071359071759');
  *n Char(32) inz('34962619372800171759071359071759');
  *n Char(32) inz('34962619372800151759071359071759');
  *n Char(32) inz('34962614372800141759071359071759');
  *n Char(32) inz('34962519372800161759071359071759');
  *n Char(32) inz('34962516372800151759071359071759');
  *n Char(32) inz('34962517373800121759071359071759');
  *n Char(32) inz('34962416373800171759071359071759');
  *n Char(32) inz('34962012373808101759071359071759');
  *n Char(32) inz('34962611373803191759071359071759');
  *n Char(32) inz('34962017373802101759071359071759');
  *n Char(32) inz('34962413373809181759071359071759');
  *n Char(32) inz('34962215373809101759071359071759');
  *n Char(32) inz('34962917373808151759071359071759');
  *n Char(32) inz('34962216373808161759071359071759');
  *n Char(32) inz('34962815373807111759071359071759');
  *n Char(32) inz('34962216373807101759071359071759');
  *n Char(32) inz('34962111373807181759071359071759');
  *n Char(32) inz('34962010371804151759071359071759');
  *n Char(32) inz('34962916371803111759071359071759');
  *n Char(32) inz('34962517371803151759071359071759');
  *n Char(32) inz('34962515371803131759071359071759');
  *n Char(32) inz('34962116371802121759071359071759');
  *n Char(32) inz('34962719371800141759071359071759');
  *n Char(32) inz('34962319371807161759381959071759');
  *n Char(32) inz('34962612371800161759071359071759');
  *n Char(32) inz('34962415371804191759071359071759');
  *n Char(32) inz('34962115371803191759212159071759');
  *n Char(32) inz('34962516371808111759072659071759');
  *n Char(32) inz('34962018370802151759071359071759');
  *n Char(32) inz('34962516370801121759071359071759');
  *n Char(32) inz('34962918370807161759071359071759');
  *n Char(32) inz('34962710370807181759071359071759');
  *n Char(32) inz('34962113370808141759071459071759');
  *n Char(32) inz('34962912370805161759071359071759');
  *n Char(32) inz('34962718370807101759071359071759');
  *n Char(32) inz('34962419370803171759071359071759');
  *n Char(32) inz('34962210370803111759071359071759');
  *n Char(32) inz('34962911370807141759071359071759');
  *n Char(32) inz('34962010370805131759071359071759');
  *n Char(32) inz('34962011370802151759071359071759');
  *n Char(32) inz('34962211371801141759071359071759');
  *n Char(32) inz('34962815371802181759071359071759');
  Contattone Char(32) dim(1659) Pos(1);
End-Ds Contattoni;

Dcl-S TextMsg       VarChar(100);
Dcl-C MAX           1500;
Dcl-C AP             '''';
dcl-s Old_Value int(20);
dcl-s New_Value int(20);
dcl-s Lock      int(20) Static(*allThread);

// ____________________________________________________________________________

Exec Sql
  Set Option Datfmt = *Iso, Timfmt = *Iso, Closqlcsr = *EndMod, Commit = *none

Command = 'ADDENVVAR ENVVAR(REMOTE_ADDR) VALUE('+AP+'192.168.0.232'+AP+')';
Rc = Cmd(Command);

Exec Sql
  Create or Replace table Paolos/CheckCont (
    Dataora timestamp default current timestamp,
    idx   Int,
    logtext varchar(100) ccsid 1144);

Exec Sql
  delete from Paolos/CheckCont;
IdxMain = 1;
ContTestDS = UChkCont1r(Contattone(1) :'TESTCONT2');
CheckResult(IdxMain : ContTestDS);

ThreadReadyArr(*) = 'A';
%Subst(ThreadReady :1 :MAX) = ' ';

For IdxMain = 1 to MAX;
  Rc = pthread_create(thread(IdxMain) : *Omit : %PAddr(CheckContattone) : %Addr(IdxMain));
  // Rc = pthread_detach(thread(IdxMain));
  Rc = pthread_setname_np(thread(IdxMain) :'TEST-' + %Char(IdxMain));
  USleep(20000);
EndFor;

For IdxMain = 1 to MAX;
  Rc = pthread_join (thread(IdxMain) : PtrStatus);
  TextMsg ='Fine Thread: ' + %Char(IdxMain) + 'Status: ' + %Char(Status);
  Exec Sql
    Insert into CheckCont (Idx, logtext)
    Values(:IdxMain, :TextMsg);
EndFor;

Return;
// ____________________________________________________________________________
Dcl-Proc CheckContattone;
  Dcl-Pi CheckContattone;
    PtrIdx Pointer value;
    // IdxTemp1       Int(10);
  End-Pi CheckContattone;
  Dcl-S IdxTemp1      Int(10) Based(PtrIdx);
  Dcl-S IdxTemp       Int(10);
  // ____________________________________________________________________________

  IdxTemp = IdxTemp1;

  ThreadReadyArr(IdxTemp) = '1';

  TextMsg ='Inizio Thread: ' + %Char(IdxTemp);
  Exec Sql
    Insert into CheckCont (Idx, logtext)
    Values(:IdxTemp, :TextMsg);

  DoW (Not (%scan(' ' :%Subst(ThreadReady :1 :MAX)) = 0));
    USleep(10);
    Iter;
  EndDo;

  TextMsg ='Inizio check contattone: ' + %Char(IdxTemp) + ' ' + Contattone(IdxTemp);
  Exec Sql
    Insert into CheckCont (Idx, logtext)
    Values(:IdxTemp, :TextMsg);

  ContTestDs = UChkCont1r(Contattone(IdxTemp) :'TESTCONT2' :'');

  TextMsg ='Fine check contattone: ' + %Char(IdxTemp) + ' ' + Contattone(IdxTemp);
  Exec Sql
    Insert into CheckCont (Idx, logtext)
    Values(:IdxTemp, :TextMsg);

  CheckResult(IdxTemp : ContTestDS);

  Return;

End-Proc CheckContattone;

// ____________________________________________________________________________
Dcl-Proc CheckResult;
  Dcl-Pi CheckResult;
    IdxCheck      Int(10) value;
    ContTestDS1   Likeds(ContTestDS);
  End-Pi CheckResult;

  // ____________________________________________________________________________

  Dsply %Char(IdxCheck);
  // accetto OKAY e ER10 (ip)
  //  e palmarone cliente 99999
  If (RetCode4 <> 'OKAY' and RetCode4<>'ER10' and
     %SubSt(TokenOutput:1:5) <> '99999');
    TextMsg ='Invalid Login Token ' + RetCode4 + '-' + Contattone(IdxCheck);
    Exec Sql
      Insert into CheckCont (Idx, logtext)
      Values(:IdxCheck, :TextMsg);

  Else;
    TextMsg ='Thread: ' + %Char(IdxCheck) + ' Token ' + RetCode4 + '-' + UserOut;
    Exec Sql
      Insert into CheckCont (Idx, logtext)
      Values(:IdxCheck, :TextMsg);
  EndIf;

  Return;

End-Proc CheckResult;